Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/processing/blinking_dot.po
Languages: de, ja

source: Blinking Dot
de: Blinkender Punkt
ja: Blinking Dot（ドットの点滅）

source: In this project, we will draw a dot on Processing, which blinks synchronously with the LED. Please build the circuit as shown in the diagram and run the sketch.
de: In diesem Projekt werden wir einen Punkt auf Processing zeichnen, der synchron mit der LED blinkt. Bitte bauen Sie die Schaltung wie im Diagramm gezeigt auf und führen Sie die Skizze aus.
ja: このプロジェクトでは、LEDと同期して点滅するProcessingにドットを描画します。図に示すように回路を構築し、スケッチを実行してください。

source: **Wiring**
de: **Verdrahtung**
ja: **回路**

source: **Sketch**
de: **Skizzieren**
ja: **スケッチ**

source: **How it works?**
de: **Wie es funktioniert?**
ja: **原理**

source: At the beginning of the sketch, you need to embed Processing's GPIO function library by ``import processing.io.*;``, which is indispensable for circuit experiments.
de: Am Anfang der Skizze müssen Sie die GPIO-Funktionsbibliothek von Processing durch ``import processing.io.*;`` einbetten, was für Schaltungsexperimente unverzichtbar ist.
ja: スケッチの最初に、回路実験に不可欠な ``importprocessing.io.*;`` を使用してProcessingのGPIO関数ライブラリを埋め込む必要があります。

source: **Frame rate** is the frequency of bitmaps appearing on the board, expressed in hertz (Hz). In other words, it is also the frequency at which the ``draw()`` function is called. In ``setup()``, setting the **frame rate** to 2 will call ``draw()`` every 0.5s.
de: **Framerate** ist die Frequenz der auf der Platine erscheinenden Bitmaps, ausgedrückt in Hertz (Hz). Mit anderen Worten, es ist auch die Häufigkeit, mit der die Funktion ``draw()`` aufgerufen wird. Wenn Sie in ``setup()`` die **Framerate** auf 2 setzen, wird ``draw()`` alle 0,5s aufgerufen.
ja: **フレームレート** は、ボードに表示されるビットマップの周波数であり、ヘルツ（Hz）で表されます。つまり、``draw（）`` 関数が呼び出される頻度でもあります。 ``setup（）`` で、**フレームレート** を2に設定すると、0.5秒ごとに ``draw（）`` が呼び出されます。

source: Each call of the ``draw()`` function takes the inverse of ``state`` and subsequently determines it. If the value is ``true``, the LED is lit and the brush is filled with red; if not, the LED is turned off and the brush is filled with gray.
de: Jeder Aufruf der Funktion ``draw()`` nimmt die Umkehrung von ``state`` und bestimmt diese anschließend. Wenn der Wert ``true`` ist, leuchtet die LED und der Pinsel ist rot gefüllt; wenn nicht, wird die LED ausgeschaltet und der Pinsel wird mit Grau gefüllt.
ja: ``draw（）`` 関数の各呼び出しは、``state`` の逆を取り、その後それを決定します。値が ``true`` の場合、LEDが点灯し、ブラシが赤で塗りつぶされます。そうでない場合は、LEDがオフになり、ブラシが灰色で塗りつぶされます。

source: After completing the judgment, use the ``ellipse()`` function to draw a circle. It should be noted that ``width`` and ``height`` are system variables used to store the width and height of the display window.
de: Verwenden Sie nach Abschluss der Beurteilung die Funktion ``ellipse()``, um einen Kreis zu zeichnen. Es sollte beachtet werden, dass ``width`` und ``height`` Systemvariablen sind, die verwendet werden, um die Breite und Höhe des Anzeigefensters zu speichern.
ja: 判定が終わったら、``ellipse()`` 関数を使って円を描きます。``width`` と ``height`` は、表示ウィンドウの幅と高さを格納するために使用されるシステム変数であることに注意してください。

source: There are two other points to note. When using GPIOs, you need to use the ``GPIO.pinMode()`` function to set the INPUT/OUTPUT state of the pin, and then use the ``GPIO.digitalWrite()`` function to assign a value (HIGH/LOW) to the pin .
de: Es sind noch zwei weitere Punkte zu beachten. Wenn Sie GPIOs verwenden, müssen Sie die Funktion ``GPIO.pinMode()`` verwenden, um den INPUT/OUTPUT-Zustand des Pins festzulegen, und dann die Funktion ``GPIO.digitalWrite()`` verwenden, um einen Wert (HIGH) /LOW) an den Stift .
ja: 注意すべき他の2つのポイントがあります。 GPIOを使用する場合は、``GPIO.pinMode()`` 関数を使用してピンのINPUT / OUTPUT状態を設定してから、``GPIO.digitalWrite()`` 関数を使用して値(HIGH/LOW)をピンに割り当てる必要があります。

source: Please try to avoid using ``delay()`` in ``draw()`` because it will affect the display window refresh.
de: Bitte vermeiden Sie die Verwendung von ``delay()`` in ``draw()``, da dies die Aktualisierung des Anzeigefensters beeinflusst.
ja: ``draw()`` で ``delay()`` を使用しないようにしてください。これは、表示ウィンドウの更新に影響します。

source: For more please refer to `Processing Reference <https://processing.org/reference/>`_.
de: Weitere Informationen finden Sie unter `Verarbeitungsreferenz <https://processing.org/reference/>`_.
ja: 詳細については、`Processing Reference <https://processing.org/reference/>`_ を参照してください。
