Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/processing/clickable_color_blocks.po
Languages: de, ja

source: Clickable Color Blocks
de: Anklickbare Farbblöcke
ja: Clickable Color Blocks（クリック可能なカラーブロック）

source: We've already tried drawing a clickable dot to control the LED, so let's take it a step further and draw 3 colored squares to adjust the RGB colors!
de: Wir haben bereits versucht, einen anklickbaren Punkt zu zeichnen, um die LED zu steuern, also gehen wir noch einen Schritt weiter und zeichnen 3 farbige Quadrate, um die RGB-Farben anzupassen!
ja: クリック可能なドットを描画してLEDを制御しようとしたので、さらに一歩進んで3色の正方形を描画してRGBカラーを調整しましょう!

source: **Wiring**
de: **Verdrahtung**
ja: **回路**

source: **Sketch**
de: **Skizzieren**
ja: **スケッチ**

source: **How it works?**
de: **Wie es funktioniert?**
ja: **原理**

source: This project has a lot in common with :ref:`Clickable Dot`, except that it refines the conditions for determining mouse click event.
de: Dieses Projekt hat viel mit :ref:`Clickable Dot` gemeinsam, außer dass es die Bedingungen für die Bestimmung des Mausklick-Ereignisses verfeinert.
ja: このプロジェクトは、マウスクリックイベントを決定するための条件を改善することを除いて、:ref:`Clickable Dot` と多くの共通点があります。

source: First draw three color blocks in ``draw()``, then get which color block was clicked based on the value of mouseX (the X-axis coordinate of the mouse), and finally make RGB light up the corresponding color.
de: Zeichnen Sie zuerst drei Farbblöcke in ``draw()``, ermitteln Sie dann, welcher Farbblock basierend auf dem Wert von mouseX (der X-Achsen-Koordinate der Maus) angeklickt wurde, und lassen Sie schließlich RGB die entsprechende Farbe aufleuchten.
ja: 最初に ``draw()`` で3つのカラーブロックを描画し、次にmouseX（マウスのX軸座標）の値に基づいてクリックされたカラーブロックを取得し、最後にRGBに対応する色を点灯させます。

source: **What more?**
de: **Was mehr?**
ja: **それと?**

source: Based on the addition of light, we can make RGB LED display seven colors - adding red to green produces yellow; adding all three primary colors together produces white. Now you can try it out for yourself.
de: Basierend auf der Zugabe von Licht können wir eine siebenfarbige RGB-LED-Anzeige erstellen - das Hinzufügen von Rot zu Grün erzeugt Gelb; Wenn man alle drei Primärfarben zusammen addiert, erhält man Weiß. Jetzt können Sie es selbst ausprobieren.
ja: 光の追加に基づいて、RGBLEDディスプレイを7色にすることができます。緑に赤を追加すると黄色になります。 3つの原色すべてを足し合わせると白になります。 今、それを自分で試すことができます。

source: For more please refer to `Processing Reference <https://processing.org/reference/>`_.
de: Weitere Informationen finden Sie unter `Verarbeitungsreferenz <https://processing.org/reference/>`_.
ja: 詳細については、`Processing Reference <https://processing.org/reference/>`_ を参照してください。
