Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/processing/dot_on_the_swing.po
Languages: de, ja

source: Dot on the Swing
de: Punkt auf der Schaukel
ja: Dot on the Swing（スイングのドット）

source: In this project, 3 buttons are connected, one to change the size of the dot, one to change the position and the last one to change the color. If you press all 3 buttons at the same time, you will get a dot that is swinging and has a variable color.
de: In diesem Projekt sind 3 Schaltflächen verbunden, eine zum Ändern der Punktgröße, eine zum Ändern der Position und die letzte zum Ändern der Farbe. Wenn Sie alle 3 Tasten gleichzeitig drücken, erhalten Sie einen schwingenden Punkt mit variabler Farbe.
ja: このプロジェクトでは、ドットのサイズを変更するためのボタン、位置を変更するためのボタン、色を変更するためのボタンの3つのボタンが接続されています。 3つのボタンすべてを同時に押すと、揺れるドットが表示され、色が変化します。

source: **Wiring**
de: **Verdrahtung**
ja: **回路**

source: **Sketch**
de: **Skizzieren**
ja: **スケッチ**

source: **How it works?**
de: **Wie es funktioniert?**
ja: **原理**

source: Instead of drawing dot directly, we create a ``Dot`` class here. Then, declare the object (in this case ``myDot``).
de: Anstatt einen Punkt direkt zu zeichnen, erstellen wir hier eine ``Dot``-Klasse. Dann deklarieren Sie das Objekt (in diesem Fall ``myDot``).
ja: ドットを直接描画する代わりに、ここで ``Dot`` クラスを作成します。 次に、オブジェクトを宣言します。（この場合は ``myDot``）

source: This is a simple way to draw dots with multiple identical properties. For example, if we add three functions to the dot in this project - change size, change position and change color - then each dot we declare will have the same function. We can use the same button to make them do the same thing, or we can use different buttons to control each dot separately.
de: Dies ist eine einfache Möglichkeit, Punkte mit mehreren identischen Eigenschaften zu zeichnen. Wenn wir beispielsweise dem Punkt in diesem Projekt drei Funktionen hinzufügen - Größe ändern, Position ändern und Farbe ändern -, dann hat jeder von uns deklarierte Punkt dieselbe Funktion. Wir können dieselbe Schaltfläche verwenden, damit sie dasselbe tun, oder wir können verschiedene Schaltflächen verwenden, um jeden Punkt separat zu steuern.
ja: これは、複数の同一のプロパティを持つドットを描画する簡単な方法です。 たとえば、このプロジェクトのドットに3つの関数（サイズの変更、位置の変更、色の変更）を追加すると、宣言する各ドットは同じ関数になります。 同じボタンを使用して同じことを実行することも、異なるボタンを使用して各ドットを個別に制御することもできます。

source: Using **classes** makes your sketch beautiful, powerful and flexible.
de: Die Verwendung von **Klassen** macht Ihre Skizze schön, kraftvoll und flexibel.
ja: **classes** を使用すると、スケッチが美しく、強力で、柔軟になります。

source: `Class (computer programming) - Wikipedia <https://en.wikipedia.org/wiki/Class_(computer_programming)>`_
de: `Klasse (Computerprogrammierung) - Wikipedia <https://de.wikipedia.org/wiki/Klasse_(Computerprogrammierung)>`_

source: Next, let's take a closer look at the ``Dot`` class.
de: Als nächstes werfen wir einen genaueren Blick auf die Klasse ``Dot``.
ja: 次に、``Dot`` クラスを詳しく見てみましょう。

source: In the declaration, it needs to pass in four parameters, which are the X and Y coordinate value of the position, the size, and the color (here it is set to the `HSB color mode <https://en.wikipedia.org/wiki/HSL_and_HSV>`_ ).
de: In der Deklaration muss es vier Parameter übergeben, nämlich den X- und Y-Koordinatenwert der Position, die Größe und die Farbe (hier ist es auf den `HSB-Farbmodus <https://en.wikipedia. org/wiki/HSL_and_HSV>`_ ).
ja: 宣言では、位置のX座標値とY座標値、サイズ、および色（ここでは、`HSB color mode <https://en.wikipedia.org/wiki/HSL_and_HSV>`_ )に設定されています）の4つのパラメーターを渡す必要があります。

source: Each parameter will be assigned to 2 sets of values ​​(initial value and current value).
de: Jedem Parameter werden 2 Wertesätze zugewiesen (Anfangswert und aktueller Wert).
ja: 各パラメータは、2セットの値（初期値と現在の値）に割り当てられます。

source: In addition to the initial value and the current value, there is also a set of range values. It is not difficult to understand that the initial value is used to determine the initial state of the dot (determined by the incoming parameters), while the current value will change within the range to make the dot move.
de: Neben dem Anfangswert und dem aktuellen Wert gibt es auch eine Reihe von Bereichswerten. Es ist nicht schwer zu verstehen, dass der Anfangswert verwendet wird, um den Anfangszustand des Punktes (bestimmt durch die eingehenden Parameter) zu bestimmen, während sich der aktuelle Wert innerhalb des Bereichs ändert, um den Punkt zu bewegen.
ja: 初期値と現在の値に加えて、範囲値のセットもあります。 初期値がドットの初期状態（入力パラメータによって決定される）を決定するために使用され、現在の値が範囲内で変化してドットを移動させることを意味します。

source: Therefore, except for the X coordinate value, the current values of the other three parameters are calculated as follows:
de: Daher werden die aktuellen Werte der anderen drei Parameter mit Ausnahme des X-Koordinatenwertes wie folgt berechnet:
ja: したがって、X座標値を除いて、他の3つのパラメーターの現在の値は次のように計算されます:

source: If you are familiar with trigonometric functions, it should not be difficult to understand `sine and cosine <https://en.wikipedia.org/wiki/Sine>`_, which gives a smooth periodic change (from -1 to 1) of the current value of the dot.
de: Wenn Sie mit trigonometrischen Funktionen vertraut sind, sollte es nicht schwer sein, `Sinus und Cosinus <https://en.wikipedia.org/wiki/Sine>`_ zu verstehen, was eine gleichmäßige periodische Änderung (von -1 zu 1) ergibt. des aktuellen Wertes des Punktes.
ja: 三角関数に精通している場合は、正弦と余弦 `sine and cosine <https://en.wikipedia.org/wiki/Sine>`_ を理解するのは難しくありません。これにより、ドットの現在の値が滑らかに周期的に変化します（-1から1）。

source: We also need to add a seed, ``timer``, for the periodic variation. It adds the fixed value in the method ``update()`` and is called in ``draw()``.
de: Wir müssen auch einen Startwert, ``timer``, für die periodische Variation hinzufügen. Es fügt den festen Wert in die Methode ``update()`` ein und wird in ``draw()`` aufgerufen.
ja: また、周期的な変動のためにシード、``timer`` を追加する必要があります。 これは、メソッド ``update()`` に固定値を追加し、``draw()`` で呼び出されます。

source: Finally, the dot is displayed according to the current value using the method ``show()``, which is also called in ``draw()``.
de: Schließlich wird der Punkt mit der Methode ``show()`` entsprechend dem aktuellen Wert angezeigt, die auch in ``draw()`` aufgerufen wird.
ja: 最後に、``draw()`` でも呼び出される ``show()`` メソッドを使用して、現在の値に従ってドットが表示されます。

source: **What more?**
de: **Was mehr?**
ja: **それと？**

source: Having mastered the use of classes, you can already draw multiple dots with the same properties, so why not try to do something cooler. For example, how about drawing a stable binary star system, or making a 'DUET' game?
de: Wenn Sie die Verwendung von Klassen beherrschen, können Sie bereits mehrere Punkte mit den gleichen Eigenschaften zeichnen. Warum also nicht etwas Cooleres versuchen? Wie wäre es zum Beispiel, ein stabiles Doppelsternsystem zu zeichnen oder ein 'DUET'-Spiel zu machen?
ja: クラスの使い方をマスターすれば、同じプロパティで複数のドットを描くことができるので、もっとクールなことをしてみませんか。 たとえば、安定した連星系を描いたり、'DUET'ゲームを作ったりするのはどうですか？

source: For more please refer to `Processing Reference <https://processing.org/reference/>`_.
de: Weitere Informationen finden Sie unter `Verarbeitungsreferenz <https://processing.org/reference/>`_.
ja: 詳細については、`Processing Reference <https://processing.org/reference/>`_ を参照してください。
