Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/processing/draw_a_matchmaker.po
Languages: de, ja

source: Draw a Matchmaker
de: Zeichne einen Matchmaker
ja: Draw a Matchmaker （仲人を描く）

source: You're now running the Processing Development Environment (or PDE). There's not much to it; the large area is the Text Editor, and there's a row of buttons across the top; this is the toolbar. Below the editor is the Message Area, and below that is the Console. The Message Area is used for one line messages, and the Console is used for more technical details.
de: Sie führen jetzt die Processing Development Environment (oder PDE) aus. Es ist nicht viel dabei; der große Bereich ist der Texteditor, und oben gibt es eine Reihe von Schaltflächen; Dies ist die Symbolleiste. Unterhalb des Editors befindet sich der Nachrichtenbereich und darunter die Konsole. Der Nachrichtenbereich wird für einzeilige Nachrichten verwendet, und die Konsole wird für weitere technische Details verwendet.
ja: これで、Processing Development Environment（PDE）を実行しています。 それほど多くはありません。 広い領域はテキストエディタで、上部にボタンの列があります。 これがツールバーです。 エディタの下にはメッセージエリアがあり、その下にはコンソールがあります。 メッセージエリアは1行のメッセージに使用され、コンソールはより技術的な詳細に使用されます。

source: Let's get familiar with the usage of Processing and draw a matchmaker.
de: Machen wir uns mit der Verwendung von Processing vertraut und ziehen wir einen Matchmaker.
ja: Processingの使用法に慣れて、仲人を描きましょう。

source: **Sketch**
de: **Skizzieren**
ja: **スケッチ**

source: Copy the sketch below into Processing and run it. A new display window will appear and a cheering matchmaker will be drawn.
de: Kopieren Sie die folgende Skizze in Processing und führen Sie sie aus. Ein neues Anzeigefenster erscheint und ein jubelnder Matchmaker wird ausgelost.
ja: 以下のスケッチをProcessingにコピーして実行します。 新しい表示ウィンドウが表示され、応援の仲人が描かれます。

source: If you run it and the message area turns red and reports some errors, then there is something wrong with the sketch. Make sure you copy the sample sketch exactly: numbers should be enclosed in parentheses, with commas between each number, and lines should end with semicolons.
de: Wenn Sie es ausführen und der Nachrichtenbereich rot wird und einige Fehler melden, dann stimmt etwas mit der Skizze nicht. Stellen Sie sicher, dass Sie die Beispielskizze genau kopieren: Zahlen sollten in Klammern eingeschlossen werden, mit Kommas zwischen jeder Zahl, und Zeilen sollten mit Semikolon enden.
ja: それを実行し、メッセージ領域が赤くなり、いくつかのエラーが報告された場合は、スケッチに問題があります。 サンプルスケッチを正確にコピーするようにしてください。数字は括弧で囲み、各数字の間にコンマを入れ、行はセミコロンで終了する必要があります。

source: **How it works?**
de: **Wie es funktioniert?**
ja: **原理**

source: The key here is to realize that the display window can be treated as a square of paper.
de: Der Schlüssel hier ist zu erkennen, dass das Anzeigefenster wie ein Quadrat aus Papier behandelt werden kann.
ja: ここで重要なのは、表示ウィンドウを正方形の紙として扱うことができることを理解することです。

source: Each pixel of the display window is a coordinate (x,y) that determines the position of a point in space. The origin (0,0) of the coordinates is in the upper left corner, the positive direction of the X-axis is horizontally to the right, and the positive direction of the Y-axis is vertically down.
de: Jedes Pixel des Anzeigefensters ist eine Koordinate (x,y), die die Position eines Punktes im Raum bestimmt. Der Ursprung (0,0) der Koordinaten liegt in der oberen linken Ecke, die positive Richtung der X-Achse liegt horizontal nach rechts und die positive Richtung der Y-Achse ist vertikal nach unten.
ja: 表示ウィンドウの各ピクセルは、空間内のポイントの位置を決定する座標（x、y）です。 座標の原点（0,0）は左上隅にあり、X軸の正の方向は水平方向に右、Y軸の正の方向は垂直方向に下向きです。

source: What we have to do is to specify what shape and color should appear at these pixel coordinates.
de: Was wir tun müssen, ist anzugeben, welche Form und Farbe an diesen Pixelkoordinaten erscheinen soll.
ja: 重要なのは、これらのピクセル座標にどのような形と色を表示するかを指定することです。

source: For example, draw a rectangle of width 20 and height 60 with coordinates (100,120) as the midpoint.
de: Zeichnen Sie beispielsweise ein Rechteck der Breite 20 und Höhe 60 mit den Koordinaten (100, 120) als Mittelpunkt.
ja: たとえば、座標（100,120）を中点として、幅20、高さ60の長方形を描画します。

source: Once we understand the relationship between the display window and the axes, this sketch is not difficult for us, we just need to understand some simple graphic drawing statements.
de: Sobald wir die Beziehung zwischen dem Anzeigefenster und den Achsen verstanden haben, fällt uns diese Skizze nicht schwer, wir müssen nur einige einfache grafische Zeichenanweisungen verstehen.
ja: 表示ウィンドウと軸の関係を理解したら、このスケッチは難しくありません。いくつかの簡単なグラフィック描画ステートメントを理解する必要があります。

source: ``size(width, height)``: Defines the dimension of the display window width and height in units of pixels.
de: ``size(width, height)``: Definiert die Dimension der Breite und Höhe des Anzeigefensters in Pixeleinheiten.
ja: ``size(width, height)``：表示ウィンドウの幅と高さの寸法をピクセル単位で定義します。

source: ``background(red, green, blue)``: Set the background color of the display window.
de: ``background(red, green, blue)``: Stellen Sie die Hintergrundfarbe des Anzeigefensters ein.
ja: ``background(red, green, blue)``：表示ウィンドウの背景色を設定します。

source: ``rectMode(mode)``: Modifies the location from which rectangles are drawn by changing the way in which parameters given to ``rect()`` are intepreted.
de: ``rectMode(mode)``: Ändert die Position, von der aus Rechtecke gezeichnet werden, indem die Art und Weise geändert wird, wie die an ``rect()`` übergebenen Parameter interpretiert werden.
ja: ``rectMode(mode)``：rect() に指定されたパラメーターの解釈方法を変更することにより、長方形が描画される場所を変更します。

source: ``rect(x, y, width, height)``: Draws a rectangle to the screen.
de: ``rect(x, y, width, height)``: Zeichnet ein Rechteck auf den Bildschirm.
ja: ``rect(x, y, width, height)``：画面に長方形を描画します。

source: ``ellipse(x, y, width, height)``: Draws an ellipse (oval) to the screen.
de: ``ellipse(x, y, width, height)``: Zeichnet eine Ellipse (oval) auf den Bildschirm.
ja: ``ellipse(x, y, width, height)``：画面に楕円（楕円）を描画します。

source: ``line(x1, y1, x2, y2)``: Draws a line (a direct path between two points) to the screen.
de: ``line(x1, y1, x2, y2)``: Zeichnet eine Linie (einen direkten Pfad zwischen zwei Punkten) zum Bildschirm.
ja: ``line(x1, y1, x2, y2)``：画面に線（2点間の直接パス）を描画します。

source: For more please refer to `Processing Reference <https://processing.org/reference/>`_.
de: Weitere Informationen finden Sie unter `Verarbeitungsreferenz <https://processing.org/reference/>`_.
ja: 詳細については、`Processing Reference <https://processing.org/reference/>`_ を参照してください。
