Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/processing/hello_mouse.po
Languages: de, ja

source: Hello Mouse
de: Hallo Maus
ja: Hello Mouse（こんにちはマウス）

source: In this project, your mouse will keep shooting lines towards a point; move the mouse and you will draw a unique line of stars. Press the mouse to restart the drawing.
de: In diesem Projekt schießt Ihre Maus weiterhin Linien auf einen Punkt; Bewegen Sie die Maus und Sie werden eine einzigartige Sternenlinie zeichnen. Drücken Sie die Maus, um die Zeichnung neu zu starten.
ja: このプロジェクトでは、マウスはポイントに向かって線を描き続けます。マウスを動かすと、ユニークな星の線が描画されます。マウスを押して、描画を再開します。

source: **Sketch**
de: **Skizzieren**
ja: **スケッチ**

source: **How it works?**
de: **Wie es funktioniert?**
ja: **原理**

source: The previous project was drawing a single image without any animation or interaction.
de: Das vorherige Projekt zeichnete ein einzelnes Bild ohne Animation oder Interaktion.
ja: 前のプロジェクトは、アニメーションやインタラクションなしで単一の画像を描画していました。

source: If we want to make an interactive sketch, we need to add the ``setup()`` and ``draw()`` functions (these are built-in functions that are called automatically) to build the frame.
de: Wenn wir eine interaktive Skizze erstellen möchten, müssen wir die Funktionen ``setup()`` und ``draw()`` (dies sind integrierte Funktionen, die automatisch aufgerufen werden) hinzufügen, um den Rahmen zu erstellen.
ja: インタラクティブなスケッチを作成する場合は、``setup()`` 関数と ``draw()`` 関数（これらは自動的に呼び出される組み込み関数）を追加してフレームを作成する必要があります。

source: ``setup()``: Executed only once at the start of the sketch.
de: ``setup()``: Wird nur einmal zu Beginn des Sketches ausgeführt.
ja: ``setup()``：スケッチの開始時に1回だけ実行されます。

source: ``draw()``: Executed repeatedly, where we usually add the sketch for drawing the animation.
de: ``draw()``: Wird wiederholt ausgeführt, wobei wir normalerweise die Skizze zum Zeichnen der Animation hinzufügen.
ja: ``draw()``：繰り返し実行されます。通常、アニメーションを描画するためのスケッチを追加します。

source: This sketch above already works smoothly as an interactive sketch.
de: Diese obige Skizze funktioniert bereits reibungslos als interaktive Skizze.
ja: 上記のこのスケッチは、インタラクティブなスケッチとしてすでにスムーズに機能します。

source: Next you can add a mouse click event. This event can be implemented with the ``mousePressed()`` function, where we add statements to refresh the target point and clear the screen.
de: Als nächstes können Sie ein Mausklick-Ereignis hinzufügen. Dieses Ereignis kann mit der Funktion ``mousePressed()`` implementiert werden, wo wir Anweisungen hinzufügen, um den Zielpunkt zu aktualisieren und den Bildschirm zu leeren.
ja: 次に、マウスクリックイベントを追加できます。 このイベントは、``mousePressed()`` 関数を使用して実装できます。この関数では、ステートメントを追加して、ターゲットポイントを更新し、画面をクリアします。

source: For more please refer to `Processing Reference <https://processing.org/reference/>`_.
de: Weitere Informationen finden Sie unter `Verarbeitungsreferenz <https://processing.org/reference/>`_.
ja: 詳細については、`Processing Reference <https://processing.org/reference/>`_ を参照してください。
