Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/processing/metronome.po
Languages: de, ja

source: Metronome
de: Metronom
ja: Metronome（メトロノーム）

source: Here we will make a metronome, the metronome is divided into 5 levels, the higher the level, the more urgent the buzzer call.
de: Hier machen wir ein Metronom, das Metronom ist in 5 Stufen unterteilt, je höher die Stufe, desto dringender der Summerruf.
ja: ここではメトロノームを作成します。メトロノームは5つのレベルに分けられ、レベルが高いほどブザーの呼び出しが緊急になります。

source: **Wiring**
de: **Verdrahtung**
ja: **回路**

source: An active buzzer is used here, and it has a white sticker on it.
de: Hier wird ein aktiver Summer verwendet, der mit einem weißen Aufkleber versehen ist.
ja: ここではアクティブブザーが使用されており、白いステッカーが貼られています。

source: **Sketch**
de: **Skizzieren**
ja: **スケッチ**

source: **How it works?**
de: **Wie es funktioniert?**
ja: **原理**

source: Here, we created a ``Slider`` class and made it act as **WIDGET**.
de: Hier haben wir eine ``Slider``-Klasse erstellt und sie als **WIDGET** fungieren lassen.
ja: ここでは、``Slider`` クラスを作成し、それを **WIDGET** として機能させました。

source: In the declaration, it needs to be passed in 7 parameters.
de: In der Deklaration muss es in 7 Parametern übergeben werden.
ja: 宣言では、7つのパラメーターで渡す必要があります。

source: The first four parameters determine the size of the widget, followed by the coordinates (x1, y1) of the starting point in the upper left corner and (x2, y2) in the lower right corner.
de: Die ersten vier Parameter bestimmen die Größe des Widgets, gefolgt von den Koordinaten (x1, y1) des Startpunkts in der oberen linken Ecke und (x2, y2) in der unteren rechten Ecke.
ja: 最初の4つのパラメーターはwidgetのサイズを決定し、その後に左上隅の開始点の座標（x1、y1）と右下隅の（x2、y2）が続きます。

source: The last three parameters determine its numerical range (min to max) and initial value.
de: Die letzten drei Parameter bestimmen seinen Zahlenbereich (min bis max) und den Anfangswert.
ja: 最後の3つのパラメーターは、その数値範囲（最小から最大）と初期値を決定します。

source: It has two methods, the effect of ``dragPoint()`` is to make the slider draggable and return the slider's current position value.
de: Es hat zwei Methoden, die Wirkung von ``dragPoint()`` besteht darin, den Schieberegler verschiebbar zu machen und den aktuellen Positionswert des Schiebereglers zurückzugeben.
ja: これには2つのメソッドがあります。``dragPoint()`` の効果は、スライダーをドラッグ可能にして、スライダーの現在の位置の値を返すことです。

source: Another method ``show()`` is to show the Slider. At the same time, the range value and current value are displayed in the corresponding position.
de: Eine andere Methode ``show()`` besteht darin, den Slider anzuzeigen. Gleichzeitig werden der Bereichswert und der aktuelle Wert an der entsprechenden Stelle angezeigt.
ja: 別のメソッド ``show()`` は、スライダーを表示することです。 同時に、範囲値と現在値が対応する位置に表示されます。

source: For more please refer to `Processing Reference <https://processing.org/reference/>`_.
de: Weitere Informationen finden Sie unter `Verarbeitungsreferenz <https://processing.org/reference/>`_.
ja: 詳細については、`Processing Reference <https://processing.org/reference/>`_ を参照してください。
