Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/processing/play_with_processing.po
Languages: de, ja

source: Play with Processing
de: Spielen Sie mit der Verarbeitung
ja: Processingで遊ぶ

source: What is Processing？
de: Was ist Verarbeitung?
ja: Processingとは？

source: Processing is a simple programming environment that was created to make it easier to develop visually oriented applications with an emphasis on animation and providing users with instant feedback through interaction. The developers wanted a means to \"sketch\" ideas in code. As its capabilities have expanded over the past decade, Processing has come to be used for more advanced production-level work in addition to its sketching role. Originally built as a domain-specific extension to Java targeted towards artists and designers, Processing has evolved into a full-blown design and prototyping tool used for large-scale installation work, motion graphics, and complex data visualization.
de: Processing ist eine einfache Programmierumgebung, die entwickelt wurde, um die Entwicklung visuell orientierter Anwendungen mit Schwerpunkt auf Animation zu erleichtern und Benutzern durch Interaktion sofortiges Feedback zu geben. Die Entwickler wollten ein Mittel, um Ideen im Code zu „skizzieren“. Da sich seine Fähigkeiten in den letzten zehn Jahren erweitert haben, wird Processing neben seiner Skizzierfunktion auch für anspruchsvollere Arbeiten auf Produktionsebene eingesetzt. Ursprünglich als domänenspezifische Erweiterung für Java für Künstler und Designer entwickelt, hat sich Processing zu einem ausgewachsenen Design- und Prototyping-Tool entwickelt, das für groß angelegte Installationsarbeiten, Motion Graphics und komplexe Datenvisualisierungen verwendet wird.
ja: Processingは、アニメーションに重点を置いた視覚指向のアプリケーションの開発を容易にし、対話を通じてユーザーに即時のフィードバックを提供するために作成された単純なプログラミング環境です。 開発者は、コードでアイデアを「スケッチ」する手段を望んでいました。 その機能が過去10年間で拡大するにつれて、Processingは、スケッチの役割に加えて、より高度な本番レベルの作業に使用されるようになりました。 もともとアーティストやデザイナーを対象としたJavaのドメイン固有の拡張機能として構築されたProcessingは、大規模なインストール作業、モーショングラフィックス、複雑なデータの視覚化に使用される本格的なデザインおよびプロトタイピングツールに進化しました。

source: Processing is based on Java, but because program elements in Processing are fairly simple, you can learn to use it even if you don't know any Java. If you're familiar with Java, it's best to forget that Processing has anything to do with Java for a while, until you get the hang of how the API works.
de: Processing basiert auf Java, aber da die Programmelemente in Processing recht einfach sind, können Sie es auch ohne Java-Kenntnisse erlernen. Wenn Sie mit Java vertraut sind, vergessen Sie am besten, dass Processing für eine Weile etwas mit Java zu tun hat, bis Sie sich mit der Funktionsweise der API vertraut gemacht haben.
ja: ProcessingはJavaに基づいていますが、Processingのプログラム要素は非常に単純であるため、Javaを知らなくても使用方法を学ぶことができます。 Javaに精通している場合は、APIがどのように機能するかを理解するまで、Processingはしばらくの間Javaと関係があることを忘れておくのが最善です。

source: This text is from the tutorial, `Processing Overview <https://processing.org/tutorials/overview/>`_.
de: Dieser Text stammt aus dem Tutorial `Processing Overview <https://processing.org/tutorials/overview/>`_.
ja: このテキストは、チュートリアル `Processing Overview <https://processing.org/tutorials/overview/>`_ からのものです。

source: Install the Processing
de: Installieren Sie die Verarbeitung
ja: Processingをインストールする

source: Before you can use Processing, you need to access the Raspberry Pi desktop remotely (:ref:`Remote Desktop`) or connect a display for the Raspberry Pi.
de: Bevor Sie Processing verwenden können, müssen Sie aus der Ferne auf den Raspberry Pi-Desktop zugreifen (:ref:`Remote Desktop`) oder ein Display für den Raspberry Pi anschließen.
ja: Processingを使用する前に、Raspberry Piデスクトップにリモートでアクセスするか（:ref:`Remote Desktop`）、RaspberryPiのディスプレイを接続する必要があります。

source: Run the following command in Terminal to install Processing.
de: Führen Sie den folgenden Befehl im Terminal aus, um Processing zu installieren.
ja: ターミナルで次のコマンドを実行して、Processingをインストールします。

source: Once the installation is complete, type ``processing`` to open it.
de: Wenn die Installation abgeschlossen ist, geben Sie ``processing`` ein, um sie zu öffnen.
ja: インストールが完了したら、``Processing`` と入力して開きます。

source: For a detailed tutorial, please refer to `Pi Processing <https://pi.processing.org/>`_.
de: Eine ausführliche Anleitung finden Sie unter `Pi Processing <https://pi.processing.org/>`_.
ja: 詳細なチュートリアルについては、`Pi Processing <https://pi.processing.org/>`_ を参照してください。

source: Projects
de: Projekte
ja: プロジェクト
