Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/processing/show_number.po
Languages: de, ja

source: Show Number
de: Anzahl anzeigen
ja: Show Number（番号を表示）

source: In this lesson, we use processing to drive a 7-segment display to show a figure from 0 to 9 and A to F.
de: In dieser Lektion verwenden wir die Verarbeitung, um eine 7-Segment-Anzeige anzusteuern, um eine Zahl von 0 bis 9 und A bis F anzuzeigen.
ja: このレッスンでは、processingを使用して7セグメントディスプレイを駆動し、0から9およびAからFの数値を表示します。

source: **Wiring**
de: **Verdrahtung**
ja: **回路**

source: **Sketch**
de: **Skizzieren**
ja: **スケッチ**

source: **How it works?**
de: **Wie es funktioniert?**
ja: **原理**

source: Import ``processing.io.*`` and use the GPIO function library to control the digital tube pins.
de: Importieren Sie ``processing.io.*`` und verwenden Sie die GPIO-Funktionsbibliothek, um die digitalen Röhrenpins zu steuern.
ja: ``processing.io。*`` をインポートし、GPIO関数ライブラリを使用してdigital tube pinsを制御します。

source: Define array ``SegCode = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71}`` which represents a segment code array from 0 to F in Hexadecimal (Common cathode).
de: Definiere das Array ``SegCode = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71}`` was ein Segmentcode-Array von 0 bis . darstellt F in Hexadezimal (gemeinsame Kathode).
ja: 配列を定義する ``SegCode = {0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71}`` 16進数中で、0からFまでのセグメントコード配列を表す（共通カソード）

source: ``setup()`` function sets the three pins SDI,RCLK and SRCLK as output, and the initial data as 0.
de: Die Funktion ``setup()`` setzt die drei Pins SDI,RCLK und SRCLK als Ausgang und die Anfangsdaten auf 0.
ja: ``setup()`` 関数は、3つのピンSDI、RCLK、SRCLKを出力として設定し、初期データを0として設定します。

source: ``hc595_shift(int dat)`` function is used to shift the ``SegCode`` to 74HC595.
de: Die Funktion ``hc595 shift(in data)`` wird verwendet, um den ``SegCode`` auf 74HC595 zu verschieben.
ja: ``hc595_shift(int dat)`` 関数は、 ``SegCode`` を74HC595にシフトするために使用されます。

source: ``n=(0x80 & (dat << i))`` means to shift dat to the left by ``i`` bits and then do the ``&`` operation with 0x80.
de: ``n=(0x80 & (dat << i))`` bedeutet, dat um ``i`` Bits nach links zu verschieben und dann die ``&`` Operation mit 0x80 auszuführen.
ja: ``n=(0x80 & (dat << i))`` は、datを ``i`` ビット左にシフトしてから、0x80と ``&`` 操作を実行することを意味します。

source: The rule of ``&`` operation is that when both sides of ``&`` are 1, the result is 1, otherwise the result is 0.
de: Die Regel der ``&``-Operation lautet, dass, wenn beide Seiten von ``und`` 1 sind, das Ergebnis 1 ist, andernfalls ist das Ergebnis 0.
ja: ``&`` 演算のルールは、 ``&`` の両側が1の場合、結果は1であり、それ以外の場合、結果は0です。

source: For example, we assume dat=0x3f,i=2(0011 1111 << 2 shift to 1111 1100), then 1111 1100 & 1000 0000 (0x80)) = 1000 0000.
de: Zum Beispiel nehmen wir an dat=0x3f,i=2(0011 1111 << 2 Verschiebung zu 1111 1100), dann 1111 1100 & 1000 0000 (0x80)) = 1000 0000.
ja: たとえば、dat=0x3f,i=2(0011 1111 << 2 shift to 1111 1100), then 1111 1100 & 1000 0000 (0x80)) = 1000 0000.

source: At last assign the dat data to SDI(DS) by bits.
de: Zuletzt weisen Sie SDI(DS) die Dat-Daten bitweise zu.
ja: 最後に、datデータをビット単位でSDI（DS）に割り当てます。

source: ``digitalWrite(SRCLK, 1)`` when SRCLK generates a rising edge pulse from 0 to 1, the data will be transferred from the DS register to the shift register;
de: ``digitalWrite(SRCLK, 1)`` wenn SRCLK einen Anstiegsflankenimpuls von 0 bis 1 erzeugt, werden die Daten vom DS-Register zum Schieberegister übertragen;
ja: ``digitalWrite(SRCLK, 1)`` SRCLKが0から1までの立ち上がりエッジパルスを生成すると、データはDSレジスタからシフトレジスタに転送されます。

source: ``digitalWrite(RCLK, 1)`` when RCLK generates a rising edge pulse from 0 to 1, the data will be transferred from the shift register to the storage register.
de: ``digitalWrite(RCLK, 1)`` Wenn RCLK einen Anstiegsflankenimpuls von 0 auf 1 erzeugt, werden die Daten vom Schieberegister zum Speicherregister übertragen.
ja: ``digitalWrite(RCLK, 1)`` RCLKが0から1までの立ち上がりエッジパルスを生成すると、データはシフトレジスタからストレージレジスタに転送されます。

source: ``fill()``: Sets the color used to fill shapes.
de: ``fill()``: Legt die Farbe fest, die zum Füllen von Formen verwendet wird.
ja: ``fill()``：図形の塗りつぶしに使用する色を設定します。

source: ``textAlign(CENTER,CENTER)``: Sets the current alignment for drawing text. The parameters ``LEFT``, ``CENTER``, and ``RIGHT`` set the display characteristics of the letters in relation to the values for the x and y parameters of the ``text()`` function.
de: ``textAlign(CENTER,CENTER)``: Legt die aktuelle Ausrichtung zum Zeichnen von Text fest. Die Parameter ``LEFT``, ``CENTER`` und ``RIGHT`` setzen die Darstellungseigenschaften der Buchstaben in Relation zu den Werten für die x- und y-Parameter der Funktion ``text()``.
ja: ``textAlign(CENTER,CENTER)``：テキストを描画するための現在の配置を設定します。 パラメータ ``LEFT``、``CENTER``、および ``RIGHT`` は、 ``text()`` 関数のxおよびyパラメータの値に関連して文字の表示特性を設定します。

source: ``textSize()``: Sets the current font size. This size will be used in all subsequent calls to the ``text()`` function. Font size is measured in units of pixels.
de: ``textSize()``: Setzt die aktuelle Schriftgröße. Diese Größe wird in allen nachfolgenden Aufrufen der Funktion ``text()`` verwendet. Die Schriftgröße wird in Pixeleinheiten gemessen.
ja: ``textSize()``：現在のフォントサイズを設定します。 このサイズは、以降の ``text()`` 関数のすべての呼び出しで使用されます。 フォントサイズはピクセル単位で測定されます。

source: These functions can customize the text style displayed on the processing.
de: Diese Funktionen können den bei der Verarbeitung angezeigten Textstil anpassen.
ja: これらの関数は、processingで表示されるテキストスタイルをカスタマイズできます。

source: The ``frameCount`` is a seed, which is related to ``frameRate``. By default ``frameRate`` is 60, which means that ``frameCount`` will accumulate 60 times per second.
de: Der ``frameCount`` ist ein Seed, der mit ``frameRate`` verwandt ist. Standardmäßig ist ``frameRate`` 60, was bedeutet, dass ``frameCount`` 60 Mal pro Sekunde akkumuliert.
ja: ``frameCount`` はシードであり、``frameRate`` に関連しています。 デフォルトでは、``frameRate`` は60です。これは、 ``frameCount`` が1秒間に60回累積することを意味します。

source: Then we can let processing and 7-segment display to show the figure from 0 to 9 and A to F simultaneously.
de: Dann können wir Verarbeitung und 7-Segment-Anzeige die Zahl von 0 bis 9 und A bis F gleichzeitig anzeigen lassen.
ja: 次に、processingと7セグメントディスプレイを使用して、0から9までの数字とAからFまでの数字を同時に表示できます。

source: For more please refer to `Processing Reference <https://processing.org/reference/>`_.
de: Weitere Informationen finden Sie unter `Verarbeitungsreferenz <https://processing.org/reference/>`_.
ja: 詳細については、`Processing Reference <https://processing.org/reference/>`_ を参照してください。
