Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/iot/attendance_system.po
Languages: de, ja

source: Attendance system
de: Anwesenheitssystem
ja: Attendance system（出席システム）

source: In this project, we use MFRC522 RFID Module and Cloud4RPi to make a system, you can view the attendance information on Cloud4RPi, or open the local .csv file to view the attendance records.
de: In diesem Projekt verwenden wir das MFRC522 RFID-Modul und Cloud4RPi, um ein System zu erstellen. Sie können die Anwesenheitsinformationen auf Cloud4RPi anzeigen oder die lokale .csv-Datei öffnen, um die Anwesenheitsdatensätze anzuzeigen.
ja: このプロジェクトでは、MFRC522 RFIDモジュールとCloud4RPiを使用してシステムを作成します。Cloud4RPiで出席情報を表示したり、ローカルの.csvファイルを開いて出席レコードを表示したりできます。

source: Due to the delay of network data transmission, the project only allows you to punch in when the green LED is on and upload data when the red LED is on.
de: Aufgrund der Verzögerung bei der Datenübertragung im Netzwerk ermöglicht das Projekt nur das Punch-In, wenn die grüne LED leuchtet, und das Hochladen von Daten, wenn die rote LED leuchtet.
ja: ネットワークデータ送信の遅延により、プロジェクトでは、緑色のLEDがオンのときにパンチインし、赤色のLEDがオンのときにデータをアップロードします。

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: Build the circuit.
de: Baue die Schaltung auf.
ja: 回路を構築します。

source: Open the code.
de: Öffnen Sie den code.
ja: コードを開きます。

source: Find the line below and fill in the correct device token.
de: Suchen Sie die folgende Zeile und geben Sie das richtige Geräte-Token ein.
ja: 下の行を見つけて、正しいデバイストークンを入力します。

source: Run the code.
de: Führen Sie den code aus.
ja: コードを実行します。

source: Go to Cloud4RPi, add a new control panel named **project5** and add 2 widgets (text and chart widgets) via the **Add widget** button.
de: Gehen Sie zu Cloud4RPi, fügen Sie ein neues Control Panel namens **project5** hinzu und fügen Sie 2 Widgets (Text- und Diagramm-Widgets) über die Schaltfläche **Widget hinzufügen** hinzu.
ja: Cloud4RPiに移動し、**project5** という名前の新しいコントロールパネルを追加し、**Add widget** ボタンを使用して2つのwidget（text and chart widgets）を追加します。

source: Once added, you can view the clock-in records for different time periods on the Chart widget (when the value of LED ON is True, it means someone clocked in), and then view the number of people who clocked in on the Text widget.
de: Nach dem Hinzufügen können Sie die Einstempel-Datensätze für verschiedene Zeiträume im Diagramm-Widget anzeigen (wenn der Wert von LED ON True ist, bedeutet dies, dass jemand eingestempelt wurde) und dann die Anzahl der Personen anzeigen, die sich im Text-Widget eingestempelt haben .
ja: 追加すると、チャートwidgetでさまざまな期間の出勤記録を表示し（LED ONの値がTrueの場合、誰かが出勤したことを意味します）、テキストwidgetで出勤した人の数を表示できます。

source: Also you can find the ``.csv`` file with the date under the path ``/home/pi/cloud4rpi-raspberrypi-python``.
de: Außerdem finden Sie die Datei ``.csv`` mit dem Datum unter dem Pfad ``/home/pi/cloud4rpi-raspberrypi-python``.
ja: また、パス ``/home/pi/cloud4rpi-raspberrypi-python`` の下に日付のある ``.csv`` ファイルを見つけることができます。

source: Open it with the following command.
de: Öffnen Sie es mit dem folgenden Befehl.
ja: 次のコマンドで開きます。

source: In this way, you can read the punch-in records of different time periods. On the left is the ID of different MFRC522 RFID modules, and on the right is the time of punching in.
de: Auf diese Weise können Sie die Punch-In-Protokolle verschiedener Zeiträume lesen. Links die IDs verschiedener MFRC522 RFID-Module und rechts der Zeitpunkt des Einstanzens.
ja: このようにして、さまざまな期間のパンチインレコードを読み取ることができます。 左側はさまざまなMFRC522RFIDモジュールのIDであり、右側はパンチインの時間です。

source: If the person's name is written to the MFRC522 RFID Module in advance, and then the id is replaced with text in the code (which will be mentioned later in the code explanation), so that the attendance sheet records the name of each person, rather than the ID of the card.
de: Wenn der Name der Person im Voraus in das MFRC522 RFID-Modul geschrieben wird und dann die ID durch Text im Code ersetzt wird (der später in der Codeerklärung erwähnt wird), so dass die Anwesenheitsliste den Namen jeder Person erfasst als die ID der Karte.
ja: 事前にMFRC522RFIDモジュールに人の名前を書き込んでから、コード内のテキスト（コードの説明は後述）にIDを置き換えると、出席シートに カードのIDより、各人の名前が記録されます。

source: Code Explanation
de: Code-Erklärung
ja: コードの説明

source: Set 2 LEDs as output and set the initial value to high.
de: Stellen Sie 2 LEDs als Ausgang ein und setzen Sie den Anfangswert auf hoch.
ja: 2つのLEDを出力として設定し、初期値を高に設定します。

source: Use the ``get_time()`` function to get the current timestamp and return two values. Where ``present_date`` is accurate to the day and ``present_time`` is accurate to the second.
de: Verwenden Sie die Funktion ``get_time()``, um den aktuellen Zeitstempel abzurufen und zwei Werte zurückzugeben. Wobei ``present_date`` auf den Tag genau und ``present_time`` auf die Sekunde genau ist.
ja: ``get_time()`` 関数を使用して、現在のtimestampを取得し、2つの値を返します。 ここで、``present_date`` はその日に対して正確であり、``present_time`` は秒に対して正確です。

source: First, we set ``attendance`` to False, which means that no one is clocked in.
de: Zuerst setzen wir ``attendance`` auf False, was bedeutet, dass niemand eingestempelt wird.
ja: まず、``attendance`` をFalseに設定します。これは、誰もクロックインされていないことを意味します。

source: Then set GreenPin to low level to light it, and RedPin to high level to keep it off, indicating that the current attendance system is working normally.
de: Setzen Sie dann GreenPin auf niedrige Stufe, um sie zu beleuchten, und RedPin auf hohe Stufe, um sie auszuschalten, was anzeigt, dass das aktuelle Anwesenheitssystem normal funktioniert.
ja: 次に、GreenPinを低レベルに設定して点灯させ、RedPinを高レベルに設定して消灯させます。これは、現在の出席システムが正常に機能していることを示します。

source: When someone punches in, the id and text information of the card will be printed. If the red LED is on and the green LED is off, it means that the check-in is successful and the result is sent to Cloud4RPi.
de: Wenn jemand einstanzt, werden die ID und die Textinformationen der Karte gedruckt. Wenn die rote LED an und die grüne LED aus ist, bedeutet dies, dass der Check-in erfolgreich war und das Ergebnis an Cloud4RPi gesendet wird.
ja: 誰かがパンチインすると、カードのIDとテキスト情報が印刷されます。 赤いLEDがオンで、緑のLEDがオフの場合は、チェックインが成功し、結果がCloud4RPiに送信されることを意味します。

source: During this period, the attendance system is in sleep state until the next cycle starts (the green light is on).
de: Während dieser Zeit befindet sich das Anwesenheitssystem im Ruhezustand, bis der nächste Zyklus beginnt (das grüne Licht leuchtet).
ja: この期間中、出席システムは次のサイクルが開始するまでスリープ状態になります（緑色のライトが点灯します）。

source: First determine if the id is duplicated in ``attendance_list`` by an if statement, if not, it means the punch-in is valid and pass the id information into ``attendance_list``. Then we get the current timestamp and use the id as the key of the ``attendance_statistics`` dictionary and ``present_time`` as the value of the corresponding key. In this way, the ``attendance_statistics`` dictionary stores the punch time of the current id.
de: Stellen Sie zuerst fest, ob die ID in ``attendance_list`` durch eine if-Anweisung dupliziert wird, wenn nicht, bedeutet dies, dass der Punch-In gültig ist und übergeben Sie die ID-Informationen an ``attendance_list``. Dann erhalten wir den aktuellen Zeitstempel und verwenden die ID als Schlüssel des Wörterbuchs ``attendance_statistics`` und ``present_time`` als Wert des entsprechenden Schlüssels. Auf diese Weise speichert das ``attendance_statistics``-Wörterbuch die Punch-Zeit der aktuellen ID.
ja: まず、ifステートメントによってIDが ``attendance_list`` で重複しているかどうかを判断します。重複していない場合は、パンチインが有効であることを意味し、ID情報を ``attendance_list`` に渡します。 次に、現在のtimestampを取得し、IDを ``attendance_statistics`` ディクショナリのキーとして使用し、``present_time`` を対応するキーの値として使用します。 このようにして、 ``attendance_statistics`` ディクショナリは現在のIDのパンチタイムを保存します。

source: Finally we write the ``attendance_statistics`` dictionary to a .csv file and name the file as ``'attendance_sheet.'' + present_date + '.csv'``, so that we store the attendance sheet in time order.
de: Schließlich schreiben wir das Wörterbuch ``attendance_statistics`` in eine .csv-Datei und benennen die Datei als ``'attendance_sheet.'' + present_date + '.csv'``, damit wir die Anwesenheitsliste in zeitlicher Reihenfolge speichern.
ja: 最後に、``attendance_statistics`` 辞書を.csvファイルに書き込み、ファイルに ``'attendance_sheet.'' + present_date + '.csv'`` という名前を付けて、出席シートを時間順に保存します。

source: If you have written the person's name in the MFRC522 RFID, then replace the ``id`` with ``text`` and your attendance sheet will record the name of the person.
de: Wenn Sie den Namen der Person in das MFRC522 RFID geschrieben haben, ersetzen Sie die ``id`` durch ``text`` und Ihr Anwesenheitsblatt wird den Namen der Person aufnehmen.
ja: MFRC522 RFIDに人の名前を書き込んだ場合は、``id`` を ``text`` に置き換えると、出席シートにその人の名前が記録されます。

source: Returns the length of ``attendance_list``, i.e. the number of attendees.
de: Gibt die Länge von ``attendance_list`` zurück, d.h. die Anzahl der Teilnehmer.
ja: ``attendance_list`` の長さ、つまり出席者の数を返します。
