Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/iot/learn_more_about_control.py.po
Languages: de, ja

source: Learn More about ``control.py``
de: Erfahren Sie mehr über ``control.py``
ja: ``control.py`` の詳細

source: In order to better understand the projects that follow, let's take a look at the official sample code provided by Cloud4RPi.
de: Um die folgenden Projekte besser zu verstehen, werfen wir einen Blick auf den offiziellen Beispielcode, der von Cloud4RPi bereitgestellt wird.
ja: 以下のプロジェクトをよりよく理解するために、Cloud4RPiによって提供される公式のサンプルコードを見てみましょう。

source: Please complete the previous section :ref:`Quick Guide on Cloud4RPi` before viewing this section.
de: Bitte lesen Sie den vorherigen Abschnitt :ref:`Quick Guide on Cloud4RPi`, bevor Sie diesen Abschnitt lesen.
ja: このセクションを表示する前に、前のセクション :ref:`Quick Guide on Cloud4RPi` を完了してください。

source: Open the ``control.py`` file.
de: Öffnen Sie die Datei ``control.py``.
ja: ``control.py`` ファイルを開きます。

source: Cloud4RPi will set a device token for each one, and you need to fill in the variable DEVICE_TOKEN with the correct device token in order to connect to the corresponding device.
de: Cloud4RPi setzt ein Gerätetoken für jedes Gerät, und Sie müssen die Variable DEVICE_TOKEN mit dem richtigen Gerätetoken ausfüllen, um sich mit dem entsprechenden Gerät zu verbinden.
ja: Cloud4RPiはそれぞれにDEVICE_TOKENを設定します。対応するデバイスに接続するには、変数DEVICE_TOKENに正しいDEVICE_TOKENを入力する必要があります。

source: ``variables`` is a 2-dimensional dictionary, and the value corresponding to each of its keys is also a dictionary.
de: ``Variablen`` ist ein 2-dimensionales Wörterbuch, und der Wert, der jedem seiner Schlüssel entspricht, ist ebenfalls ein Wörterbuch.
ja: ``variable`` は2次元辞書であり、その各キーに対応する値も辞書です。

source: The keys of the ``variables`` dictionary are ``'Room Temp'``, ``'LED On'``, ``'CPU Temp'``, ``'STATUS'``, ``'Location'``, which are all data displayed on the Control Panel's widgets.
de: Die Schlüssel des ``Variablen``-Wörterbuchs sind ``'Raumtemperatur``, ``'LED an``, ``'CPU-Temperatur``, ``'STATUS``, ``'Standort``, die alle in den Widgets des Control Panels angezeigt werden.
ja: ``variables`` 辞書のキーは ``'Room Temp'``、``'LED On'``、``'CPU温度'``、``'STATUS'``、 ``'Location'``、これはすべてコントロールパネルのウィジェットに表示されるデータです。

source: The value of each key in the ``variables`` dictionary is also a dictionary, and the keys of these dictionaries are the same, where the value of the ``'bind'`` key is a function that can return the transferred content, and the ``'type'`` is the data type of the transferred content (``'numeric'`` is a numeric type, ``'string'`` is a string type, ``'bool'`` is a boolean type, and ``'location'`` is a list containing two dictionaries).
de: Der Wert jedes Schlüssels im ``Variablen``-Wörterbuch ist ebenfalls ein Wörterbuch, und die Schlüssel dieser Wörterbücher sind gleich, wobei der Wert des ``'bind``-Schlüssels eine Funktion ist, die den übertragenen Inhalt zurückgeben kann, und der ``'Typ`` der Datentyp des übertragenen Inhalts ist (``'numeric`` ist ein numerischer Typ, ``'string`` ist ein String-Typ, ``'bool`` ist ein boolscher Typ, und ``'location`` ist eine Liste, die zwei Wörterbücher enthält).
ja: ``variables`` 辞書の各キーの値も辞書であり、これらの辞書のキーは同じです。ここで、``'bind'`` キーの値は、転送されたコンテンツを返すことができる関数です。 、および ``'type'`` は転送されたコンテンツのデータ型です（``'numeric'`` は数値型、``'string'`` は文字列型、``'bool'`` はブール型であり、``'location'`` は2つの辞書を含むリストです）。

source: Through the analysis of the ``variables`` dictionary, we can know that Cloud4RPi will read the keys of the ``variables`` dictionary and display the value corresponding to the key in the Control Panel. Obviously we cannot change the keys of the ``variables`` dictionary, but we can change the value in the key (the value of the ``'bind'`` dictionary) to let the widgets display the content we want.
de: Durch die Analyse des ``Variablen``-Wörterbuchs können wir wissen, dass Cloud4RPi die Schlüssel des ``Variablen``-Wörterbuchs ausliest und den Wert, der dem Schlüssel entspricht, im Control Panel anzeigt. Natürlich können wir die Schlüssel des ``Variablen``-Wörterbuchs nicht ändern, aber wir können den Wert im Schlüssel (den Wert des ``'bind``-Wörterbuchs) ändern, damit die Widgets den gewünschten Inhalt anzeigen.
ja: ``variables`` ディクショナリの分析を通じて、Cloud4RPiが ``variables`` ディクショナリのキーを読み取り、そのキーに対応する値をコントロールパネルに表示することがわかります。 もちろん、``variables`` ディクショナリのキーを変更することはできませんが、キーの値（``'bind'`` ディクショナリの値）を変更して、widgetに必要なコンテンツを表示させることはできます。

source: For example, if we want to send humidity values to Cloud4RPi, we cannot add a new key to the ``variables`` dictionary, but we can borrow a key, such as the ``'Room Temp'`` key, and then write the function that returns the humidity value in the corresponding ``'bind'`` key.
de: Wenn wir z.B. Luftfeuchtigkeitswerte an Cloud4RPi senden wollen, können wir keinen neuen Schlüssel zum ``Variablen``-Wörterbuch hinzufügen, aber wir können einen Schlüssel ausleihen, wie z.B. den ``Raumtemperatur``-Schlüssel, und dann die Funktion schreiben, die den Luftfeuchtigkeitswert im entsprechenden ``'bind``-Schlüssel zurückgibt.
ja: たとえば、湿度値をCloud4RPiに送信する場合、``variables`` ディクショナリに新しいキーを追加することはできませんが、``'Room Temp'`` キーなどのキーを借用してから、 対応する ``'bind'`` キーに湿度値を返す関数を記述します。

source: The ``vdiagnostics`` stores information about the Raspberry Pi and is used to verify and prevent misconnections.
de: Die ``vdiagnostics`` speichert Informationen über den Raspberry Pi und wird verwendet, um Fehlverbindungen zu überprüfen und zu verhindern.
ja: ``vdiagnostics`` は、Raspberry Piに関する情報を保存し、誤接続を検証および防止するために使用されます。
