Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/iot/quick_guide_on_cloud4RPi.po
Languages: de, ja

source: Quick Guide on Cloud4RPi
de: Kurzanleitung zu Cloud4RPi
ja: Cloud4RPiのクイックガイド

source: Install Cloud4RPi in Your Raspberry Pi
de: Installieren Sie Cloud4RPi auf Ihrem Raspberry Pi
ja: RaspberryPiにCloud4RPiをインストールします

source: It is advisable to update your system before installing.
de: Es ist ratsam, Ihr System vor der Installation zu aktualisieren.
ja: インストールする前にシステムを更新することをお勧めします。

source: Install/update the required packages.
de: Installieren/aktualisieren Sie die erforderlichen Pakete.
ja: 必要なパッケージをインストール/更新します。

source: Install Cloud4RPi with the following command:
de: Installieren Sie Cloud4RPi mit dem folgenden Befehl:
ja: 次のコマンドを使用してCloud4RPiをインストールします。

source: This tutorial provides the installation method for Python 3.0 and above. For lower versions of Python, the commands may need to be modified.
de: Diese Anleitung enthält die Installationsmethode für Python 3.0 und höher. Für niedrigere Versionen von Python müssen die Befehle möglicherweise geändert werden.
ja: このチュートリアルでは、Python3.0以降のインストール方法について説明します。 3.0以前のバージョンでは、コマンドを変更する必要がある場合があります。

source: Login to Cloud4RPi on Your Computer
de: Anmeldung bei Cloud4RPi auf Ihrem Computer
ja: PCでCloud4RPiにログインします

source: Open Chromium Web Browser and enter this link: https://cloud4rpi.io.
de: Öffnen Sie den Chromium Web Browser und geben Sie diesen Link ein: https://cloud4rpi.io.
ja: Chromium Webブラウザを開き、次のリンクを入力します：https：//cloud4rpi.io。

source: Before using it, you need to register and log in to your Cloud4RPi account.
de: Bevor Sie es benutzen können, müssen Sie sich registrieren und bei Ihrem Cloud4RPi-Konto anmelden.
ja: 使用する前に、Cloud4RPiアカウントに登録してログインする必要があります。

source: Once logged in, you should see two buttons at the top of Cloud4RPi, **Devices** to display the device connections and **Control Panels** to display the information received or sent from the Raspberry Pi on the webpage.
de: Sobald Sie eingeloggt sind, sollten Sie zwei Schaltflächen am oberen Rand von Cloud4RPi sehen: **Geräte**, um die Geräteverbindungen anzuzeigen, und **Kontrollfelder**, um die vom Raspberry Pi empfangenen oder gesendeten Informationen auf der Webseite anzuzeigen.
ja: ログインすると、Cloud4RPiの上部に2つのボタンが表示されます。**Devices** はデバイス接続を表示し、**Control Panels** はRaspberryPiから送受信された情報をWebページに表示します。

source: Connect Your Raspberry Pi to Cloud4RPi
de: Verbinden Sie Ihren Raspberry Pi mit Cloud4RPi
ja: RaspberryPiをCloud4RPiに接続します

source: After logging in, click the **Devices** option, and then click **New Device**.
de: Klicken Sie nach dem Einloggen auf die Option **Geräte** und dann auf **Neues Gerät**.
ja: ログイン後、**Devices** オプションをクリックし、**New Device** をクリックします。

source: Give the new device a name, and copy the current **Device token** to the clipboard.
de: Geben Sie dem neuen Gerät einen Namen, und kopieren Sie das aktuelle **Geräte-Token** in die Zwischenablage.
ja: 新しいデバイスに名前を付け、現在の **Device token** をクリップボードにコピーします。

source: Open the terminal of the Raspberry Pi and download the test examples provided by Cloud4RPi.
de: Öffnen Sie das Terminal des Raspberry Pi und laden Sie die von Cloud4RPi bereitgestellten Testbeispiele herunter.
ja: Raspberry Piのターミナルを開き、Cloud4RPiが提供するテスト例をダウンロードします。

source: Use a text editor such as Nano to modify the content of the ``control.py`` file.
de: Verwenden Sie einen Texteditor wie Nano, um den Inhalt der Datei ``control.py`` zu ändern.
ja: Nanoなどのテキストエディタを使用して、``control.py`` ファイルのコンテンツを変更します。

source: Find the following line of code.
de: Suchen Sie die folgende Codezeile.
ja: 次のコード行を見つけます。

source: Replace ``__YOUR_DEVICE_TOKEN__`` with the **Device token** copied from the Cloud4RPi. Press ``Ctrl + X`` to complete the modification.
de: Ersetzen Sie ``__YOUR_DEVICE_TOKEN__`` durch den **Geräte-Token**, den Sie von Cloud4RPi kopiert haben. Drücken Sie ``Strg + X``, um die Änderung abzuschließen.
ja: ``__YOUR_DEVICE_TOKEN__`` をCloud4RPiからコピーされた **Device token** に置き換えます。``Ctrl + X`` を押して変更を完了します。

source: Run the sample file ``control.py``.
de: Führen Sie die Beispieldatei ``control.py`` aus.
ja: サンプルファイル ``control.py`` を実行します。

source: Browse back to the Cloud4RPi server page. If your Raspberry Pi is connected to Cloud4RPi, the device information will turn green.
de: Gehen Sie zurück zur Cloud4RPi-Server-Seite. Wenn Ihr Raspberry Pi mit Cloud4RPi verbunden ist, werden die Geräteinformationen grün angezeigt.
ja: Cloud4RPiサーバーページに戻ります。 Raspberry PiがCloud4RPiに接続されている場合、デバイス情報は緑色に変わります。

source: Using the Cloud4RPi Control Panels
de: Verwendung der Cloud4RPi Control Panels
ja: Cloud4RPiコントロールパネルの使用

source: The control panel on the Cloud4RPi server provides many useful widgets for IoT applications. These widgets can be used to control the conponents or display sensor data.
de: Das Bedienfeld auf dem Cloud4RPi-Server bietet viele nützliche Widgets für IoT-Anwendungen. Diese Widgets können verwendet werden, um die Komponenten zu steuern oder Sensordaten anzuzeigen.
ja: Cloud4RPiサーバーのコントロールパネルは、IoTアプリケーションに役立つ多くのwidgetを提供します。 これらのwidgetを使用して、コンポーネントを制御したり、センサーデータを表示したりできます。

source: After entering **Control Panels**, click the **New Control Panel** button.
de: Nachdem Sie **Kontrollfelder** eingegeben haben, klicken Sie auf die Schaltfläche **Neues Kontrollfeld**.
ja: **Control Panels** に入ったら、**New Control Panel** ボタンをクリックします。

source: Always run the ``control.py`` file before using the Control Panel.
de: Führen Sie immer die Datei ``control.py`` aus, bevor Sie das Control Panel benutzen.
ja: コントロールパネルを使用する前に、必ず ``control.py`` ファイルを実行してください。

source: Enter a Control Panel name, and then click on the **Add Widget** button.
de: Geben Sie einen Namen für das Kontrollfeld ein, und klicken Sie dann auf die Schaltfläche **Widget hinzufügen**.
ja: コントロールパネルの名前を入力し、**Add Widget** ボタンをクリックします。

source: Before clicking the **Add Widget** button again, you need to select the appropriate widget and the variable to be displayed.
de: Bevor Sie erneut auf die Schaltfläche **Widget hinzufügen** klicken, müssen Sie das entsprechende Widget und die anzuzeigende Variable auswählen.
ja: **Add Widget** ボタンをもう一度クリックする前に、適切なwidgetと表示する変数を選択する必要があります。

source: For example, we select the **Text** widget and then select **Hot Water °C**, so that we can see it on the newly created control panel.
de: Wir wählen zum Beispiel das Widget **Text** aus und wählen dann **Heißwasser °C**, so dass wir es auf dem neu erstellten Bedienfeld sehen können.
ja: たとえば、**Text** widgetを選択してから **Hot Water °C** を選択すると、新しく作成されたコントロールパネルに表示されます。

source: We will introduce these displayed data in detail in the chapter :ref:`Learn More about ``control.py```.
de: Diese angezeigten Daten werden wir im Kapitel :ref:`Learn More about ``control.py``` ausführlich vorstellen.
ja: これらの表示データについては、この章で詳しく紹介します :ref:`Learn More about ``control.py```。
