Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/iot/remote_switch.po
Languages: de, ja

source: Remote Switch
de: Ferngesteuerter Schalter
ja: リモートスイッチ

source: In this project, we will learn to use Cloud4RPi's Switch to control the relay, thereby controlling the relay's load-LED. You can also change the load of the relay to household appliances, but with safety in mind.
de: In diesem Projekt werden wir lernen, den Schalter von Cloud4RPi zu verwenden, um das Relais zu steuern und damit die Last-LED des Relais zu kontrollieren. Sie können die Last des Relais auch auf Haushaltsgeräte ändern, aber mit Blick auf die Sicherheit.
ja: このプロジェクトでは、Cloud4RPiのスイッチを使用してリレーを制御し、それによってリレーの負荷LEDを制御する方法を学習します。 安全性を考慮して、リレーの負荷を家電製品に変更することもできます。

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: Build the circuit.
de: Bauen Sie die Schaltung auf.
ja: 回路を構築します。

source: Open the code.
de: Öffnen Sie den Code.
ja: コードを開きます。

source: Find the line below and fill in the correct device token.
de: Suchen Sie die untere Zeile und tragen Sie den richtigen Geräte-Token ein.
ja: 以下の行を見つけて、正しいデバイストークンを入力してください。

source: Run the code.
de: Führen Sie den Code aus.
ja: コードを実行します。

source: Go to Cloud4RPi, add a new Control Panel named project2, and click **Add Widget** to add a **Switch** widget.
de: Gehen Sie zu Cloud4RPi, fügen Sie ein neues Control Panel mit dem Namen project2 hinzu und klicken Sie auf **Widget hinzufügen**, um ein **Switch**-Widget hinzuzufügen.
ja: Cloud4RPiに移動し、project2という名前の新しいコントロールパネルを追加し、**Add Widget** をクリックして **Switch** widgetを追加します。

source: Once added, you can use the Switch widget to control the relay.
de: Nach dem Hinzufügen können Sie das Schalter-Widget zur Steuerung des Relais verwenden.
ja: 追加すると、Switch widgetを使用してリレーを制御できます。

source: Code Explanation
de: Code Erläuterung
ja: コードの説明

source: Relay connected to GPIO18 of the T-expansion board.
de: Relais angeschlossen an GPIO18 der T-Erweiterungskarte.
ja: T拡張ボードのGPIO18に接続されたリレー。

source: Set to BCM nomenclature and set ``RELAY_PIN`` to output.
de: Auf BCM-Nomenklatur einstellen und ``RELAY_PIN`` auf Ausgang setzen.
ja: BCMの命名法に設定し、``RELAY_PIN`` を出力に設定します。

source: This function controls the relay according to the ``value`` and returns the current level of the relay.
de: Diese Funktion steuert das Relais entsprechend dem ``Wert`` und gibt den aktuellen Pegel des Relais zurück.
ja: この関数は、``value`` に従ってリレーを制御し、リレーの現在のレベルを返します。

source: Since the relay works at high level, the relay closes when the switch state is True and opens when the switch state is False.
de: Da das Relais mit hohem Pegel arbeitet, schließt das Relais, wenn der Schaltzustand Wahr ist, und öffnet, wenn der Schaltzustand Falsch ist.
ja: リレーは高レベルで動作するため、スイッチの状態がTrueの場合はリレーが閉じ、スイッチの状態がFalseの場合はリレーが開きます。

source: By setting the value of the ``'value'`` key, we can set the initial value of the Switch widget, then always read the value of the ``'value'`` key and send the current level of ``RELAY_PIN`` (the value returned by the function ``relay_control()``) to Cloud4RPi.
de: Indem wir den Wert des ``'value'`` Schlüssels setzen, können wir den Anfangswert des Switch Widgets setzen, dann immer den Wert des ``'value'`` Schlüssels lesen und den aktuellen Pegel von ``RELAY_PIN`` (der Wert, der von der Funktion ``relay_control()`` zurückgegeben wird) an Cloud4RPi senden.
ja: ``'value'`` キーの値を設定することで、Switch widgetの初期値を設定し、常に ``'value'`` キーの値を読み取り、現在のレベルの ``RELAY_PIN`` を送信できます。（関数 ``relay_control()`` によって返される値）をCloud4RPiに送信します。
