Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/iot/smart_curtain.po
Languages: de, ja

source: Smart Curtain
de: Intelligenter Vorhang
ja: スマートカーテン

source: In this project, we will simulate a scenario where the curtains are automatically opened or closed according to the brightness of the room. When the photoresistor detects that the room brightness is too bright, Raspberry Pi will drive the motor to close the curtain; when the room brightness is too dark, the curtain will be opened.
de: In diesem Projekt werden wir ein Szenario simulieren, in dem die Vorhänge je nach Helligkeit des Raums automatisch geöffnet oder geschlossen werden. Wenn der Fotowiderstand erkennt, dass die Raumhelligkeit zu hell ist, treibt der Raspberry Pi den Motor an, um den Vorhang zu schließen; wenn die Raumhelligkeit zu dunkel ist, wird der Vorhang geöffnet.
ja: このプロジェクトでは、部屋の明るさに応じてカーテンが自動的に開閉するシナリオをシミュレートします。 フォトレジスターが部屋の明るさが明るすぎることを検出すると、RaspberryPiがモーターを駆動してカーテンを閉じます。 部屋の明るさが暗すぎるとカーテンが開きます。

source: Also you can view the indoor brightness change through text widget on Cloud4RPi, or control the lamp with Switch widget (for electricity safety, this experiment uses LED instead).
de: Sie können auch die Helligkeitsänderung im Innenraum über das Text-Widget auf Cloud4RPi anzeigen oder die Lampe mit dem Switch-Widget steuern (aus Gründen der elektrischen Sicherheit werden in diesem Experiment stattdessen LEDs verwendet).
ja: また、Cloud4RPiのテキストwidgetで室内の明るさの変化を確認したり、スイッチwidgetでランプを制御したりできます（電気の安全のため、この実験では代わりにLEDを使用します）。

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: Build the circuit.
de: Bauen Sie die Schaltung auf.
ja: 回路を構築します。

source: Open the code.
de: Öffnen Sie den Code.
ja: コードを開きます。

source: Find the line below and fill in the correct device token.
de: Suchen Sie die untere Zeile und tragen Sie den richtigen Geräte-Token ein.
ja: 以下の行を見つけて、正しいdevice tokenを入力してください。

source: Run the code.
de: Führen Sie den Code aus.
ja: コードを実行します。

source: Go to Cloud4RPi, add a new control panel named **project4** and add 3 widgets (Switch, Text and Chart widgets) via the **Add Widget** button.
de: Gehen Sie zu Cloud4RPi, fügen Sie ein neues Bedienfeld mit dem Namen **project4** hinzu und fügen Sie 3 Widgets (Switch-, Text- und Diagramm-Widgets) über die Schaltfläche **Add Widget** hinzu.
ja: Cloud4RPiに移動し、**project4** という名前の新しいコントロールパネルを追加し、**Add Widget** ボタンを使用して3つのwidget（Switch, TextおよびChart）を追加します。

source: Once added, you can use the Switch widget to control the LED; the value of the photoresistor on the Text widget will be updated every 1 minute, when the value > 100, the motor rotates clockwise for 5 seconds; if the value is less than 20, the motor rotates counterclockwise for 5 seconds. You can see the change over time in the Chart widget.
de: Der Wert des Fotowiderstands im Text-Widget wird alle 1 Minute aktualisiert. Ist der Wert größer als 100, dreht sich der Motor 5 Sekunden lang im Uhrzeigersinn; ist der Wert kleiner als 20, dreht sich der Motor 5 Sekunden lang gegen den Uhrzeigersinn. Sie können die Veränderung über die Zeit im Diagramm-Widget sehen.
ja: 追加すると、Switch widgetを使用してLEDを制御できます。 Text widgetのphotoresistorの値は1分ごとに更新され、値が100を超えると、モーターが時計回りに5秒間回転します。 値が20未満の場合、モーターは反時計回りに5秒間回転します。 Chart widgetで時間の経過に伴う変化を確認できます。

source: Code Explanation
de: Code Erläuterung
ja: コードの説明

source: Read the value of channel CH0 (with photoresistor connected) of the ADC0834. If the value is >100, the motor rotates clockwise for 5 seconds. If the value is less than 20, the motor rotates counterclockwise for 5 seconds.
de: Lesen Sie den Wert von Kanal CH0 (mit angeschlossenem Fotowiderstand) des ADC0834 ab. Wenn der Wert >100 ist, dreht sich der Motor 5 Sekunden lang im Uhrzeigersinn. Wenn der Wert kleiner als 20 ist, dreht sich der Motor 5 Sekunden lang gegen den Uhrzeigersinn.
ja: ADC0834のチャネルCH0（photoresistorが接続されている）の値を読み取ります。 値が>100の場合、モーターは時計回りに5秒間回転します。 値が20未満の場合、モーターは反時計回りに5秒間回転します。

source: Pass ``getValue()`` into the ``'bind'`` key as a callback function, so that the brightness value (the return value of the ``getValue()`` function) can be sent to the Text widget.
de: Übergeben Sie ``getValue()`` in die ``'bind'`` Taste als Callback-Funktion, so daß der Helligkeitswert (der Rückgabewert der ``getValue()`` Funktion) an das Text-Widget gesendet werden kann.
ja: callback関数として ``getValue()`` を ``'bind'`` キーに渡して、明るさの値（``getValue()`` 関数の戻り値）をText widgetに送信できるようにします 。
