Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/iot/smart_light.po
Languages: de, ja

source: Smart Light
de: Intelligentes Licht
ja: スマートライト

source: In this project, we will learn to control the brightness of LED with Cloud4RPi's Silder widget.
de: In diesem Projekt werden wir lernen, die Helligkeit von LEDs mit dem Silder-Widget von Cloud4RPi zu steuern.
ja: このプロジェクトでは、Cloud4RPiのSilder widgetを使用してLEDの明るさを制御する方法を学びます。

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: Build the circuit.
de: Bauen Sie die Schaltung auf.
ja: 回路を構築します。

source: Open the code.
de: Öffnen Sie den Code.
ja: コードを開きます。

source: Find the line below and fill in the correct device token.
de: Suchen Sie die untere Zeile und tragen Sie den richtigen Geräte-Token ein.
ja: 以下の行を見つけて、正しいdevice tokenを入力してください。

source: Run the code.
de: Führen Sie den Code aus.
ja: コードを実行します。

source: Go to Cloud4RPi, add a new Control Panel named project3, and click **Add Widget** to add a **Slider** widget.
de: Gehen Sie zu Cloud4RPi, fügen Sie ein neues Control Panel namens project3 hinzu und klicken Sie auf **Widget hinzufügen**, um ein **Slider**-Widget hinzuzufügen.
ja: Cloud4RPiに移動し、project3という名前の新しいコントロールパネルを追加し、**Add Widget** をクリックして **Slider** widgetを追加します。

source: Once added, you can use the Slider widget to control the brightness of the LED.
de: Nach dem Hinzufügen können Sie das Schieberegler-Widget verwenden, um die Helligkeit der LED zu steuern.
ja: 追加すると、Slider widgetを使用してLEDの明るさを制御できます。

source: Code Explanation
de: Code Erläuterung
ja: コードの説明

source: Call the ``GPIO.PWM()`` function to define ``LED_PIN`` as PWM pin and set the frequency of PWM pin to 2000Hz, then use the ``start()`` function to set the initial duty cycle to 0.
de: Rufen Sie die Funktion ``GPIO.PWM()`` auf, um ``LED_PIN`` als PWM-Pin zu definieren und setzen Sie die Frequenz des PWM-Pins auf 2000Hz, dann verwenden Sie die Funktion ``start()``, um das anfängliche Tastverhältnis auf 0 zu setzen.
ja: ``GPIO.PWM()`` 関数を呼び出して ``LED_PIN`` をPWMピンとして定義し、PWMピンの周波数を2000Hzに設定してから、``start()`` 関数を使用して初期デューティサイクルを0 に設定します。

source: The value sent by Slider widget to Raspberry Pi is used as PWM duty cycle to change the brightness of the LED.
de: Der vom Slider-Widget an den Raspberry Pi gesendete Wert wird als PWM-Tastverhältnis verwendet, um die Helligkeit der LED zu ändern.
ja: Slider widgetからRaspberryPiに送信された値は、LEDの明るさを変更するためのPWMデューティサイクルとして使用されます。

source: By setting the value of the ``'value'`` key, we can set the initial value of the Slider widget, then always read the value of the ``'value'`` key and send the current level of ``LED_PIN`` (the value returned by the function ``led_control``) to Cloud4RPi.
de: Indem wir den Wert des Schlüssels ``'value`` setzen, können wir den Anfangswert des Slider Widgets setzen, dann immer den Wert des Schlüssels ``'value`` lesen und den aktuellen Pegel von ``LED_PIN`` (der Wert, der von der Funktion ``led_control`` zurückgegeben wird) an Cloud4RPi senden.
ja: ``'value'`` キーの値を設定することで、Slider widgetの初期値を設定し、常に ``'value'`` キーの値を読み取り、現在のレベルの ``LED_PIN`` を送信できます。 （関数 ``led_control`` によって返される値）をCloud4RPiに送信します。
