Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/iot/temperature_and_humidity_acquisition.po
Languages: de, ja

source: Temperature and Humidity Acquisition
de: Erfassung von Temperatur und Luftfeuchtigkeit
ja: 温度と湿度の取得

source: In this project, we use DHT11 to read the surrounding temperature and humidity, and then display them on Cloud4RPi.
de: In diesem Projekt verwenden wir den DHT11, um die Umgebungstemperatur und die Luftfeuchtigkeit zu messen und sie dann auf Cloud4RPi anzuzeigen.
ja: このプロジェクトでは、DHT11を使用して周囲の温度と湿度を読み取り、Cloud4RPiに表示します。

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: Build the circuit.
de: Bauen Sie die Schaltung auf.
ja: 回路を構築します。

source: Open the code.
de: Öffnen Sie den Code.
ja: コードを開きます。

source: Find the line below and fill in the correct device token.
de: Suchen Sie die untere Zeile und tragen Sie den richtigen Geräte-Token ein.
ja: 以下の行を見つけて、正しいdevice tokenを入力してください。

source: Run the code.
de: Führen Sie den Code aus.
ja: コードを実行します。

source: Go to Cloud4RPi, add a new Control Panel named project1, and click **Add Widget**.
de: Gehen Sie zu Cloud4RPi, fügen Sie ein neues Control Panel mit dem Namen project1 hinzu und klicken Sie auf **Add Widget**.
ja: Cloud4RPiに移動し、project1という名前の新しいコントロールパネルを追加して、**Add Widget** をクリックします。

source: Select a **Chart** widget with both **Room Temp** and **CPU Temp** as the variables to be displayed.
de: Wählen Sie ein **Diagramm**-Widget mit den beiden Variablen **Raumtemperatur** und **CPU-Temperatur**, die angezeigt werden sollen.
ja: 表示する変数として **Room Temp** と **CPU Temp** の両方を含む **Chart** widgetを選択します。

source: Once added, you will see the temperature (Room Temp) and humidity (CPU Temp) curves over time, and you can adjust the display window by clicking on the options at the bottom right.
de: Nach dem Hinzufügen sehen Sie die Kurven der Temperatur (Raumtemperatur) und der Luftfeuchtigkeit (CPU-Temp) über die Zeit, und Sie können das Anzeigefenster anpassen, indem Sie auf die Optionen unten rechts klicken.
ja: 追加すると、時間の経過に伴う温度（室温）と湿度（CPU温度）の曲線が表示されます。右下のオプションをクリックして、表示ウィンドウを調整できます。

source: Code Explanation
de: Code Erläuterung
ja: コードの説明

source: Instantiate a dht11 object.
de: Instanziieren Sie ein dht11-Objekt.
ja: dht11オブジェクトをインスタンス化します。

source: The temperature (``result[1]``) is obtained by this function, and the function will not be interrupted until the reading is successful.
de: Die Temperatur (``Result[1]``) wird durch diese Funktion ermittelt, und die Funktion wird nicht unterbrochen, bis die Ablesung erfolgreich ist.
ja: 温度（``result[1]``）はこの関数によって取得され、読み取りが成功するまで関数は中断されません。

source: The humidity (``result[0]``) is obtained by this function, and the function will not be interrupted until the reading is successful.
de: Mit dieser Funktion wird die Luftfeuchtigkeit (``Result[0]``) ermittelt, und die Funktion wird nicht unterbrochen, bis die Ablesung erfolgreich war.
ja: 湿度（``result[0]``）はこの関数によって取得され、読み取りが成功するまで関数は中断されません。

source: The temperature is stored in the ``'bind'`` of the ``'Room Temp'`` key, and the humidity is stored in the ``'bind'`` of the ``'CPU Temp'`` key. When Cloud4RPi receives the ``variables`` dictionary, it will convert it into a JavaScript object that can be recognized by the web page.
de: Die Temperatur wird im ``'bind'`` des ``'Room Temp'`` Schlüssels gespeichert, und die Luftfeuchtigkeit wird im ``'bind'`` des ``'CPU Temp'`` Schlüssels gespeichert. Wenn Cloud4RPi das ``Variablen``-Wörterbuch erhält, wird es in ein JavaScript-Objekt umgewandelt, das von der Webseite erkannt werden kann.
ja: 温度は ``'Room Temp'`` キーの ``'bind'`` に保存され、湿度は ``'CPU Temp'`` キーの ``'bind'`` に保存されます 。 Cloud4RPiは、``variables`` 辞書を受け取ると、それをWebページで認識できるJavaScriptオブジェクトに変換します。
