Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/appendix/i2c_configuration.po
Languages: de, ja_jp

source: I2C Configuration
de: I2C-Konfiguration
ja_jp: I2Cコンフィギュレーション

source: **Step 1**: Enable the I2C port of your Raspberry Pi (If you have enabled it, skip this; if you do not know whether you have done that or not, please continue).
de: **Schritt 1**: Aktivieren Sie den I2C-Port Ihres Raspberry Pi (Wenn Sie ihn aktiviert haben, überspringen Sie diesen; wenn Sie nicht wissen, ob Sie das getan haben oder nicht, fahren Sie bitte fort).
ja_jp: **ステップ1** : Raspberry PiのI2Cポートを有効にしてください（有効にしている場合はスキップしてください。

source: **3 Interfacing options**
de: **3 Schnittstellenoptionen**
ja_jp: **3つのインターフェーシング・オプション**

source: **<Yes>, then <Ok> -> <Finish>**
de: **<Ja>, dann <Ok> -> <Fertig stellen>**

source: **Step 2:** Check whether the i2c modules are loaded and active.
de: **Schritt 2:** Prüfen Sie, ob die i2c-Module geladen und aktiv sind.
ja_jp: **Step 2:** i2cモジュールがロードされ、アクティブになっているかどうかを確認します。

source: Then the following codes will appear (the number may be different).
de: Dann erscheinen die folgenden Codes (die Nummer kann unterschiedlich sein).
ja_jp: すると、次のようなコードが表示されます（番号は異なる場合があります）。

source: **Step 3:** Install i2c-tools.
de: **Schritt 3:** Installieren Sie i2c-tools.
ja_jp: **ステップ3：** i2c-toolsをインストールします。

source: **Step 4:** Check the address of the I2C device.
de: **Schritt 4:** Überprüfen Sie die Adresse des I2C-Geräts.
ja_jp: **ステップ4：** I2Cデバイスのアドレスを確認します。

source: If there is an I2C device connected, the address of the device will be displayed.
de: Wenn ein I2C-Gerät angeschlossen ist, wird die Adresse des Geräts angezeigt.
ja_jp: I2Cデバイスが接続されている場合は、デバイスのアドレスが表示されます。

source: **Step 5:**
de: **Schritt 5:**
ja_jp: **ステップ5:**

source: **For C language users:** Install libi2c-dev.
de: **Für Benutzer der Sprache C:** Installieren Sie libi2c-dev.
ja_jp: **C言語をお使いの方へ：** libi2c-devをインストールしてください。

source: **For Python users:** Install smbus for I2C.
de: **Für Python-Benutzer:** Installieren Sie smbus für I2C.
ja_jp: **Pythonユーザーの場合：** I2C用のsmbusをインストールします。
