Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/appendix/remote_desktop.po
Languages: de, ja_jp

source: Remote Desktop
ja_jp: リモートデスクトップ

source: There are two ways to control the desktop of the Raspberry Pi remotely:
de: Es gibt zwei Möglichkeiten, den Desktop des Raspberry Pi aus der Ferne zu steuern:
ja_jp: RaspberryPiのデスクトップをリモートで制御する方法は2つあります。

source: **VNC** and **XRDP**, you can use any of them.
de: **VNC** und **XRDP**, Sie können jeden von ihnen verwenden.
ja_jp: **VNC** および **XRDP** 、これらのいずれかを使用できます。

source: You can use the function of remote desktop through VNC.
de: Sie können die Funktion des Remote-Desktops über VNC verwenden.
ja_jp: VNCを介してリモートデスクトップの機能を利用できます。

source: **Enable VNC service**
de: **VNC-Dienst aktivieren**
ja_jp: **VNCサービスを有効にする**

source: The VNC service has been installed in the system. By default, VNC is disabled. You need to enable it in config.
de: Der VNC-Dienst wurde im System installiert. VNC ist standardmäßig deaktiviert. Sie müssen es in der Konfiguration aktivieren.
ja_jp: VNCサービスがシステムにインストールされています。 デフォルトでは、VNCは無効になっています。 設定で有効にする必要があります。

source: **Step 1**
de: **Schritt 1**
ja_jp: **ステップ1**

source: Input the following command:
de: Geben Sie den folgenden Befehl ein:
ja_jp: 次のコマンドを入力します。

source: **Step 2**
de: **Schritt 2**
ja_jp: **ステップ2**

source: Choose **3** **Interfacing Options** by press the down arrow key on your keyboard, then press the **Enter** key.
de: Wählen Sie **3** **Schnittstellenoptionen**, indem Sie die Abwärtspfeiltaste auf Ihrer Tastatur drücken und dann die **Eingabetaste** drücken.
ja_jp: キーボードの下矢印キーを押して **3** **Interfacing Options** を選択し、次に **Enter** キーを押します。

source: **Step 3**
de: **Schritt 3**
ja_jp: **ステップ3**

source: **Step 4**
de: **Schritt 4**
ja_jp: **ステップ4**

source: Select **Yes -> OK -> Finish** to exit the configuration.
de: Wählen Sie **Ja -> OK -> Fertig**, um die Konfiguration zu beenden.
ja_jp: **Yes -> OK -> Finish** を選択して構成を終了します。

source: **Login to VNC**
de: **Bei VNC anmelden**
ja_jp: **VNCにログイン**

source: You need to download and install the `VNC Viewer <https://www.realvnc.com/en/connect/download/viewer/>`_ on personal computer. After the installation is done, open it.
de: Sie müssen den `VNC Viewer <https://www.realvnc.com/en/connect/download/viewer/>`_ herunterladen und auf Ihrem PC installieren. Nachdem die Installation abgeschlossen ist, öffnen Sie es.
ja_jp: `VNC Viewer <https://www.realvnc.com/en/connect/download/viewer/>` _をダウンロードしてパソコンにインストールする必要があります。 インストールが完了したら、それを開きます。

source: Then select \"**New connection**\".
de: Wählen Sie dann \"**Neue Verbindung**\".
ja_jp: 次に、\" **新しい接続**\" を選択します。

source: Input IP address of Raspberry Pi and any **Name**.
de: Geben Sie die IP-Adresse des Raspberry Pi und einen beliebigen **Namen** ein.
ja_jp: RaspberryPiのIPアドレスと任意の **名前** を入力します。

source: Double click the **connection** just created:
de: Doppelklicken Sie auf die soeben erstellte **Verbindung**:
ja_jp: 作成された **接続** をダブルクリックします：

source: **Step 5**
de: **Schritt 5**
ja_jp: **ステップ5**

source: Enter Username (**pi**) and Password (**raspberry** by default).
de: Geben Sie den Benutzernamen (**pi**) und das Passwort (standardmäßig **raspberry**) ein.
ja_jp: ユーザー名(**pi**)とパスワード(デフォルトでは **raspberry** )を入力します。

source: **Step 6**
de: **Schritt 6**
ja_jp: **ステップ6**

source: Now you can see the desktop of the Raspberry Pi:
de: Nun sehen Sie den Desktop des Raspberry Pi:
ja_jp: これで、Raspberry Piのデスクトップが見えてきました：

source: That's the end of the VNC part.
de: Das ist das Ende des VNC-Teils.
ja_jp: 以上でVNC部分の説明は終わりです。

source: Another method of remote desktop is XRDP, it provides a graphical login to remote machines using RDP (Microsoft Remote Desktop Protocol).
de: Eine andere Methode des Remote-Desktops ist XRDP. Sie bietet eine grafische Anmeldung an Remote-Computern mithilfe von RDP (Microsoft Remote Desktop Protocol).
ja_jp: リモートデスクトップのもう一つの方法はXRDPで、RDP（Microsoft Remote Desktop Protocol）を使用してリモートマシンへのグラフィカルなログインを提供します。

source: **Install XRDP**
de: **XRDP installieren**
ja_jp: **XRDPをインストールしてください**

source: Login to Raspberry Pi by using SSH.
de: Melden Sie sich mit SSH beim Raspberry Pi an.
ja_jp: Raspberry PiにSSHでログインします。

source: Input the following instructions to install XRDP.
de: Geben Sie die folgenden Anweisungen ein, um XRDP zu installieren.
ja_jp: 以下の手順を入力して、XRDPをインストールします。

source: Later, the installation starts.
de: Später startet die Installation.
ja_jp: その後、インストールが始まります。

source: Enter \"Y\", press key \"Enter\" to confirm.
de: Geben Sie \"Y\" ein, drücken Sie zur Bestätigung die Taste \"Enter\".
ja_jp: \"Y\" と入力し、\"Enter\" キーを押して確認します。

source: Finished the installation, you should login to your Raspberry Pi by using Windows remote desktop applications.
de: Nachdem Sie die Installation abgeschlossen haben, sollten Sie sich mit Windows-Remote-Desktop-Anwendungen bei Ihrem Raspberry Pi anmelden.
ja_jp: インストールが完了したら、Windowsのリモートデスクトップアプリケーションを使って、Raspberry Piにログインしてください。

source: **Login to XRDP**
de: **Bei XRDP anmelden**
ja_jp: **XRDPへのログイン**

source: If you are a Windows user, you can use the Remote Desktop feature that comes with Windows. If you are a Mac user, you can download and use Microsoft Remote Desktop from the APP Store, and there is not much difference between the two. The next example is Windows remote desktop.
de: Wenn Sie ein Windows-Benutzer sind, können Sie die mit Windows gelieferte Remotedesktopfunktion verwenden. Wenn Sie ein Mac-Benutzer sind, können Sie Microsoft Remote Desktop aus dem APP Store herunterladen und verwenden, und es gibt keinen großen Unterschied zwischen den beiden. Das nächste Beispiel ist der Windows-Remotedesktop.
ja_jp: Windowsユーザーであれば、Windowsに搭載されているリモートデスクトップ機能を利用できます。Macユーザーであれば、APP StoreからMicrosoft Remote Desktopをダウンロードして使用することができ、両者に大きな違いはありません。次の例は、Windowsのリモートデスクトップです。

source: Type in \"**mstsc**\" in Run (WIN+R) to open the Remote Desktop Connection, and input the IP address of Raspberry Pi, then click on \"Connect\".
de: Geben Sie \"**mstsc**\" in Run (WIN+R) ein, um die Remotedesktopverbindung zu öffnen, geben Sie die IP-Adresse des Raspberry Pi ein und klicken Sie dann auf \"Connect\".
ja_jp: Run(WIN+R)で \"**mstsc**\" と入力してRemote Desktop Connectionを開き、Raspberry PiのIPアドレスを入力して、\"Connect\" をクリックします。

source: Then the xrdp login page pops out. Please type in your username and password. After that, please click \"OK\". At the first time you log in, your username is \"pi\" and the password is \"raspberry\".
de: Dann erscheint die xrdp-Anmeldeseite. Bitte geben Sie Ihren Benutzernamen und Ihr Passwort ein. Danach klicken Sie bitte auf \"OK\". Bei der ersten Anmeldung lautet Ihr Benutzername \"pi\" und das Passwort \"raspberry\".
ja_jp: 次に、xrdpログインページが表示されます。 ユーザー名とパスワードを入力してください。 その後、 \"OK\" をクリックしてください。 初めてログインするときのユーザー名は \"pi\" 、パスワードは「raspberry」です。

source: Here, you successfully login to RPi by using the remote desktop.
de: Hier melden Sie sich erfolgreich über den Remote-Desktop bei RPi an.
ja_jp: ここでは、リモートデスクトップを使用してRPiに正常にログインできます。

source: **Copyright Notice**
de: **Urheberrechtshinweis**
ja_jp: **著作権表示**

source: All contents including but not limited to texts, images, and code in this manual are owned by the SunFounder Company. You should only use it for personal study, investigation, enjoyment, or other non-commercial or nonprofit purposes, under the related regulations and copyrights laws, without infringing the legal rights of the author and relevant right holders. For any individual or organization that uses these for commercial profit without permission, the Company reserves the right to take legal action.
de: Alle Inhalte, einschließlich, aber nicht beschränkt auf Texte, Bilder und Code in diesem Handbuch, sind Eigentum der SunFounder Company. Sie sollten es nur für persönliche Studien, Recherchen, Genuss oder andere nicht-kommerzielle oder gemeinnützige Zwecke gemäß den entsprechenden Vorschriften und Urheberrechtsgesetzen verwenden, ohne die gesetzlichen Rechte des Autors und der entsprechenden Rechteinhaber zu verletzen. Für Einzelpersonen oder Organisationen, die diese ohne Erlaubnis zu kommerziellen Zwecken verwenden, behält sich das Unternehmen das Recht vor, rechtliche Schritte einzuleiten.
ja_jp: このマニュアルのテキスト、画像、コードを含むがこれらに限定されないすべてのコンテンツは、SunFounderCompany が所有しています。 著者および関連する権利所有者の法的権利を侵害することなく、関連する規制および著作権法に基づいて、個人的な調査、調査、楽しみ、またはその他の非営利または非営利目的でのみ使用する必要があります。 これらを許可なく営利目的で使用する個人または組織については、当社は法的措置を取る権利を留保します。
