Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/1.1.7_i2c_lcd1602.po
Languages: de, ja

source: Introduction
de: Einführung
ja: 前書き

source: LCD1602 is a character type liquid crystal display, which can display 32 (16*2) characters at the same time.
de: LCD1602 ist eine Flüssigkristallanzeige vom Zeichentyp, die gleichzeitig 32 (16 * 2) Zeichen anzeigen kann.
ja: LCD1602は文字型液晶ディスプレイで、32（16 * 2）文字を同時に表示できる。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: As we all know, though LCD and some other displays greatly enrich the man-machine interaction, they share a common weakness. When they are connected to a controller, multiple IOs will be occupied of the controller which has no so many outer ports. Also it restricts other functions of the controller. Therefore, LCD1602 with an I2C bus is developed to solve the problem.
de: Wie wir alle wissen, bereichern LCD und einige andere Anzeiger die Mensch-Maschine-Interaktion erheblich, weisen jedoch eine gemeinsame Schwäche auf. Wenn sie mit einem Controller verbunden sind, werden mehrere E / A des Controllers belegt, der nicht so viele äußere Ports hat. Es schränkt auch andere Funktionen der Steuerung ein. Daher wurde LCD1602 mit einem I2C-Bus entwickelt, um das Problem zu lösen.
ja: ご存知のように、LCDやその他のディスプレイはマンマシンの相互作用を大幅に強化するが、共通の弱点を共有している。それらがコントローラーに接続されると、外部ポートがあまりないコントローラーの複数のIOが占用される。また、コントローラーの他の機能も制限される。したがって、この問題を解決するために、I2Cバスを備えたLCD1602が開発された。

source: **I2C communication**
de: **I2C-Kommunikation**
ja: **I2C通信**

source: I2C(Inter-Integrated Circuit) bus is a very popular and powerful bus for communication between a master device (or master devices) and a single or multiple slave devices.
de: Der I2C-Bus (Inter-Integrated Circuit) ist ein sehr beliebter und leistungsstarker Bus für die Kommunikation zwischen einem Master-Gerät (oder Master-Geräten) und einem oder mehreren Slave-Geräten.
ja: I2C（アイ・スクエアド・シー）バスは、一つマスターデバイス（または複数のマスターデバイス）と単一または複数のスレーブデバイス間の通信用の非常に強力なバスである。

source: I2C main controller can be used to control IO expander, various sensors, EEPROM, ADC/DAC and so on. All of these are controlled only by the two pins of host, the serial data (SDA1) line and the serial clock line(SCL1).
de: Der I2C-Hauptcontroller kann zur Steuerung des E / A-Expanders, verschiedener Sensoren, des EEPROM, des ADC / DAC usw. verwendet werden. Alle diese werden nur von den beiden Pins des Hosts gesteuert, der seriellen Datenleitung (SDA1) und der seriellen Taktleitung (SCL1).
ja: I2Cメインコントローラーを使用して、IOエクスパンダー、各種センサー、EEPROM、ADC/DACなどを制御できる。これらはすべて、ホストの2つのピン、シリアルデータ（SDA1）ラインとシリアルクロックライン（SCL1）によってのみ制御される。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: T-Board Name
de: T-Karte Name
ja: Tボード名

source: physical
de: physisch

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: **Step 2**: Setup I2C (see :ref:`I2C Configuration`. If you have set I2C, skip this step.)
de: **Schritt 2**: I2C einrichten (siehe :ref:`I2C Configuration`. Wenn Sie I2C eingestellt haben, überspringen Sie diesen Schritt.)
ja: **ステップ2：** I2Cをセットアップします（:ref:`I2C Configuration`。I2Cを設定している場合は、このステップをスキップしてください。）

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 3:** Change directory.
de: **Schritt 3:** Verzeichnis wechseln.
ja: **ステップ3：** ディレクトリを変更する。

source: **Step 4:** Compile.
de: **Schritt 4:** Kompilieren.
ja: **ステップ4：** コンパイルする。

source: **Step 5:** Run.
de: **Schritt 5:** Ausführen.
ja: **ステップ5：** 実行する。

source: After the code runs, you can see \"Greetings\",\"From SunFounder\" displaying on the LCD.
de: Nachdem die Kode ausgeführt wurde, werden auf dem LCD "Grüße" und "Von SunFounder" angezeigt.
ja: コードの実行後、LCDに「Greetings」、「SunFounderから」が表示される。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: These functions are used to control I2C LCD1602 open source code. They allow us to easily use I2C LCD1602. Among these functions, init() is used for initialization, clear() is used to clear the screen, write() is used to write what is displayed, and other functions support the above functions.
de: Diese Funktionen werden zur Steuerung des Open Source-Codes I2C LCD1602 verwendet. Sie ermöglichen die einfache Verwendung von I2C LCD1602. Unter diesen Funktionen wird init () zur Initialisierung verwendet, clear () wird zum Löschen des Bildschirms verwendet, write () wirdzum Schreiben der angezeigten Elemente verwendet und andere Funktionen unterstützen die obigen Funktionen.
ja: これらの関数は、I2C LCD1602オープンソースコードを制御するために使用される。これにより、I2C LCD1602を簡単に使用できる。これらの関数の中で、init()は初期化に使用され、clear()は画面の消去に使用され、write()は表示内容の書き込みに使用され、他の関数は上記の関数をサポートする。

source: This function initializes the I2C system with the specified device symbol. The prototype of the function:
de: Diese Funktion initialisiert das I2C-System mit dem angegebenen Gerätesymbol. Der Prototyp der Funktion:
ja: この関数は指定されたデバイスシンボルでI2Cシステムを初期化する。関数のプロトタイプ：

source: Parameters devId is the address of the I2C device, it can be found through the i2cdetect command(see Appendix) and the devId of I2C LCD1602 is generally 0x27.
de: Parameter devId ist die Adresse des I2C-Geräts. Sie kann über den Befehl i2cdetect (siehe Anhang) ermittelt werden. Die devId des I2C LCD1602 ist im Allgemeinen 0x27.
ja: パラメーターdevIdはI2Cデバイスのアドレスであり、i2cdetectコマンド（付録を参照）で見つけることができ、I2C LCD1602のdevIdは通常0x27である。

source: In this function, data[] is the character to be printed on the LCD, and the parameters x and y determine the printing position (line y+1, column x+1 is the starting position of the character to be printed).
de: In dieser Funktion ist data [] das Zeichen, das auf dem LCD gedruckt werden soll, und die Parameter x und y bestimmen die Druckposition (Zeile y + 1, Spalte x + 1 ist die Startposition des zu druckenden Zeichens).
ja: この関数では、data []はLCDにプリントされる文字であり、パラメーターxとyはプリントの位置を決定する（行y + 1、列x + 1はプリントされる文字の開始位置である）。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 4:** Run.
de: **Schritt 4:** Ausführen.
ja: **ステップ4：** 実行。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: This file is an open source file for controlling I2C LCD1602. It allows us to easily use I2C LCD1602.
de: Diese Datei ist eine Open Source-Datei zur Steuerung von I2C LCD1602. Es ermöglicht uns die einfache Verwendung von I2C LCD1602.
ja: このファイルはI2C LCD1602を制御するためのオープンソースファイルである。I2C LCD1602を簡単に使用できる。

source: The function initializes the I2C system with the designated device symbol. The first parameter is the address of the I2C device, which can be detected through the i2cdetect command (see Appendix for details). The address of I2C LCD1602 is generally 0x27.
de: Die Funktion initialisiert das I2C-System mit dem angegebenen Gerätesymbol. Der erste Parameter ist die Adresse des I2C-Geräts, die mit dem Befehl i2cdetect erkannt werden kann (Einzelheiten siehe Anhang). Die Adresse des I2C LCD1602 lautet im Allgemeinen 0x27.
ja: この関数は指定されたデバイスシンボルでI2Cシステムを初期化する。最初のパラメーターはI2Cデバイスのアドレスで、i2cdetectコマンドで検出できる（詳細については付録を参照してください）。I2C LCD1602のアドレスは通常0x27である。

source: Within this function, \'Greetings!!\' is the character to be printed on the Row 0+1, column 0+1 on LCD. Now you can see \"Greetings! From SunFounder\" displayed on the LCD.
de: Innerhalb dieser Funktion 'Grüße !!' ist das Zeichen, das in der Zeile 0 + 1, Spalte 0 + 1 auf dem LCD gedruckt werden soll. Jetzt können Sie "Grüße! Von SunFounder" auf dem LCD angezeigt.
ja: この関数内で、'Greetings!!' は、LCDの行0 + 1、列0 +1に印刷される文字です。これで、LCDに "Greetings！From SunFounder" が表示されます。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像

source: **Code**
ja: **コード**
