Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/1.1.2_rgb_led.po
Languages: de, ja

source: Introduction
de: Einführung
ja: 前書き

source: In this lesson, we will use it to control an RGB LED to flash various kinds of colors.
de: In dieser Lektion steuern wir mit eine RGB-LED, die verschiedene Arten von Farben zu blinken.
ja: このレッスンでは、これを使用してRGB LEDを制御し、さまざまな種類の色を点滅させる。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: Pulse Width Modulation, or PWM, is a technique for getting analog results with digital means. Digital control is used to create a square wave, a signal switched between on and off. This on-off pattern can simulate voltages in between full on (5 Volts) and off (0 Volts) by changing the portion of the time the signal spends on versus the time that the signal spends off. The duration of \"on time\" is called pulse width. To get varying analog values, you change, or modulate, that width. If you repeat this on-off pattern fast enough with some device, an LED for example, the result would be like this: the signal is a steady voltage between 0 and 5v controlling the brightness of the LED.
de: Die Pulsweitenmodulation oder PWM ist eine Technik, mit der analoge Ergebnisse mit digitalen Mitteln erzielt werden können. Die digitale Steuerung wird verwendet, um eine Rechteckwelle zu erzeugen, um ein Signal zwischen Ein und Aus zu schalten. Dieses Ein-Aus-Muster kann Spannungen zwischen Voll-Ein (5 Volt) und Aus (0 Volt) simulieren, mit der Änderung von Zeit, in dem das Signal an ist, gegenüber der Zeit, in der das Signal abläuft. Die Dauer der "Einschaltzeit" wird als Impulsbreite bezeichnet. Um unterschiedliche analoge Werte zu erhalten, ändern oder modulieren Sie diese Breite. Wenn Sie dieses Ein-Aus-Muster mit einem Gerät, beispielsweise einer LED, schnell genug wiederholen, sieht das Ergebnis folgendermaßen aus: Das Signal ist eine konstante Spannung zwischen 0 und 5 V, die die Helligkeit der LED steuert.
ja: パルス幅変調（PWM）は、デジタル手段でアナログ結果を取得するための技術である。デジタル制御は、オンとオフを切り替える信号である方形波を作成するために使用される。このオン/オフパターンは、信号がオンになる時間と信号がオフになる時間の部分を変更することにより、完全にオン（5ボルト）である時と完全にオフ（0ボルト）である時の間の電圧をシミュレートできる。「オンタイム」の期間はパルス幅と呼ばれる。さまざまなアナログ値を取得するには、その幅を変更または変調できる。このオン/オフパターンを何らかのデバイス、たとえばLEDで十分に速く繰り返すと、結果は次のようになる：信号はLEDの輝度を制御する0〜5vの安定した電圧である。

source: **Duty Cycle**
de: **Arbeitszyklus**
ja: **デューティサイクル**

source: A duty cycle is the percentage of one period in which a signal is active. A period is the time it takes for a signal to complete an on-and-off cycle. As a formula, a duty cycle may be expressed as:
de: Ein Arbeitszyklus ist der Prozentsatz einer Periode, in der ein Signal aktiv ist. Eine Periode ist die Zeit, die ein Signal benötigt, um einen Ein- und Ausschaltzyklus abzuschließen. Als Formel kann ein Arbeitszyklus ausgedrückt werden als:
ja: デューティサイクルは、信号が有効である1周期の割合である。期間とは、信号がオンとオフのサイクルを完了するのにかかる時間である。式として、デューティサイクルは次のように表示される：

source: Where **D** is the duty cycle, **T** is the time the signal is active, and **P** is the total period of the signal. Thus, a 60% duty cycle means the signal is on 60% of the time but off 40% of the time. The \"on time\" for a 60% duty cycle could be a fraction of a second, a day, or even a week, depending on the length of the period.
de: Wobei **D** das Tastverhältnis ist, **T** die Zeit ist, zu der das Signal aktiv ist, und **P** die Gesamtperiode des Signals ist. Ein Tastverhältnis von 60% bedeutet also, dass das Signal in 60% der Fälle eingeschaltet ist, in 40% der Fälle jedoch ausgeschaltet ist. Die "Pünktlichkeit" für einen Arbeitszyklus von 60% kann je nach Dauer des Zeitraums einen Bruchteil einer Sekunde, eines Tages oder sogar einer Woche betragen.
ja: ここで、**D** はデューティサイクル、**T** は信号がアクティブな時間、**P** は信号の合計周期です。 したがって、60％のデューティサイクルは、信号が60％の時間オンであるが、40％の時間オフであることを意味します。 60％のデューティサイクルの「定刻」は、期間の長さに応じて、数分の1秒、1日、または1週間になることもあります。

source: The three primary colors of the RGB LED can be mixed into various colors by brightness. The brightness of LED can be adjusted with PWM. Raspberry Pi has only one channel for hardware PWM output, but it needs three channels to control the RGB LED, which means it is difficult to control the RGB LED with the hardware PWM of Raspberry Pi. Fortunately, the softPwm library simulates PWM (softPwm) by programming. You only need to include the header file softPwm.h (for C language users), and then call the API it provides to easily control the RGB LED by multi-channel PWM output, so as to display all kinds of color.
de: Die drei Primärfarben der RGB-LED können durch Helligkeit in verschiedene Farben gemischt werden. Die Helligkeit der LED kann mit PWM eingestellt werden. Raspberry Pi hat nur einen Kanal für die Hardware-PWM-Ausgabe, benötigt jedoch drei Kanäle zur Steuerung der RGB-LED, was bedeutet, dass es schwierig ist, die RGB-LED mit der Hardware-PWM von Raspberry Pi zu steuern. Glücklicherweise simuliert die softPwm-Bibliothek PWM (softPwm) durch Programmierung. Alles, was Sie tun müssen, ist die Titeldatei SoftPwm.h (C-Sprachbenutzer) und rufen Sie die API, die es bietet für die einfache Steuerung der RGB-LED durch die Mehrkanal-PWM-Ausgabe, um eine Vielzahl von Farben anzuzeigen.
ja: RGB LEDの3つの原色は、輝度によってさまざまな色に混ぜることができる。LEDの輝度はPWMで調整可能である。Raspberry PiにはハードウェアPWM出力用のチャネルが1つしかないが、RGB LEDを制御するには3つのチャネルが必要である。つまり、Raspberry PiのハードウェアPWMでRGB LEDを制御することは困難である。幸いなことに、softPwmライブラリはプログラミングによってPWM（softPwm）をシミュレートする。ヘッダーファイルsoftPwm.h（ØC言語ユーザー向け）をインクルードし、提供されるAPIを呼び出して、マルチチャネルPWM出力によってRGB LEDを簡単に制御するだけで、あらゆる種類の色を表示できる。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: After connecting the pins of R, G, and B to a current limiting resistor, connect them to the GPIO17, GPIO18, and GPIO27 respectively. The longest pin (GND) of the LED connects to the GND of the Raspberry Pi. When the three pins are given different PWM values, the RGB LED will display different colors.
de: Nachdem Sie die Pins von R, G und B mit einem Strombegrenzungswiderstand verbunden haben, verbinden Sie sie mit dem GPIO17, GPIO18 bzw. GPIO27. Der längste Pin (GND) der LED ist mit dem GND des Raspberry Pi verbunden. Wenn die drei Pins unterschiedliche PWM-Werte erhalten, zeigt die RGB-LED unterschiedliche Farben an.
ja: R、G、およびBのピンを電流制限抵抗器に接続した後、それぞれGPIO17、GPIO18、およびGPIO27に接続してください。LEDの最も長いピン（GND）は、Raspberry Piの接地に接続する。3つのピンに異なるPWM値が与えられると、RGB LEDは異なる色を表示する。

source: T-Board Name
de: T-Karte Name
ja: Tボード名

source: physical
de: physisch

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1:** 回路を作る。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 2:** Go to the folder of the code.
de: **Schritt 2:** Gehen Sie zum Ordner der Kode.
ja: **ステップ2:** コードのフォルダーに入る。

source: **Step 3:** Compile the code.
de: **Schritt 3:** Kompilieren Sie die Kode.
ja: **ステップ3:** コードをコンパイルする。

source: When the instruction \"gcc\" is executed, if \"-o\" is not called, then the executable file is named \"a.out\".
de: Wenn die Anweisung "gcc" ausgeführt wird und "-o" nicht aufgerufen wird, wird ausführbare Datei "a.out" benannt.
ja: 命令「gcc」が実行されるときに「-o」が呼び出されない場合、EXEファイルは「a.out」と命名する。

source: **Step 4:** Run the executable file.
de: **Schritt 4:** Führen Sie die ausführbare Datei aus.
ja: **ステップ4:** EXEファイルを実行する。

source: After the code runs, you will see that RGB displays red, green, blue, yellow, pink, and cyan.
de: Nachdem die Kode ausgeführt wurde, sehen Sie, dass RGB Rot, Grün, Blau, Gelb, Pink und Cyan anzeigt.
ja: コードを実行すると、RGBが赤、緑、青、黄色、ピンク、およびシアンを表示する。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: Library used for realizing the pwm function of the software.
de: Bibliothek zur Realisierung der PWM-Funktion der Software.
ja: ソフトウェアのpwm機能を実現するために使用されるライブラリ。

source: The function is to use software to create a PWM pin, set its period between 0x100us-100x100us.
de: Die Funktion besteht darin, mit Software einen PWM-Pin zu erstellen und dessen Periode zwischen 0x100us und 100x100us einzustellen.
ja: この機能は、ソフトウェアを使用してPWMピンを作成し、その周期を0x100us〜100x100usに設定することである。

source: The prototype of the function softPwmCreate(LedPinRed, 0, 100) is as follows:
de: Der Prototyp der Funktion softPwmCreate (LedPinRed, 0, 100) lautet wie folgt:
ja: 関数softPwmCreate（LedPinRed、0、100）のプロトタイプは次のとおりである：

source: **Parameter pin:** Any GPIO pin of Raspberry Pi can be set as a PWM pin.
de: **Parameter-Pin:** Jeder GPIO-Pin von Raspberry Pi kann als PWM-Pin gesetzt werden.
ja: **パラメータピン:** ラズベリーパイの任意のGPIOピンは、PWMピンとして設定することができます。

source: **Parameter initialValue:** The initial pulse width is that initialValue times100us.
de: **Parameter initialValue:** Die anfängliche Impulsbreite ist der initialValue times100us.
ja: **Parameter initialValue:** 初期パルス幅はinitialValueに100usを掛けたものである。

source: **Parameter pwmRange:** the period of PWM is that pwmRange times100us.
de: **Parameter pwmRange:** Die Periode von PWM ist die pwmRange times100us.
ja: **Parameter pwmRange:** PWMの周期は、pwmRangeに100usを掛けたものである。

source: This function is to set the colors of the LED. Using RGB, the formal parameter **r_val** represents the luminance of the red one, **g_val** of the green one, **b_val** of the blue one.
de: Diese Funktion dient zum Einstellen der Farben der LED. Bei Verwendung von RGB repräsentiert der formale Parameter **r_val** die Luminanz des roten, **g_val** des grünen, **b_val** des blauen.
ja: この機能はLEDの色を設定する。RGBを使用すると、仮パラメータは赤の輝度の **r_val** 、緑の輝度の **g_val** 、青の輝度の **b_val** を表す。

source: The prototype of the function softPwmWrite(LedPinBlue, b_val) is as follows：
de: Der Prototyp der Funktion softPwmWrite (LedPinBlue, b_val) lautet wie folgt:
ja: 関数softPwmWrite(LedPinBlue, b_val)のプロトタイプは次のとおりである：

source: **Parameter Value:** The pulse width of PWM is value times 100us. Note that value can only be less than pwmRange defined previously, if it is larger than pwmRange, the value will be given a fixed value, pwmRange.
de: **Parameterwert:** Die Pulsbreite von PWM ist Wert mal 100us. Beachten Sie, dass der Wert nur kleiner als der zuvor definierte pwmRange sein kann. Wenn er größer als pwmRange ist, erhält der Wert einen festen Wert, pwmRange.
ja: **パラメータ値:** PWMのパルス幅は、値の100usの倍数です。値は、以前に定義された pwmRange より小さく、pwmRange より大きい場合、値には固定値 pwmRange が与えられることに注意してください。

source: Call the function defined before. Write 0xff into LedPinRed and 0x00 into LedPinGreen and LedPinBlue. Only the Red LED lights up after running this code. If you want to light up LEDs in other colors, just modify the parameters.
de: Rufen Sie die zuvor definierte Funktion auf. Schreiben Sie 0xff in LedPinRed und 0x00 in LedPinGreen und LedPinBlue. Nach dem Ausführen der Kode leuchtet nur die rote LED auf. Wenn Sie LEDs in anderen Farben aufleuchten möchten, ändern Sie einfach die Parameter.
ja: 前に定義した関数を呼び出す。LedPinRedに0xffを、LedPinGreenとLedPinBlueに0x00を書き込む。このコードを実行すると、赤色のLEDのみが点灯する。他の色のLEDを点灯させる場合は、パラメーターを変更するだけである。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 2:** Open the code file.
de: **Schritt 2:** Öffnen Sie die Kodedatei.
ja: **ステップ2:** コードファイルを開く。

source: **Step 3:** Run.
de: **Schritt 3:** Ausführen.
ja: **ステップ3:** 実行する。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: Call the GPIO.PWM( )function to define Red, Green and Blue as PWM pins and set the frequency of PWM pins to 2000Hz, then Use the Start() function to set the initial duty cycle to zero.
de: Rufen Sie die Funktion GPIO.PWM () auf, um Rot, Grün und Blau als PWM-Pins zu definieren und die Frequenz der PWM-Pins auf 2000 Hz einzustellen. Verwenden Sie dann die Funktion Start (), um den anfänglichen Arbeitszyklus auf Null zu setzen.
ja: GPIO.PWM() 関数を呼び出して、赤、緑、青をPWMピンとして定義し、PWMピンの周波数を2000Hzに設定してから、Start() 関数を使用して初期デューティサイクルをゼロに設定する。

source: Define a MAP function for mapping values. For instance, x=50, in_min=0, in_max=255, out_min=0, out_max=100. After the map function mapping, it returns (50-0) \* (100-0)/(255-0) +0=19.6, meaning that 50 in 0-255 equals 19.6 in 0-100.
de: Definieren Sie eine MAP-Funktion zum Zuordnen von Werten. Zum Beispiel ist x = 50, in_min = 0, in_max = 255, out_min = 0, out_max = 100. Nach der Zuordnung der Kartenfunktion wird (50-0) \* (100-0)/(255-0) +0=19.6, zurückgegeben, was bedeutet, dass 50 in 0-255 19,6 in 0-100 entspricht.
ja: 値をマッピングするためのMAP関数を定義する。たとえば、x = 50、in_min = 0、in_max = 255、out_min = 0、out_max = 100。マップ関数のマッピング後、（50-0）*（100-0）/（255-0）+ 0 = 19.6を戻す。つまり、0-255の50は0-100の19.6に相当する。

source: Configures the three LEDs’ luminance with the inputted color value, assign the first two values of the hexadecimal to R_val, the middle two assigned to G_val, the last two values to B_val. For instance, if color=0xFF00FF, R_val=（0xFF00FF & 0xFF0000）>> 16 = 0xFF, G_val = 0x00, B_val=0xFF.
de: Konfiguriert die Luminanz der drei LEDs mit dem eingegebenen Farbwert. Weisen Sie R_val die ersten beiden Hexadezimalwerte zu, G_val die beiden mittleren und B_val die letzten beiden Werte. Wenn beispielsweise color = 0xFF00FF ist, ist R_val = 0xFF00FF & 0xFF0000 >> 16 = 0xFF, G_val = 0x00, B_val = 0xFF.
ja: 入力されたカラー値で三つのLEDの輝度を構成し、16進数の最初の二つの値をR_valに割り当て、中央の二つをG_valに割り当て、最後の二つの値をB_valに割り当てる。たとえば、color = 0xFF00FF、R_val =（0xFF00FF＆0xFF0000）>> 16 = 0xFF、G_val = 0x00、B_val = 0xFFの場合。

source: Use map function to map the R,G,B value among 0~255 into PWM duty cycle range 0-100.
de: Verwenden Sie die Zuordnungsfunktion, um den R-, G-, B-Wert zwischen 0 und 255 in den PWM-Arbeitszyklusbereich von 0 bis 100 abzubilden.
ja: マップ機能を使用して、0〜255のR、G、B値をPWMデューティサイクル範囲0〜100にマップする。

source: Assign the mapped duty cycle value to the corresponding PWM channel to change the luminance.
de: Weisen Sie den zugeordneten Tastverhältniswert dem entsprechenden PWM-Kanal zu, um die Luminanz zu ändern.
ja: マッピングされたデューティサイクルを対応するPWMチャネルに割り当てて、輝度を変更する。

source: Assign every item in the COLOR list to the color respectively and change the color of the RGB LED via the setColor() function.
de: Ordnen Sie jedes Element in der COLOR-Liste der jeweiligen Farbe zu und ändern Sie die Farbe der RGB-LED über die Funktion setColor().
ja: COLORリストのすべてのアイテムをそれぞれ色に割り当て、setColor() 関数を介してRGB LEDの色を変更する。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像

source: **Code**
ja: **コード**
