Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/1.1.1_blinking_led.po
Languages: de, ja

source: 1.1.1 Blinking LED
de: 1.1.1 Blinkende LED
ja: 1.1.1 点滅LED

source: Introduction
de: Einführung
ja: 前書き

source: In this lesson, we will learn how to make a blinking LED by programming. Through your settings, your LED can produce a series of interesting phenomena. Now, go for it.
de: In dieser Lektion lernen wir, wie man durch Programmierung eine blinkende LED erzeugt. Durch Ihre Einstellungen kann Ihre LED eine Reihe interessanter Phänomene erzeugen. Jetzt mach es.
ja: このレッスンでは、プログラミングによってLEDを点滅させる方法を学習する。設定により、LEDは一連の興味深い現象を生成できる。今、行動しよう。

source: Components
de: Komponenten
ja: 部品

source: In order to proceed smoothly, you need to bring your own Raspberry Pi, TF card and Raspberry Pi power.
de: Um reibungslos fortzufahren, müssen Sie Ihren eigenen Raspberry Pi, TF-Karte und Raspberry Pi-Strom mitbringen.
ja: スムーズに進めるには、独自のRaspberry Pi、TFカード、およびRaspberry Piの電源を用意する必要がある。

source: Principle
de: Prinzip
ja: 原理

source: **Breadboard**
de: **Steckbrett**
ja: **ブレッドボード**

source: A breadboard is a construction base for prototyping of electronics. It is used to build and test circuits quickly before finishing any circuit design. And it has many holes into which components mentioned above can be inserted like ICs and resistors as well as jumper wires. The breadboard allows you to plug in and remove components easily.
de: Ein Steckbrett ist eine Konstruktionsbasis für das Prototyping von Elektronik. Es wird verwendet, um Schaltungen schnell aufzubauen und zu testen, bevor ein Schaltungsentwurf abgeschlossen wird. Und es hat viele Löcher, in die oben erwähnte Komponenten wie ICs und Widerstände sowie Jumperdrähte eingesetzt werden können. Mit dem Steckbrett können Sie Komponenten einfach anschließen und entfernen.
ja: ブレッドボードは、電子装置のプロトタイピングの構築基盤である。それは回路設計を完了する前に、回路を迅速に作って、テストするために使用される。また、上記の部品をICや抵抗器、ジャンパー線などのように挿入できる多くの穴が搭載されている。ブレッドボードを使用すると、部品を簡単に差し込んだり、取り外したりすることができる。

source: The picture shows the internal structure of a full+ breadboard. Although these holes on the breadboard appear to be independent of each other, they are actually connected to each other through metal strips internally.
de: Das Bild zeigt die interne Struktur eines Voll+ Steckbretts. Obwohl diese Löcher auf dem Steckbrett unabhängig voneinander zu sein scheinen, sind sie tatsächlich intern über Metallstreifen miteinander verbunden.
ja: この写真は、full +ブレッドボードの内部構造を示している。ブレッドボード上のこれらの穴は互いに独立しているように見えるが、実際には内部で金属ストリップを介して互いに接続されている。

source: LED is a kind of diode. LED will shine only if the long pin of LED is connected to the positive electrode and the short pin is connected to negative electrode.
de: LED ist eine Art Diode. Die LED leuchtet nur, wenn der lange Stift der LED mit der positiven Elektrode und der kurze Stift mit der negativen Elektrode verbunden ist.
ja: LEDは一種のダイオードである。LEDの長いピンが正極に接続され、短いピンが負極に接続されている場合にのみ、LEDが点灯する。

source: The LED can not be directly connected to power supply, which can damage component. A resistor with 160Ω or larger (work in 5V) must be connected in series in the circuit of LED.
de: Die LED kann nicht direkt an die Stromversorgung angeschlossen werden, die Komponente kann daruas beschädigt werden. Ein Widerstand mit 160 Ω oder mehr (Arbeit in 5V) muss in der LED-Schaltung in Reihe geschaltet werden.
ja: LEDを電源に直接接続することはできないため、部品に損傷を与える可能性がある。160Ω以上の抵抗（5V動作電圧）は、LEDの回路に直列に接続する必要がある。

source: **Resistor**
de: **Widerstand**
ja: **抵抗器**

source: Resistor is an electronic element that can limit the branch current. A fixed resistor is a kind of resistor whose resistance cannot be changed, while that of a potentiometer or a variable resistor can be adjusted.
de: Der Widerstand ist ein elektronisches Element, das den Zweigstrom begrenzen kann. Ein fester Widerstand ist ein Tpy von Widerstand, dessen Widerstand nicht geändert werden kann, während der eines Potentiometers oder eines variablen Widerstands eingestellt werden kann.
ja: 抵抗器は、分岐電流を制限できる電子素子である。固定抵抗器は抵抗値を変更できない抵抗器の一種であるが、ポテンショメータまたは可変抵抗器の抵抗値は調整できる。

source: Fixed resistor is applied in this kit. In the circuit, it is essential to protect the connected components. The following pictures show a real object, 220Ω resistor and two generally used circuit symbols of resistor. Ω is the unit of resistance and the larger units include KΩ, MΩ, etc. Their relationship can be shown as follows: 1 MΩ=1000 KΩ, 1 KΩ = 1000 Ω. Normally, the value of resistance is marked on it. So if you see these symbols in a circuit, it means that there is a resistor.
de: In diesem Kit wird ein fester Widerstand angewendet. In der Schaltung ist es wichtig, die angeschlossenen Komponenten zu schützen. Die folgenden Bilder zeigen ein reales Objekt, einen 220Ω-Widerstand und zwei allgemein verwendete Schaltungssymbole des Widerstands. Ω ist die Widerstandseinheit und die größeren Einheiten umfassen KΩ, MΩ usw. Ihre Beziehung kann wie folgt gezeigt werden: 1 MΩ = 1000 KΩ, 1 KΩ = 1000 Ω. Normalerweise ist der Widerstandswert darauf markiert. Wenn Sie diese Symbole in einer Schaltung sehen, bedeutet, es gibt ein Widerstand.
ja: このキットには固定抵抗器が適用される。回路では、接続された部品を保護することは重要である。次の図は、実際の物体、220Ω抵抗器、および抵抗器汎用の二つの回路記号を示している。Ωは抵抗値の単位で、より大きな単位はKΩ、MΩなどである。それらの関係は次のように示している：1M= 1000KΩ、1KΩ=1000Ω。通常、抵抗値はマークされている。したがって、回路にこれらの記号が表示される場合、抵抗があることを意味する。

source: When using a resistor, we need to know its resistance first. Here are two methods: you can observe the bands on the resistor, or use a multimeter to measure the resistance. You are recommended to use the first method as it is more convenient and faster. To measure the value, use multimeter.
de: Wenn wir einen Widerstand verwenden, müssen wir zuerst seinen Widerstand kennen. Hier sind zwei Methoden: Sie können die Bänder am Widerstand beobachten oder den Widerstand mit einem Multimeter messen. Es wird empfohlen, die erste Methode zu verwenden, da diese bequemer und schneller ist. Verwenden Sie ein Multimeter, um den Wert zu messen.
ja: 抵抗器を使用する場合、まず抵抗値を知る必要がある。以下の二つの方法がある：抵抗の帯域を観察すること、またはマルチメーターを使用して抵抗を測定すること。より便利で迅速なので、一番目の方法をお勧めする。値を測定するには、マルチメーターを使用してください。

source: As shown in the card, each color stands for a number.
de: Wie auf der Karte gezeigt, steht jede Farbe für eine Nummer.
ja: カードに示されているように、各色は数字を表している。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: In this experiment, connect a 220Ω resistor to the anode (the long pin of the LED), then the resistor to 3.3 V, and connect the cathode (the short pin) of the LED to GPIO17 of Raspberry Pi. Therefore, to turn on an LED, we need to make GPIO17 low (0V) level. We can get this phenomenon by programming.
de: In diesem Experiment schließen Sie einen 220 Ω-Widerstand an die Anode (den langen Pin der LED) und dann den Widerstand an 3,3 V an und verbinden Sie die Kathode (den kurzen Pin) der LED mit GPIO17 von Raspberry Pi. Da um eine LED einzuschalten, muss der GPIO17-Niveau niedrig (0V) sein. Wir können dieses Phänomen durch Programmierung erhalten.
ja: この実験では、まず220Ωの抵抗器を陽極（LEDの長いピン）に接続し、それから抵抗器を3.3 Vの電源に接続し、LEDの陰極（短いピン）をRaspberry PiのGPIO17に接続する。したがって、LEDをオンにするには、GPIO17を低（0V）レベルにする必要がある。プログラミングを通じてこの現象を取得できる。

source: **Pin11** refers to the 11th pin of the Raspberry Pi from left to right, and its corresponding **wiringPi** and **BCM** pin numbers are shown in the following table.
de: **Pin11** bezieht sich von links nach rechts auf den 11. Pin des Raspberry Pi. Die entsprechenden **wiringPi** und **BCM**-Pin-Nummern sind in der folgenden Tabelle aufgeführt.
ja: **Pin11** はRaspberry Piの左から11番目のピンを指し、それに対応する **wiringPi** と **BCM** のピン番号は以下の表の通りです。

source: In the C language related content, we make GPIO0 equivalent to 0 in the wiringPi. Among the Python language related content, BCM 17 is 17 in the BCM column of the following table. At the same time, they are the same as the 11th pin on the Raspberry Pi, Pin 11.
de: In den C-Sprachinhalten machen wir GPIO0 sz bis 0 in der wiringPi. U Unter den Python-Sprachinhalten, BCM 17 ist 17 in der BCM-Spalte der folgenden Tabelle. Gleichzeitig sind sie gleich mit dem 11. Pin des Raspberry Pi, Pin 11.
ja: C言語関連のコンテンツでは、wiringPiでGPIO0を0と同等にする。Python言語関連のコンテンツの中で、BCM 17は次の表のBCM列の17である。同時に、それらはRaspberry Piの11番目のピン-ピン11と同じである。

source: T-Board Name
de: T-Karte Name
ja: Tボード名

source: physical
de: physisch

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Step 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1:** 回路を作る。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 2:** Go to the folder of the code.
de: **Step 2:** Gehen Sie zum Ordner des Codes.
ja: **ステップ2:** コードのフォルダーに入る。

source: If you use a screen, you're recommended to take the following steps.
de: Wenn Sie einen Bildschirm verwenden, sind die folgenden Schritte empfohlen.
ja: モニターを使用する場合は、次の手順を実行することをお勧めする。

source: Go to **/home/pi/** and find the folder **davinci-kit-for-raspberry-pi**.
de: Gehen Sie zu **/home/pi/** und suchen Sie den Ordner **davinci-kit-for-raspberry-pi**.
ja: **/home/pi/** に入り、 **davinci-kit-for-raspberry-pi** フォルダーを見つけてください。

source: Find **C** in the folder, right-click on it and select **Open in Terminal**.
de: Suchen Sie **C** im Ordner, klicken Sie mit der rechten Maustaste darauf und wählen **Sie In Terminal öffnen**.
ja: フォルダー内で **C** を見つけて右クリックし、 **Open in Terminal** を選択する。

source: Then a window will pop up as shown below. So now you've entered the path of the code **1.1.1_BlinkingLed.c** .
de: Dann öffnet sich ein Fenster wie unten gezeigt. Nun haben Sie den Pfad des Codes **1.1.1_BlinkingLed.c** eingegeben.
ja: それから以下のようなウィンドウがポップアップされる。これで、コード **1.1.1_BlinkingLed.c** のパスに入っていた。

source: In the following lessons, we will use command to enter the code file instead of right-clicking. But you can choose the method you prefer.
de: In den folgenden Lektionen verwenden wir den Befehl, um die Codedatei einzugeben, anstatt mit der rechten Maustaste zu klicken. Aber Sie können die Methode wählen, die Sie bevorzugen.
ja: 次のレッスンでは、右クリックの代わりにコマンドを使用してコードファイルを入力する。ただし、お好みの方法を選択可能である。

source: If you log into the Raspberry Pi remotely, use ``cd`` to change directory:
de: Wenn Sie sich beim Raspberry Pi aus der Ferne anmelden, wechseln Sie mit ``cd`` das Verzeichnis:
ja: Raspberry Piにリモートでログインする場合、 ``cd`` を使用してディレクトリを変更する：

source: Change directory to the path of the code in this experiment via cd.
de: Ändern Sie das Verzeichnis in den Codepfad in diesem Experiment durch CD.
ja: この実験では、cdを使用してディレクトリをコードのパスに変更します。

source: In either way, now you are in the folder C. The subsequent procedures based on these two methods are the same. Let's move on.
de: In jedem Fall befinden Sie sich jetzt im Ordner C. Die weiteren Verfahren, die auf diesen beiden Methoden basieren, sind gleich. Lass uns weitermachen.
ja: どちらにしても、現在はCフォルダにいることになります。この2つの方法に基づくその後の手順は同じです。次に進みましょう。

source: **Step 3:** Compile the code
de: **Schritt 3:** Kompilieren Sie die Kode
ja: **ステップ3:** コードをコンパイルする

source: gcc is GNU Compiler Collection. Here, it functions like compiling the C language file *1_BlinkingLed.c* and outputting an executable file.
de: Hinweis: gcc ist die gcc ist die GNU Compilersammlung.. Hier funktioniert es wie das Kompilieren der C-Sprachdatei *1_BlinkingLed.c* und das Ausgeben einer ausführbaren Datei.
ja: gcc は GNU Compiler Collection です。ここでは、C言語ファイル*1_BlinkingLed.c*をコンパイルし、実行ファイルを出力するような機能を持っています。

source: In the command, ``-o`` means outputting (the character immediately following -o is the filename output after compilation, and an executable named ``BlinkingLed`` will generate here) and ``-lwiringPi`` is to load the library wiringPi (``l`` is the abbreviation of library).
de: Im Befehl bedeutet ``-o`` die Ausgabe (das Zeichen unmittelbar nach -o ist die Dateinamenausgabe nach der Kompilierung, und eine ausführbare Datei namens ``BlinkingLed`` wird hier generiert) , ``-lwiringPi`` ist das Laden der Bibliothek wiringPi (``l`` ist die Abkürzung der Bibliothek).
ja: コマンドでは、 ``-o`` は出力を意味し（-oの直後の文字はコンパイル後のファイル名出力であり、 ``BlinkingLed`` という名前のEXEファイルがここで生成される）、 ``-lwiringPi`` はライブラリーのwiringPiをロードする（ ``l`` はlibraryの省略形である）。

source: **Step 4:** Run the executable file output in the previous step.
de: **Schritt 4:** Führen Sie die Ausgabe der ausführbaren Datei im vorherigen Schritt aus.
ja: **ステップ4:** 前のステップで出力されたEXEファイルを実行する。

source: To control the GPIO, you need to run the program, by the command, sudo(superuser do). The command ``./`` indicates the current directory. The whole command is to run the ``BlinkingLed`` in the current directory.
de: Um das GPIO zu steuern, müssen Sie das Programm mit dem Befehl sudo (Superuser do) ausführen. Der Befehl ``./`` gibt das aktuelle Verzeichnis an. Der gesamte Befehl ist für die Ausführung der ``BlinkingLed`` im aktuellen Verzeichnis.
ja: GPIOを制御するには、コマンドsudo（superuser do）でプログラムを実行してください。コマンド ``./`` は現在のディレクトリを示している。コマンド全体は、現在のディレクトリで ``BlinkingLed`` を実行することである。

source: After the code runs, you will see the LED flashing.
de: Nachdem der Kode ausgeführt wurde, blinkt die LED.
ja: コードの実行後、LEDが点滅する。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: If you want to edit the code file ``1.1.1_BlinkingLed.c``, press ``Ctrl + C`` to stop running the code. Then type the following command to open it:
de: Wenn Sie die Kodedatei ``1.1.1_BlinkingLed.c`` bearbeiten möchten, drücken Sie ``Ctrl + C``, um die Ausführung des Kodes zu beenden. Geben Sie dann den folgenden Befehl ein und öffnen es:
ja: コードファイル ``1.1.1_BlinkingLed.c`` を編集する場合は、 ``Ctrl + C`` を押してコードの実行を停止する。次に、次のコマンドを入力してそれを開く：

source: nano is a text editor tool. The command is used to open the code file ``1.1.1_BlinkingLed.c`` by this tool.
de: nano ist ein Texteditor. Der Befehl wird verwendet, um die Kodedatei ``1.1.1_BlinkingLed.c`` mit diesem Tool zu öffnen.
ja: nanoはテキストエディターツールである。このコマンドは、このツールを通して、コードファイル ``1.1.1_BlinkingLed.c`` を開くために使用される。

source: Press ``Ctrl+X`` to exit. If you have modified the code, there will be a prompt asking whether to save the changes or not. Type in ``Y`` (save) or ``N`` (don’t save). Then press ``Enter`` to exit. Repeat ``Step 3`` and ``Step 4`` to see the effect after modifying.
de: Drücken Sie ``Ctrl+X`` für Ausfahrt Wenn Sie die Kode geändert haben, werden Sie gefragt, ob Sie die Änderungen speichern möchten oder nicht. Geben Sie ``Y`` (speichern) oder ``N`` (nicht speichern) ein. Drücken Sie dann die ``Enter`` , um den Vorgang zu beenden. Wiederholen Sie ``Schritt 3`` und ``Schritt 4``, um den Effekt nach dem Ändern zu sehen.
ja: ``Ctrl + X`` を押して終了する。コードを修正した場合、変更を保存するかどうかを尋ねるプロンプトが表示される。 ``Y`` （保存）または ``N`` （保存しない）を入力する。次に、 ``Enter`` キーを押して終了する。 ``ステップ3`` と ``ステップ4`` を繰り返して、修正後の効果を確認する。

source: The program code is shown as follows:
de: Der Programmkode wird wie folgt angezeigt:
ja: プログラムコードは次のように表示される：

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: The hardware drive library is designed for the C language of Raspberry Pi. Adding this library is conducive to the initialization of hardware, and the output of I/O ports, PWM, etc.
de: Die Hardware-Laufwerksbibliothek wurde für die C-Sprache von Raspberry Pi entwickelt. Das Hinzufügen dieser Bibliothek fördert die Initialisierung der Hardware und die Ausgabe von I/O ports, PWM usw.
ja: ハードウェアドライブライブラリは、Raspberry PiのC言語用に設計されている。このライブラリを追加すると、ハードウェアの初期化、およびI/Oポート、PWMなどの出力に役立つ。

source: Standard I/O library. The pintf function used for printing the data displayed on the screen is realized by this library. There are many other performance functions for you to explore.
de: Standard I/O Bibliothek. Die Pintf-Funktion zum Drucken der auf dem Bildschirm angezeigten Daten wird von dieser Bibliothek realisiert. Es gibt viele andere Leistungsfunktionen, die Sie erkunden können.
ja: 標準I/Oライブラリ。画面に表示されるデータの印刷に使用されるpintf機能は、このライブラリによって実現される。他にも多くのパフォーマンス機能がある。

source: Pin GPIO17 of the T_Extension Board is corresponding to the GPIO0 in wiringPi. Assign GPIO0 to LedPin, LedPin represents GPIO0 in the code later.
de: Pin GPIO17 der T_Erweiterungskarte entspricht dem GPIO0 in WiringPi. Weisen Sie Ledpin GPIO0 zu, was GPIO0 im zukünftigen Kode darstellt.
ja: T_Extension BoardのGPIO17ピンは、wiringPiのGPIO0に対応している。GPIO0をLedPinに割り当て、LedPinは後のコードでGPIO0を表す。

source: This initialises wiringPi and assumes that the calling program is going to be using the wiringPi pin numbering scheme.
de: Dadurch wird wiringPi initialisiert und geht davon aus, dass das aufrufende Programm das wiringPi Nummerierungsschema verwendet.
ja: これにより、wiringPiが初期化され、呼び出しのプログラムがwiringPiピン番号スキームを使用することになると想定される。

source: This function needs to be called with root privileges. When initialize wiring failed, print message to screen. The function “return” is used to jump out of the current function. Using return in main() function will end the program.
de: Diese Funktion muss mit Root-Rechten aufgerufen werden. Wenn die Initialisierung der Verkabelung fehlgeschlagen ist, drucken Sie die Nachricht auf dem Bildschirm. Die Funktion “Rückgabe” wird verwendet, um aus der aktuellen Funktion herauszuspringen. Wenn Sie die Funktion Rückgabe in main () verwenden, wird das Programm beendet.
ja: この関数を呼び出すには、ルート権限が必要である。配線の初期化に失敗すると、画面にメッセージが表示される。関数「return」は現在の関数から飛び出すために使用される。main()関数で関数「return」を使用すると、プログラムが終了する。

source: Set LedPin as output to write value to it.
de: Stellen Sie LedPin als Ausgabe ein, um einen Wert darauf zu schreiben.
ja: LedPinを出力として設定し、値を書き込む。

source: Set GPIO0 as 0V (low level). Since the cathode of LED is connected to GPIO0, thus the LED will light up if GPIO0 is set low. On the contrary, set GPIO0 as high level, digitalWrite (LedPin, HIGH): LED will go out.
de: Stellen Sie GPIO0 auf 0V (niedriger Niveau) ein. Da die Kathode der LED mit GPIO0 verbunden ist, leuchtet die LED auf, wenn GPIO0 niedrig eingestellt ist. Im Gegenteil, stellen Sie GPIO0 als High-Level ein. DigitalWrite (LedPin, HIGH): Die LED erlischt.
ja: GPIO0を0V（低レベル）に設定SURU。LEDの陰極はGPIO0に接続されているため、GPIO0が低レベルに設定されるとLEDが点灯する。それに反して、GPIO0を高レベルに設定すると（digitalWrite（LedPin、HIGH）)：LEDが消灯する。

source: The printf function is a standard library function and its function prototype is in the header file "stdio.h". The general form of the call is: printf(" format control string ", output table columns). The format control string is used to specify the output format, which is divided into format string and non-format string. The format string starts with '%' followed by format characters, such as' %d 'for decimal integer output. Unformatted strings are printed as prototypes. What is used here is a non-format string, followed by "\n" that is a newline character, representing automatic line wrapping after printing a string.
de: Die printf-Funktion ist eine Standardbibliotheksfunktion und ihr Funktionsprototyp befindet sich in der Header-Datei "stdio.h". Die allgemeine Form des Aufrufs lautet: printf ("Format Control String", Spalten der Ausgabetabelle). Die Formatsteuerzeichenfolge wird verwendet, um das Ausgabeformat anzugeben, das in Formatzeichenfolge und Nichtformatzeichenfolge unterteilt ist. Die Formatzeichenfolge beginnt mit '%', gefolgt von Formatzeichen, z. B. '% d' für die Ausgabe von Dezimalzahlen. Unformatierte Zeichenfolgen werden als Prototypen gedruckt. Hier wird eine nicht formatierte Zeichenfolge verwendet, gefolgt von "\n", einem Zeilenumbruchzeichen, das den automatischen Zeilenumbruch nach dem Drucken einer Zeichenfolge darstellt.
ja: printf関数は標準ライブラリ関数であり、その関数プロトタイプはヘッダーファイル「stdio.h」にあります。呼び出しの一般的な形式は次のとおりです。printf（"フォーマット制御文字列"、出力テーブルの列）。フォーマット制御文字列は、フォーマット文字列と非フォーマット文字列に分けられる出力フォーマットを指定するために使用されます。フォーマット文字列は「％」で始まり、10進整数出力の場合は「％d」などのフォーマット文字が続きます。 フォーマットされていない文字列はプロトタイプとして印刷されます。 ここで使用されているのは、フォーマットされていない文字列であり、その後に改行文字である"\ n "が続きます。これは、文字列を印刷した後の自動行折り返しを表します。

source: Delay (500) keeps the current HIGH or LOW state for 500ms.
de: Die Verzögerung (500) hält den aktuellen HIGH- oder LOW-Status für 500 ms.
ja: Delay (500) は、現在のHIGHまたはLOW状態を500ms維持する。

source: This is a function that suspends the program for a period of time. And the speed of the program is determined by our hardware. Here we turn on or off the LED. If there is no delay function, the program will run the whole program very fast and continuously loop. So we need the delay function to help us write and debug the program.
de: Dies ist eine Funktion, die das Programm für einen bestimmten Zeitraum anhält. Und die Geschwindigkeit des Programms wird von unserer Hardware bestimmt. Hier schalten wir die LED ein oder aus. Wenn es keine Verzögerungsfunktion gibt, führt das Programm das gesamte Programm sehr schnell und kontinuierlich aus. Wir brauchen also die Verzögerungsfunktion, um das Programm schreiben und debuggen zu können.
ja: これは、プログラムを一定期間中断する機能である。また、プログラムの速度はハードウェアによって決まる。ここで、LEDをオンまたはオフにする。遅延機能がない場合、プログラムはプログラム全体を非常に高速で実行し、継続的にループする。そのため、プログラムの作成とデバッグに役立つ遅延機能が必要である。

source: Usually, it is placed behind the main function, indicating that the function returns 0 on successful execution.
de: Normalerweise wird es hinter der Hauptfunktion platziert, was anzeigt, dass die Funktion bei erfolgreicher Ausführung 0 zurückgibt.
ja: 通常、メイン関数の後ろに配置され、関数が正常に実行されると0を返すことを示す。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 2:** Go to the folder of the code and run it.
de: **Schritt 2:** Gehen Sie zum Ordner des Codes und führen Sie ihn aus.
ja: **ステップ2:** コードのフォルダーに入り、それを実行する。

source: Find 1.1.1_BlinkingLed.py and double click it to open. Now you're in the file.
de: Suchen Sie 1.1.1_BlinkingLed.py und doppelklicken Sie darauf, um es zu öffnen. Jetzt bist du in der Datei.
ja: 1.1.1_BlinkingLed.pyを見つけて、ダブルクリックして開く。今、ファイルに入った。

source: Click **Run** ->\ **Run Module** in the window and the following contents will appear.
de: Klicken Sie im Fenster auf **Run** ->\ **Run Module**. Der folgende Inhalt wird angezeigt.
ja: ウィンドウで **Run** ->\ **Run Module** をクリックすると、次の内容が表示される。

source: To stop it from running, just click the X button on the top right to close it and then you'll back to the code. If you modify the code, before clicking **Run Module (F5)** you need to save it first. Then you can see the results.
de: Um die Ausführung zu stoppen, klicken Sie einfach auf die X-Schaltfläche oben rechts, um sie zu schließen, und kehren Sie dann zum Code zurück. Wenn Sie die Kode ändern, müssen Sie ihn zuerst speichern, bevor Sie auf **Run Module (F5)** klicken. Dann können Sie die Ergebnisse sehen.
ja: 実行を停止するには、右上の「X」ボタンをクリックして閉じるだけで、コードに戻る。コードを変更する場合は、**Run Module (F5)** をクリックする前に、まず保存しなければならない。その後、結果を確認できる。

source: If you log into the Raspberry Pi remotely, type in the command:
de: Wenn Sie sich beim Raspberry Pi aus der Ferne anmelden, geben Sie den folgenden Befehl ein:
ja: Raspberry Piにリモートでログインする場合、次のコマンドを入力する：

source: Change directory to the path of the code in this experiment via ``cd``.
de: Wechseln Sie in diesem Experiment per ``cd`` in den Pfad der Kode.
ja: ``cd`` を使用して、この実験のコードのパスにディレクトリを変更できる。

source: **Step 3:** Run the code
de: **Schritt 3:** Führen Sie die Kode aus
ja: **ステップ3:** コードを実行する

source: Here sudo - superuser do, and python means to run the file by Python.
de: Hier tun sudo - superuser do und python bedeutet, die Datei von Python auszuführen.
ja: ここではsudo-superuser doとpythonは、Pythonでファイルを実行することを意味する。
