Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/1.1.1_blinking_led.po
Languages: de, ja

source: **Step 4:** If you want to edit the code file 1.1.1_BlinkingLed.py, press ``Ctrl + C`` to stop running the code. Then type the following command to open 1.1.1_BlinkingLed.py:
de: **Schritt 4:** Wenn Sie die Dodedatei 1.1.1_BlinkingLed.py, bearbeiten möchten, drücken Sie ``Ctrl + C``, um die Ausführung der Kode zu beenden. Geben Sie dann den folgenden Befehl ein, um 1.1.1_BlinkingLed.py: zu öffnen:
ja: **ステップ4:** コードファイル1.1.1_BlinkingLed.pyを編集する場合は、 ``Ctrl + C`` を押してコードの実行を停止してください。それから次のコマンドを入力して1.1.1_BlinkingLed.pyを開く：

source: nano is a text editor tool. The command is used to open the code file 1.1.1_BlinkingLed.py by this tool.
de: nano ist ein Texteditor. Mit dem Befehl wird die Dodedatei 1.1.1_BlinkingLed.py by this tool.von diesem Tool geöffnet.
ja: nanoはテキストエディターツールである。このツールは、コマンドを使用してコードファイル1.1.1_BlinkingLed.pyを開く。

source: Press ``Ctrl+X`` to exit. If you have modified the code, there will be a prompt asking whether to save the changes or not. Type in ``Y`` (save) or ``N`` (don’t save).
de: Drücken Sie ``Ctrl+X`` für Ausfahrt Wenn Sie die Kode geändert haben, werden Sie gefragt, ob Sie die Änderungen speichern möchten oder nicht. Geben Sie ``Y`` (speichern) oder ``N`` (nicht speichern) ein.
ja: ``Ctrl + X`` を押して終了する。コードを修正した場合、変更を保存するかどうかを尋ねるプロンプトが表示される。 ``Y`` （保存）または ``N`` （保存しない）を入力する。

source: Then press ``Enter`` to exit. Type in nano 1.1.1_BlinkingLed.py again to see the effect after the change.
de: Drücken Sie dann ``Enter``, um den Vorgang zu beenden. Geben Sie nano 1.1.1_BlinkingLed.py erneut ein, um den Effekt nach der Änderung zu sehen.
ja: 次に、 ``Enter`` を押して終了する。変更後の効果を確認するには、nano 1.1.1_BlinkingLed.pyをもう一度入力してください。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.

source: When the system detects this, it will search the installation path of python in the env setting, then call the corresponding interpreter to complete the operation. It’s to prevent the user not installing the python onto the /usr/bin default path.
de: Wenn das System dies erkennt, durchsucht es den Installationspfad von Python in der Umgebung env und ruft dann den entsprechenden Interpreter auf, um den Vorgang abzuschließen. Dies soll verhindern, dass der Benutzer die Python nicht auf dem Defaultpfad /usr/bin installiert.
ja: システムがこれを検出すると、env設定でpythonの実装パスを検索し、対応するインタープリターを呼び出して操作を完了させる。その目的は、ユーザーがPythonを/usr/binのデフォルトパスに実装することを防止することである。

source: In this way, import the RPi.GPIO library, then define a variable, GPIO to replace RPI.GPIO in the following code.
de: Importieren Sie auf diese Weise die RPi.GPIO-Bibliothek und definieren Sie dann eine Variable, GPIO, um RPI.GPIO in der folgenden Kode zu ersetzen.
ja: この方法で、RPi.GPIOライブラリをインポートし、変数GPIOを定義して、次のコードでRPI.GPIOを置き換える。

source: Import time package, for time delay function in the following program.
de: Zeitpaket importieren, für Zeitverzögerungsfunktion im folgenden Programm.
ja: 次のプログラムの時間遅延機能を行うために、時間パッケージをインポートしなければならない。

source: LED connects to the GPIO17 of the T-shape extension board, namely, BCM 17.
de: Die LED wird mit dem GPIO17 der T-förmigen Erweiterungskarte, nämlich BCM 17, verbunden.
ja: LEDはT字型拡張ボードのGPIO17、つまりBCM 17に接続している。

source: Set LedPin's mode to output, and initial level to High (3.3v).
de: Stellen Sie den LedPin-Modus auf Ausgabe und den AnfangsNiveau auf Hoch (3.3v).
ja: LedPinのモードを出力に設定し、初期レベルを高（3.3v）に設定する。

source: There are two ways of numbering the IO pins on a Raspberry Pi within RPi.GPIO: BOARD numbers and BCM numbers. In our lessons, what we use is BCM numbers. You need to set up every channel you are using as an input or an output.
de: Es gibt zwei Wisen, die IO -Pins eines Raspberry Pi in RPi.GPIO zu nummerieren: BOARD-Nummern und BCM-Nummern. In unseren Lektionen verwenden wir BCM-Nummern. Sie müssen jeden Kanal einrichten, den Sie als Eingang oder Ausgang verwenden.
ja: RPi.GPIO内のRaspberry PiのIOピンに番号を付けるには、BOARDとBCM二つの番号付与方法がある。レッスンでは、使用しているのはBCM番号である。入力または出力として使用しているチャンネルをすべて設定する必要がある。

source: Set GPIO17(BCM17) as 0V (low level). Since the cathode of LED is connected to GPIO17, thus the LED will light up.
de: Stellen Sie GPIO17 (BCM17) auf 0V (niedriger Niveau) ein. Da die Kathode der LED mit GPIO17 verbunden ist, leuchtet die LED auf.
ja: GPIO17（BCM17）を0V（低レベル）に設定する。LEDのカソードはGPIO17に接続されているため、LEDが点灯する。

source: Delay for 0.5 second. Here, the statement is delay function in C language, the unit is second.
de: Verzögerung um 0,5 Sekunden. Hier ähnelt die Anweisung der Verzögerungsfunktion in der Sprache C, die Einheit ist die zweite.
ja: 0.5秒の遅延。ここで、ステートメントはC言語の遅延機能に似ており、単位は秒である。

source: Define a destroy function for clean up everything after the script finished.
de: Definieren Sie eine Zerstörungsfunktion, um alles nach Abschluss des Skripts zu bereinigen.
ja: スクリプトの終了後にすべてを消去する破棄関数を定義する。

source: This is the general running structure of the code. When the program starts to run, it initializes the pin by running the setup(), and then runs the code in the main() function to set the pin to high and low levels. When 'Ctrl+C' is pressed, the program, destroy() will be executed.
de: Dies ist die allgemeine Ausführungsstruktur der Kode Wenn das Programm gestartet wird, wird der Pin durch Ausführen von setup () initialisiert und anschließend der Kode in der Funktion main () ausgeführt, um den Pin auf hohe und niedrige Niveau zu setzen. Wenn 'Ctrl+C' gedrückt wird, wird das Programm destroy () ausgeführt.
ja: これは、コードの一般的な実行構造である。プログラムの実行が開始されると、setup()を実行してピンを初期化し、main()関数でコードを実行してピンを高レベルと低レベルに設定する。「Ctrl + C」を押すと、プログラムdestroy()が実行される。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像

source: **Code**
ja: **コード**

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi\\python``.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、「davinci-kit-for-raspberry-pi\\python」のようなソースコードパスに移動する必要があります。
