Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/1.1.5_4-Digit_7-segment_display.po
Languages: de, ja

source: 1.1.5 4-Digit 7-Segment Display
de: 1.1.5 4-stellige 7-Segment-Anzeige
ja: 1.1.5 4桁7セグメントディスプレイ

source: Introduction
de: Einführung
ja: 前書き

source: Next, follow me to try to control the 4-digit 7-segment display.
de: Folgen Sie mir als Nächstes, um zu versuchen, die 4-stellige 7-Segment-Anzeige zu steuern.
ja: 次に、4桁7セグメントディスプレイを制御してみてください。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: **4-Digit 7-Segment Display**
de: **4-stellige 7-Segment-Anzeige**
ja: **4桁7セグメントディスプレイ**

source: 4-Digit 7-segment display consists of four 7- segment displays working together.
de: Die 4-stellige 7-Segment-Anzeige besteht aus vier 7-Segment-Anzeigen, die zusammenarbeiten.
ja: 4桁の7セグメントディスプレイは、連携して動作する4つの7セグメントディスプレイで構成されている。

source: The 4-digtal 7-segment display works independently. It uses the principle of human visual persistence to quickly display the characters of each 7-segment in a loop to form continuous strings.
de: Das 4-Digtal-7-Segment-Display arbeitet unabhängig. Es verwendet das Prinzip der menschlichen visuellen Persistenz, um die Zeichen jedes 7-Segments schnell in einer Schleife anzuzeigen und fortlaufende Zeichenfolgen zu bilden.
ja: 4デジタル7セグメントディスプレイは独立して動作する。人間の視覚的持続性の原理を使用して、ループ内の各7セグメントの文字をすばやく表示し、連続した文字列を形成する。

source: For example, when "1234" is displayed on the display, "1" is displayed on the first 7-segment, and "234" is not displayed. After a period of time, the second 7-segment shows "2", the 1st 3th 4th of 7-segment does not show, and so on, the four digital display show in turn. This process is very short (typically 5ms), and because of the optical afterglow effect and the principle of visual residue, we can see four characters at the same time.
de: Wenn beispielsweise "1234" auf dem Display angezeigt wird, wird "1" auf dem ersten 7-Segment angezeigt und "234" wird nicht angezeigt. Nach einer gewissen Zeit zeigt das zweite 7-Segment "2", das 1. 3. 4. des 7-Segments zeigt nicht usw. Die vier Digitalanzeigen werden nacheinander angezeigt. Dieser Vorgang ist sehr kurz (normalerweise 5 ms), und aufgrund des optischen Nachleuchteffekts und des Prinzips der visuellen Rückstände können wir vier Zeichen gleichzeitig sehen.
ja: つまり、ディスプレイに「1234」が表示されている場合、最初の7セグメントに「1」が表示され、「234」は表示されないということである。しばらくすると、2番目の7セグメントに「2」が表示され、7セグメントの1番目、3番目、4番目に表示されなくなり、4つのデジタルディスプレイショーが順番に表示される。このプロセスは非常に短く（通常5ms）、光学的残光効果と視覚的残留の原理により、同時に4つの文字を見ることができる。

source: **Display Codes**
de: **Koden anzeigen**
ja: **表示コード**

source: To help you get to know how 7-segment displays(Common Anode) display Numbers, we have drawn the following table. Numbers are the number 0-F displayed on the 7-segment display; (DP) GFEDCBA refers to the corresponding LED set to 0 or 1, For example, 11000000 means that DP and G are set to 1, while others are set to 0. Therefore, the number 0 is displayed on the 7-segment display, while HEX Code corresponds to hexadecimal number.
de: Um Ihnen zu zeigen, wie 7-Segment-Anzeigen (Gemeisame Anode) Nummer anzeigen, haben wir die folgende Tabelle gezeichnet. Nummer sind die Nummer 0-F, die auf der 7-Segment-Anzeige angezeigt werden. (DP) GFEDCBA bezieht sich auf die entsprechende LED, die auf 0 oder 1 gesetzt ist. Beispielsweise bedeutet 11000000, dass DP und G auf 1 gesetzt sind, während andere auf 0 gesetzt sind. Daher wird die Nummer 0 auf dem 7-Segment-Display angezeigt, während der HEX-Kode der Hexadezimalzahl entspricht.
ja: 7セグメントディスプレイ（アノードコモン）がどのように番号を表示するかを知るために、次の表をご参照ください。数字は7セグメントディスプレイに表示される0〜Fの数字である。（DP）GFEDCBAは、0または1に設定された対応のLEDを指す。たとえば、11000000はDPおよびGが1に設定され、他のLEDが0に設定されることを意味する。したがって、7セグメントディスプレイには0が表示され、HEXコードは16進数に対応する。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: T-Board Name
de: T-Karte Name
ja: Tボード名

source: physical
de: physisch

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1**: Build the circuit.
de: **Schritt 1**: Bauen Sie die Schaltung auf.
ja: **ステップ1**: 回路を作る。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: Step 2: Go to the folder of the code.
de: **Schritt 2:** Gehen Sie zum Ordner des Codes.
ja: ステップ2：コードのフォルダーに入る。

source: Step 3: Compile the code.
de: **Schritt 3:** Kompilieren Sie den Code.
ja: ステップ3：コードをコンパイルする。

source: Step 4: Run the executable file.
de: **Schritt 4:** Führen Sie die ausführbare Datei aus.
ja: ステップ4：EXEファイルを実行する。

source: After the code runs, the program takes a count, increasing by 1 per second, and the 4-digit 7-segment display displays the count.
de: Nachdem der Code ausgeführt wurde, nimmt das Programm eine Zählung vor, die um 1 pro Sekunde erhöht wird, und die 4-stellige 7-Segment-Anzeige zeigt die Zählung an.
ja: コードの実行後、プログラムは1秒間に1つずつ増やすカウントを行い、4桁の7セグメントディスプレイにそのカウントが表示される。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: These four pins control the common anode pins of the four-digit 7-segment displays.
de: Diese vier Pins steuern die gemeinsamen Anodenpins der vierstelligen 7-Segment-Anzeigen.
ja: これらの4つのピンは、4桁の7セグメントディスプレイのアノードコモンピンを制御する。

source: A segment code array from 0 to 9 in Hexadecimal (Common anode).
de: Ein Segmentkode-Array von 0 bis 9 in hexadezimaler Darstellung (gemeinsame Anode).
ja: 16進数（アノードコモン）の0〜9のセグメントコード配列。

source: Select the place of the value. there is only one place that should be enable each time. The enabled place will be written high.
de: Wählen Sie den Ort des Wertes. Es gibt nur einen Ort, der jedes Mal aktiviert werden sollte. Der aktivierte Ort wird hoch geschrieben.
ja: 値の場所を選択する。毎回有効な場所は1つだけである。有効な場所はhighに書き込まれる。

source: The functionis used to set the number displayed on the 4-digit 7-segment display.
de: Mit dieser Funktion wird die auf der 4-stelligen 7-Segment-Anzeige angezeigte Nummer eingestellt.
ja: この機能を使用して、4桁の7セグメントディスプレイに表示される番号を設定する。

source: ``clearDisplay()``：write in 11111111 to turn off these eight LEDs on 7-segment display so as to clear the displayed content.
de: ``Klare Anzeige ()``: Schreiben Sie in 11111111, um diese acht LEDs auf der 7-Segment-Anzeige auszuschalten und den angezeigten Inhalt zu löschen.
ja: ``clearDisplay()``：11111111に書き込み、7セグメントディスプレイ上のこれら8つのLEDをオフにして、表示されたコンテンツを消去する。

source: ``pickDigit(0)``：pick the fourth 7-segment display.
de: ``pickDigit (0)``: Wählen Sie die vierte 7-Segment-Anzeige.
ja: ``pickDigit（0）``：4番目の7セグメントディスプレイを選択する。

source: ``hc595_shift(number[counter%10])``：the number in the single digit of counter will display on the forth segment.
de: ``hc595_shift (Nummer [Zähler% 10])``: Die Nummer in der einzelnen Ziffer des Zählers wird im vierten Segment angezeigt.
ja: ``hc595_shift（number [counter％10]）``：カウンターの1桁の数字が4番目のセグメントに表示される。

source: This is a system-provided function, the prototype of code is:
de: Dies ist eine vom System bereitgestellte Funktion. Der Prototyp der Kode lautet:
ja: これはシステム組み込みの関数であり、コードのプロトタイプは次のとおりである：

source: After executing the signal(), once the process receives the corresponding signum (in this case SIGALRM), it immediately pauses the existing task and processes the set function (in this case timer(sig)).
de: Nach dem Ausführen des Signals () hält der Prozess, sobald er das entsprechende Signal (in diesem Fall SIGALRM) erhalten hat, die vorhandene Aufgabe sofort an und verarbeitet die eingestellte Funktion (in diesem Fall Timer (sig)).
ja: signal()を実行した後、プロセスは対応する signum（ここでSIGALRM）を受信すると、すぐに既存のタスクを一時停止し、設定関数（ここでtimer（sig))を処理する。

source: This is also a system-provided function. The code prototype is:
de: Dies ist auch eine vom System bereitgestellte Funktion. Der Kode-Prototyp ist:
ja: これもシステム組み込み関数である。コードのプロトタイプは：

source: It generates a SIGALRM signal after a certain number of seconds.
de: Es erzeugt nach einer bestimmten Anzahl von Sekunden ein SIGALRM-Signal.
ja: 指定した秒数後にSIGALRMシグナルを生成する。

source: We use the functions above to implement the timer function. After the ``alarm()`` generates the SIGALRM signal, the timer function is called. Add 1 to counter, and the function, ``alarm(1)`` will be repeatedly called after 1 second.
de: Wir verwenden die obigen Funktionen, um die Timer-Funktion zu implementieren. Nachdem der ``Alarm ()`` das SIGALRM-Signal erzeugt hat, wird die Timer-Funktion aufgerufen. Addiere 1 zum Zähler und die Funktion ``Warnung (1)`` wird nach 1 Sekunde wiederholt aufgerufen.
ja: 上記の関数を使用して、タイマー関数を実装する。 ``alarm()`` がSIGALRMシグナルを生成した後、タイマー関数が呼び出される。カウンターに1を追加すると、1秒後に関数 ``alarm（1）`` が繰り返し呼び出される。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: Step 3: Run the executable file.
de: Schritt 3: Führen Sie die ausführbare Datei aus.
ja: ステップ3：EXEファイルを実行する。

source: After the code runs, the program takes a count, increasing by 1 per second, and the 4 digit display displays the count.
de: Nachdem die Kode ausgeführt wurde, nimmt das Programm eine Zählung vor, die um 1 pro Sekunde erhöht wird, und die 4-stellige Anzeige zeigt die Zählung an.
ja: コードの実行後、プログラムは1秒ずつ増加するカウントをして、4桁のディスプレイにカウントが表示される。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: A segment code array from 0 to 9 in hexadecimal (common anode).
de: Ein Segmentkode-Array von 0 bis 9 in hexadezimaler Darstellung (gemeinsame Anode).
ja: 16進数の0〜9のセグメントコード配列（アノードコモン）。

source: Write "1" for eight times in SDI., so that the eight LEDs on the 7-segment Dispaly will turn off so as to clear the displayed content.
de: Schreiben Sie achtmal "1" in SDI., Damit die acht LEDs auf dem 7-Segment-Anzeige erlöschen, um den angezeigten Inhalt zu löschen.
ja: SDIに「1」を8回書き込むと、7セグメントディスプレイの8つのLEDが消灯し、表示されたコンテンツが消去される。

source: The function is used to set the number displayed on the 4-digit 7-segment Dispaly.
de: Mit dieser Funktion wird die auf der 4-stelligen 7-Segment-Anzeige angezeigte Nummer eingestellt.
ja: この機能は、4桁の7セグメントディスプレイに表示される番号を設定するために使用される。

source: First, start the fourth segment display, write the single-digit number. Then start the third segment display, and type in the tens digit; after that, start the second and the first segment display respectively, and write the hundreds and thousands digits respectively. Because the refreshing speed is very fast, we see a complete four-digit display.
de: Starten Sie zuerst die vierte Segmentanzeige und schreiben Sie die einstellige Nummer. Dann starten Sie die Anzeige des dritten Segments und geben Sie die Zehnerstelle ein. Starten Sie danach die zweite bzw. die erste Segmentanzeige und schreiben Sie die Hunderter- bzw. Tausenderstellen. Da die Aktualisierungsgeschwindigkeit sehr hoch ist, sehen wir eine vollständige vierstellige Anzeige.
ja: まず、4番目のセグメントディスプレイを開始し、1桁の数字を書き込む。次に、3番目のセグメントディスプレイを開始し、10桁の数字を入力する。その後、2番目と1番目のセグメントディスプレイをそれぞれ開始し、それぞれ数百桁と数千桁を書き込む。リフレッシュ速度が非常に速いため、完全な4桁のディスプレイが表示される。

source: The module, threading is the common threading module in Python，and Timer is the subclass of it. The prototype of code is:
de: Das Modul Threading ist das übliche Threading-Modul in Python Tim und Timer ist die Unterklasse davon. Der Prototyp der Kode ist:
ja: モジュール、スレッドはPythonの一般的なスレッドモジュールであり、タイマーはそのサブクラスである。コードのプロトタイプは次のとおりです：

source: After the interval, the function will be run. Here, the interval is 1.0，and the function is timer(). start () means the Timer will start at this point.
de: Nach dem Intervall wird die Funktion ausgeführt. Hier beträgt das Intervall 1.0， und die Funktion ist timer (). start () bedeutet, dass der Timer an diesem Punkt startet.
ja: 間隔の後、関数が実行される。ここでは、間隔は1.0、関数はtimer()である。start()は、タイマーがこの時点で開始することを意味する。

source: After Timer reaches 1.0s, the Timer function is called; add 1 to counter, and the Timer is used again to execute itself repeatedly every second.
de: Nachdem der Timer 1,0 Sekunden erreicht hat, wird die Timer-Funktion aufgerufen. Addiere 1 zum Zähler und der Timer wird erneut verwendet, um sich jede Sekunde wiederholt auszuführen.
ja: Timerが1.0秒に達すると、Timer関数が呼び出される。カウンターに1を追加すると、タイマーが再び使用されて、1秒ごとに繰り返し実行される。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像

source: **Code**
ja: **コード**
