Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/1.2.2_passive_buzzer.po
Languages: de, ja

source: 1.2.2 Passive Buzzer
de: 1.2.2 Passiver Summer
ja: 1.2.2 パッシブブザー

source: Introduction
de: Einführung
ja: 前書き

source: In this lesson, we will learn how to make a passive buzzer play music.
de: In dieser Lektion lernen wir, wie man einen passiven Summer dazu bringt, Musik zu spielen.
ja: このレッスンでは、パッシブブザーで音楽を再生する方法を学習する。

source: Components
de: Komponenten
ja: 部品

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: In this experiment, a passive buzzer, a PNP transistor and a 1k resistor are used between the base of the transistor and GPIO to protect the transistor.
de: In diesem Experiment werden ein passiver Summer, ein PNP-Transistor und ein 1k-Widerstand zwischen der Basis des Transistors und GPIO verwendet, um den Transistor zu schützen.
ja: この実験では、トランジスタを保護するために、トランジスタのベースとGPIOの間にパッシブブザー、PNPトランジスタ、および1k抵抗器を使用する。

source: When GPIO17 is given different frequencies, the passive buzzer will emit different sounds; in this way, the buzzer plays music.
de: Wenn GPIO17 unterschiedliche Frequenzen erhält, gibt der passive Summer unterschiedliche Töne aus. Auf diese Weise spielt der Summer Musik.
ja: GPIO17に異なる周波数が与えられると、パッシブブザーは異なる音を出す。このようにして、ブザーは音楽を再生する。

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1**: Build the circuit.
de: **Schritt 1**: Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 2**: Change directory.
de: **Schritt 2**: Verzeichnis wechseln.
ja: **ステップ2：** ディレクトリを変更する。

source: **Step 3**: Compile.
de: **Schritt 3**: Kompilieren.
ja: **ステップ3：**

source: **Step 4**: Run.
de: **Schritt 4**: Ausführen.
ja: **ステップ4：** 実行。

source: The code run, the buzzer plays a piece of music.
de: Die Kode läuft, der Summer spielt ein Musikstück.
ja: コードが実行されると、ブザーが音楽を再生する。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code**
ja: **コード**

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: These frequencies of each note are as shown. CL refers to low note, CM middle note, CH high note, 1-7 correspond to the notes C, D, E, F, G, A, B.
de: Diese Frequenzen jeder Note sind wie gezeigt. CL bezieht sich auf tiefe Note, CM mittlere Note, CH hohe Note, 1-7 entsprechen den Noten C, D, E, F, G, A, B.
ja: 各音の周波数は以下のように示している。CL－低音、CM－中音、CH－高音、1～7は音C、D、E、F、G、A、Bに対応する。

source: The array, song_1[] stores a musical score of a song in which beat_1[] refers to the beat of each note in the song (0.5s for each beat).
de: Das Array song_1 [] speichert eine Musikpartitur eines Gelieds, in der sich beat_1 [] auf der Schlage jeder Note im Gelied bezieht (0,5 S für jeder Schlage).
ja: 配列song_1 []は曲の楽譜を保存する。beat_1[]は曲の各音符の拍を表す（1拍ごとに0.5秒）。

source: This creates a software controlled tone pin. You can use any GPIO pin and the pin numbering will be that of the wiringPiSetup() function you used. The return value is 0 for success. Anything else and you should check the global errnovariable to see what went wrong.
de: Dadurch wird ein softwaregesteuerter Ton Pin erstellt. Sie können einen beliebigen GPIO-Pin verwenden. Die Pin-Nummerierung entspricht der von Ihnen verwendeten Funktion wiringPiSetup (). Der Rückgabewert ist 0 für Erfolg. Alles andere und Sie sollten die globale Fehlerbehebung überprüfen, um festzustellen, was schief gelaufen ist.
ja: これにより、ソフトウェア制御のトーンピンが作成される。任意のGPIOピンを使用でき、ピンの番号は使用したwiringPiSetup()関数の番号になる。成功した場合の戻り値は0である。それ以外の場合は、グローバル変数errnoをチェックして、何が問題なのかを確認する必要がある。

source: Employ a for statement to play song_1.
de: Verwenden Sie eine for-Anweisung, um song_1 abzuspielen.
ja: song_1を再生するためにfor statementを使用する。

source: In the judgment condition, **i<sizeof(song_1)/4**\ ，“devide by 4” is used because the array song_1[] is an array of the data type of integer, and each element takes up four bytes.
de: In der Urteilsbedingung wird **i<sizeof(song_1)/4**\, "devide by 4" verwendet, da das Array song_1[] ein Array des Datentyps ganzer Nummer ist und jedes Element vier Bytes in Anspruch nimmt.
ja: 判断条件 **i<sizeof(song_1)/4** では、 配列song_1 []は整数のデータ型の配列であり、各要素は4拍を占有するため、「devide by 4」が使用されている。

source: The number of elements in song_1 (the number of musical notes) is gotten by deviding sizeof(song_4) by 4.
de: Die Anzahl der Elemente in song_1 (die Anzahl der Noten) wird erhalten, indem sizeof (song_4) um 4 geteilt wird.
ja: song_1の要素の数（音符の数）は、sizeof（song_4）を4で割ることによって得られる。

source: To enable each note to play for beat \* 500ms, the function delay(beat_1[i] \* 500) is called.
de: Damit jede Note für Schlage \* 500ms gespielt werden kann, wird die Funktionsverzögerung (Beat_1 [i] \* 500) aufgerufen.
ja: 各音符を拍* 500msで再生できるようにするには、関数delay（beat_1 [i] * 500）が呼び出される。

source: The prototype of softToneWrite(BuzPin, song_1[i])：
de: Der Prototyp von softToneWrite(BuzPin, song_1[i]):
ja: softToneWrite（BuzPin、song_1 [i]）のプロトタイプ：

source: This updates the tone frequency value on the given pin. The tone does not stop playing until you set the frequency to 0.
de: Dadurch wird der Tonfrequenzwert am angegebenen Pin aktualisiert. Der Ton hört erst auf zu spielen, wenn Sie die Frequenz auf 0 eingestellen.
ja: これにより、指定されたピンのトーン周波数値が更新される。周波数を0に設定するまで、トーンの再生は停止しない。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 2: Change directory.**
de: **Schritt 2:** Verzeichnis wechseln.
ja: **ステップ2：ディレクトリを変更する。**

source: **Step 3: Run.**
de: **Schritt 3:** Ausführen.
ja: **ステップ3：実行する。**

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: These are the frequencies of each note. The first 0 is to skip CL[0] so that the number 1-7 corresponds to the CDEFGAB of the tone.
de: Dies sind die Frequenzen jeder Note. Die erste 0 ist das Überspringen von CL[0], so dass die Nummer 1-7 dem CDEFGAB des Tons entspricht.
ja: これらは各音符の周波数である。番号1〜7が音色のCDEFGABに対応するように、最初の0はCL [0]をスキップする。

source: These arrays are the notes of a song.
de: Diese Arrays sind die Noten eines Gelieds.
ja: これらの配列は歌の音符である。

source: Every sound beat (each number) represents the ⅛ beat, or 0.5s
de: Jeder Klangschlage (jede Nummer) repräsentiert den ⅛-Schlage oder 0.5s
ja: すべての音符の拍（各番号）は、⅛拍で、つまり0.5秒を表す

source: Define pin Buzzer as PWM pin, then set its frequency to 440 and Buzz.start(50) is used to run PWM. What’s more, set the duty cycle to 50%.
de: Definieren Sie den Pin-Summer als PWM-Pin, stellen Sie dann seine Frequenz auf 440 ein und Buzz.start (50) wird zum Ausführen von PWM verwendet. Und stellen Sie auch den Arbeitszyklus auf 50% ein.
ja: ピンブザーをPWMピンとして定義し、その周波数を440に設定し、Buzz.start（50）を使用してPWMを実行する。さらに、デューティサイクルを50％に設定する。

source: Run a for loop, then the buzzer will play the notes in the array song_1[] with the beats in the beat_1[] array, .
de: Führen Sie eine for-Schleife aus, dann spielt der Summer die Noten im Array song_1 [] mit den Schlagen im Array beat_1 [].
ja: for 文を実行すると、ブザーは配列song_1 []の音符をbeat_1 []配列の拍で再生する。

source: Now you can hear the passive buzzer playing music.
de: Jetzt können Sie den passiven Summer Musik spielen hören.
ja: これで、パッシブブザーが音楽を再生していることが聞こえる。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像
