Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/1.3.2_servo.po
Languages: de, ja

source: 1.3.2 Servo
ja: 1.3.2 サーボ

source: Introduction
de: Einführung
ja: 前書き

source: In this lesson, we will learn how to make the servo rotate.
de: In dieser Lektion lernen wir, wie man das Servo dreht.
ja: このレッスンでは、サーボを回転させる方法を学ぶ。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: **Servo**
ja: **サーボ**

source: A servo is generally composed of the following parts: case, shaft, gear system, potentiometer, DC motor, and embedded board.
de: Ein Servo besteht im Allgemeinen aus folgenden Teilen: Gehäuse, Welle, Getriebe, Potentiometer, Gleichstrommotor und eingebettete Platine.
ja: サーボは一般に、ケース、シャフト、ギアシステム、ポテンショメーター、DCモーター、および内蔵式ボードで構成されている。

source: It works like this: The microcontroller sends out PWM signals to the servo, and then the embedded board in the servo receives the signals through the signal pin and controls the motor inside to turn. As a result, the motor drives the gear system and then motivates the shaft after deceleration. The shaft and potentiometer of the servo are connected together. When the shaft rotates, it drives the potentiometer, so the potentiometer outputs a voltage signal to the embedded board. Then the board determines the direction and speed of rotation based on the current position, so it can stop exactly at the right position as defined and hold there.
de: Das funktioniert so: Der Mikrocontroller sendet PWM-Signale an das Servo, und dann empfängt die im Servo eingebettete Karte die Signale über den Signal Pin und steuert den Motor im Inneren, um sich zu drehen. Infolgedessen treibt der Motor das Zahnradsystem an und motiviert dann die Welle nach dem Abbremsen. Die Welle und das Potentiometer des Servos sind miteinander verbunden. Wenn sich die Welle dreht, treibt sie das Potentiometer an, sodass das Potentiometer ein Spannungssignal an die eingebettete Platine ausgibt. Dann bestimmt das Board die Richtung und Geschwindigkeit der Drehung basierend auf der aktuellen Position, so dass es genau an der richtigen Position wie definiert anhalten und dort halten kann.
ja: これは次のように動作する：マイクロコントローラーはPWM信号をサーボに送信し、サーボの内蔵式ボードは信号ピンを介して信号を受信し、内部のモーターを制御して回転させる。その結果、モーターはギアシステムを駆動し、減速後にシャフトを駆動する。サーボのシャフトとポテンショメーターは接続されている。シャフトが回転する時、ポテンショメーターが駆動されるため、ポテンショメーターは電圧信号を内蔵式ボードに出力する。その後、ボードは現在の位置に基づいて回転の方向と速度を決めるため、定義された位置で正確に停止してそのまま保持する。

source: The angle is determined by the duration of a pulse that is applied to the control wire. This is called Pulse width Modulation. The servo expects to see a pulse every 20 ms. The length of the pulse will determine how far the motor turns. For example, a 1.5ms pulse will make the motor turn to the 90 degree position (neutral position).
de: Der Winkel wird durch die Dauer eines Impulses bestimmt, der an den Steuerdraht angelegt wird. Dies wird als Pulsweitenmodulation bezeichnet. Das Servo erwartet alle 20 ms einen Impuls. Die Länge des Impulses bestimmt, wie weit sich der Motor dreht. Zum Beispiel bringt ein Impuls von 1,5 ms den Motor in die 90-Grad-Position (neutrale Position).
ja: 角度は制御ワイヤに適用されるパルスの持続時間によって決まる。これはパルス幅変調と呼ばれる。サーボは20ミリ秒ごとに1パルスを期待している。パルスの長さにより、モーターの回転距離が決まる。たとえば、1.5msパルスは、モーターを90度の位置（ニュートラル位置）に回転させる。

source: When a pulse is sent to a servo that is less than 1.5 ms, the servo rotates to a position and holds its output shaft some number of degrees counterclockwise from the neutral point. When the pulse is wider than 1.5 ms the opposite occurs. The minimal width and the maximum width of pulse that will command the servo to turn to a valid position are functions of each servo. Generally the minimum pulse will be about 0.5 ms wide and the maximum pulse will be 2.5 ms wide.
de: Wenn ein Impuls an ein Servo gesendet wird, das weniger als 1,5 ms beträgt, dreht sich das Servo in eine Position und hält seine Ausgangswelle einige Grad gegen den Uhrzeigersinn vom Neutralpunkt entfernt. Wenn der Impuls breiter als 1,5 ms ist, tritt das Gegenteil auf. Die minimale Breite und die maximale Impulsbreite, die das Servo anweisen, sich in eine gültige Position zu drehen, sind Funktionen jedes Servos. Im Allgemeinen ist der minimale Impuls ungefähr 0,5 ms breit und der maximale Impuls ist 2,5 ms breit.
ja: 1.5 ms未満のパルスがサーボに送信されると、サーボはある位置まで回転し、出力軸をニュートラル位置から反時計回りにある程度保持する。パルスが1.5ミリ秒を上回る場合、逆のことが起こる。有効な位置にサーボを回転させるように命令するパルスの最小幅と最大幅は、各サーボの機能である。通常、パルスの最小幅は約0.5 msで、最大幅は2.5 msである。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 2**: Go to the folder of the code.
de: **Schritt 2**: Gehen Sie zum Ordner des Codes.
ja: **ステップ2：** コードのフォルダーに入る。

source: **Step 3**: Compile the code.
de: **Schritt 3**: Kompilieren Sie den Code.
ja: **ステップ3：** コードをコンパイルする。

source: **Step 4**: Run the executable file.
de: **Schritt 4**: Führen Sie die ausführbare Datei aus.
ja: **ステップ4：** EXEファイルを実行する。

source: After the program is executed, the servo will rotate from 0 degrees to 180 degrees, and then from 180 degrees to 0 degrees, circularly.
de: Nachdem das Programm ausgeführt wurde, dreht sich das Servo kreisförmig von 0 Grad auf 180 Grad und dann von 180 Grad auf 0 Grad.
ja: プログラムが実行されると、サーボは0度から180度まで回転し、それから180度から0度まで循環的に回転する。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code**
ja: **コード**

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: Create a Map() function to map value in the following code.
de: Erstellen Sie eine Map() - Funktion, um den Wert im folgenden Kode zuzuordnen.
ja: 次のコードで値をマップするMap()関数を作成する。

source: Create a funtion, setAngle() to write angle to the servo.
de: Erstellen Sie eine Funktion, setAngle (), um den Winkel zum Servo zu schreiben.
ja: 角度をサーボに書き込むために、関数setAngle()を作成する。

source: This function can change the duty cycle of the PWM.
de: Diese Funktion kann das Einschaltdauer der PWM ändern.
ja: この関数はPWMのデューティサイクルを変更できる。

source: To make the servo rotate to 0 ~ 180 °, the pulse width should change within the range of 0.5ms ~ 2.5ms when the period is 20ms; in the function, softPwmCreate(), we have set that the period is 200x100us=20ms, thus we need to map 0 ~ 180 to 5x100us ~ 25x100us.
de: Damit sich das Servo auf 0 bis 180° dreht, sollte sich die Impulsbreite im Bereich von 0,5 ms bis 2,5 ms ändern, wenn die Periode 20 ms beträgt. In der Funktion softPwmCreate() haben wir festgelegt, dass der Zeitraum 200x100us = 20ms beträgt. Daher müssen wir 0 ~ 180 bis 5x100us ~ 25x100us zuordnen.
ja: サーボを0〜180°に回転させるために、周期が20msのときにパルス幅を0.5ms〜2.5msの範囲内で変更してください。関数softPwmCreate()では、周期が200x100us = 20msに設定されているため、0〜180を5x100us〜25x100usにマッピングする必要がある。

source: The prototype of this function is shown below.
de: Der Prototyp dieser Funktion ist unten dargestellt.
ja: この関数のプロトタイプを以下に示す。

source: **Parameter pin:** Any GPIO pin of Raspberry Pi can be set as PWM pin.
de: **Parameter-Pin:** Jeder GPIO-Pin von Raspberry Pi kann als PWM-Pin gesetzt werden.
ja: **パラメーターピン：** Raspberry PiのGPIOピンはPWMピンとして設定できる。

source: **Parameter initialValue:** The initial pulse width is that initialValue times 100us.
de: **Parameter initialValue:** Die anfängliche Impulsbreite ist der initialValue mal 100us.
ja: **パラメータinitialValue：** 初期パルス幅は、initialValueに100usを掛けたものである。

source: **Parameter pwmRange:** the period of PWM is that pwmRange times 100us.
de: **Parameter pwmRange:** Die Periode von PWM ist die pwmRange mal 100us.
ja: **パラメーターpwmRange：** PWMの周期は、pwmRangeに100usを掛けたものである。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 3**: Run the executable file.
de: **Schritt 3**: Führen Sie die ausführbare Datei aus.
ja: **ステップ3：** EXEファイルを実行する。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi\\python``.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、「davinci-kit-for-raspberry-pi\\python」のようなソースコードパスに移動する必要があります。

source: Set the servoPin to PWM pin, then the frequency to 50hz, and the period to 20ms.
de: Stellen Sie den ServoPin auf den PWM-Pin, dann die Frequenz auf 50 Hz und die Periode auf 20 ms.
ja: servoPinをPWMピンに設定し、次に周波数を50hzに、周期を20msに設定する。

source: p.start(0): Run the PWM function，and set the initial value to 0.
de: p.start (0): Führen Sie die PWM-Funktion, und setzen Sie den Anfangswert auf 0.
ja: p.start(0): PWM関数を実行し、初期値を0に設定する。

source: Create a function, setAngle() to write angle that ranges from 0 to 180 into the servo.
de: Erstellen Sie eine Funktion, setAngle (), um einen Winkel von 0 bis 180 in das Servo zu schreiben.
ja: 関数setAngle()を作成して、0〜180の範囲の角度をサーボに書き込む。

source: This code is used to limit the angle within the range 0-180°.
de: Diese Kode wird verwendet, um den Winkel im Bereich von 0 bis 180 ° zu begrenzen.
ja: このコードは角度を0〜180°の範囲に制限するために使用される。

source: The min() function returns the minimum of the input values. If 180<angle, then return 180,if not, return angle.
de: Die Funktion min () gibt das Minimum der Eingabewerte zurück. Wenn 180 <Winkel, then 180 zurückgeben, wenn nicht, Winkel zurückgeben .
ja: min()関数は入力値の最小値を返す。角度が180以下の場合、180を返す。そうではない場合、角度を返す。

source: The max() method returns the maximum element in an iterable or largest of two or more parameters. If 0>angle, then return 0, if not, return angle.
de: Die max () -Methode gibt das maximale Element in einem iterierbaren oder größten von zwei oder mehr Parametern zurück. Wenn 0> Winkel, dann 0 zurückgeben, wenn nicht, Winkel zurückgeben.
ja: max()メソッドは、反復可能または最大の2つ以上のパラメーターで最大要素を返す。角度が0以上の場合は0を返し、そうでない場合は角度を返す。

source: To render a range 0 ~ 180 ° to the servo, the pulse width of the servo is set to 0.5ms(500us)-2.5ms(2500us).
de: Um einen Bereich von 0 bis 180° zum Servo zu rendern, wird die Impulsbreite des Servos auf 0,5 ms (500 us) bis 2,5 ms (2500 us) eingestellt.
ja: 0〜180°の範囲をサーボにレンダリングすると、サーボのパルス幅は0.5ms（500us）〜2.5ms（2500us）に設定される。

source: The period of PWM is 20ms(20000us), thus the duty cycle of PWM is (500/20000)%-(2500/20000)%, and the range 0 ~ 180 is mapped to 2.5 ~ 12.5.
de: Die Periode der PWM beträgt 20 ms (20000us), daher beträgt das Tastverhältnis der PWM (500/20000)% - (2500/20000)%, und der Bereich 0 bis 180 wird auf 2.5 bis 12.5 abgebildet.
ja: PWMの周期は20ms（20000us）であるため、PWMのデューティサイクルは（500/20000）％-（2500/20000）％であり、0〜180の範囲は2.5〜12.5にマッピングされる。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
