Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/1.3.3_stepper_motor.po
Languages: de, ja

source: 1.3.3 Stepper Motor
de: 1.3.3 Schrittmotor
ja: 1.3.3 ステッピングモーター

source: Introduction
de: Einführung
ja: 前書き

source: Stepper motors, due to their unique design, can be controlled to a high degree of accuracy without any feedback mechanisms. The shaft of a stepper, mounted with a series of magnets, is controlled by a series of electromagnetic coils that are charged positively and negatively in a specific sequence, precisely moving it forward or backward in small \"steps\".
de: Schrittmotoren können aufgrund ihres einzigartigen Designs ohne Rückkopplungsmechanismen mit hoher Genauigkeit gesteuert werden. Die Welle eines Schrittmachers, der mit einer Reihe von Magneten montiert ist, wird von einer Reihe elektromagnetischer Spulen gesteuert, die in einer bestimmten Reihenfolge positiv und negativ geladen werden und diese in kleinen "Schritten" präzise vorwärts oder rückwärts bewegen.
ja: 独自の設計により、ステッピングモーターはフィードバックメカニズムなしで高度な精度で制御できる。一連の磁石が取り付けられたステッパーのシャフトは、特定のシーケンスで正と負に帯電する一連の電磁コイルによって制御され、小さな「ステップ」で前後に正確に移動する。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: **Stepper Motor**
de: **Schrittmotor**
ja: **ステッピングモーター**

source: There are two types of steppers, unipolars and bipolars, and it is very important to know which type you are working with. In this experiment, we will use a unipolar stepper.
de: Es gibt zwei Typen von Steppern, Unipolare und Bipolare, und es ist sehr wichtig zu wissen, mit welchem Typ Sie arbeiten. In diesem Experiment verwenden wir einen unipolaren Stepper.
ja: ステッパーには、ユニポーラーとバイポーラーの2つのタイプがあり、使用しているタイプを知ることが非常に重要である。この実験では、ユニポーラステッパーを使用する。

source: The stepper motor is a four-phase one, which uses a unipolarity DC power supply. As long as you electrify all phase windings of the motor by an appropriate timing sequence, you can make it rotate step by step. The schematic diagram of a four-phase reactive stepper motor:
de: Der Schrittmotor ist ein Vierphasenmotor, der eine Gleichstromversorgung mit Unipolarität verwendet. Solange Sie alle Phasenwicklungen des Motors durch eine geeignete Zeitfolge elektrifizieren, können Sie ihn Schritt für Schritt drehen lassen. Das schematische Diagramm eines vierphasigen reaktiven Schrittmotors:
ja: ステッピングモーターは単相DC電源を使用する4相モーターである。適切な時系列でモーターのすべての相巻線に通電する限り、一歩一歩に回転させることができる。4相リアクティブステッピングモーターの概略図：

source: In the figure, in the middle of the motor is a rotor - a gear-shaped permanent magnet. Around the rotor, 0 to 5 are teeth. Then more outside, there are 8 magnetic poles, with each two opposite ones connected by coil winding. So they form four pairs from A to D, which is called a phase. It has four lead wires to be connected with switches SA, SB, SC, and SD. Therefore, the four phases are in parallel in the circuit, and the two magnetic poles in one phase are in series.
de: In der Abbildung befindet sich in der Mitte des Motors ein Rotor - ein zahnradförmiger Permanentmagnet. Um den Rotor herum sind 0 bis 5 Zähne. Dann weiter draußen gibt es 8 Magnetpole, wobei jeweils zwei gegenüberliegende durch Spulenwicklung verbunden sind. Sie bilden also vier Paare von A nach D, was als Phase bezeichnet wird. Es verfügt über vier Anschlusskabel, die mit den Schaltern SA, SB, SC und SD verbunden werden können. Daher sind die vier Phasen in der Schaltung parallel und die zwei Magnetpole in einer Phase sind in Reihe geschaltet.
ja: 図では、モーターの中央にローター-歯車状の永久磁石がある。ローターの周りの0〜5は歯である。さらに外側には、8つの磁極があり、それぞれ反対側の2つの磁極がコイル巻線で接続されている。そのため、AからDまでの4つのペアを形成し、相と呼ばれる。スイッチSA、SB、SC、SDに接続するリード線が4本ある。したがって、回路では4つの相が並列になっており、1つの相の2つの磁極は直列になっている。

source: **Here's how a 4-phase stepper motor works:**
de: **So funktioniert ein 4-Phasen-Schrittmotor:**
ja: **4相ステッピングモーターの動作原理は次の通りである:**

source: When switch SB is power on, switch SA, SC, and SD is power off, and B-phase magnetic poles align with tooth 0 and 3 of the rotor. At the same time, tooth 1 and 4 generate staggered teeth with C- and D-phase poles. Tooth 2 and 5 generate staggered teeth with D- and A-phase poles. When switch SC is power on, switch SB, SA, and SD is power off, the rotor rotates under magnetic field of C-phase winding and that between tooth 1 and 4. Then tooth 1 and 4 align with the magnetic poles of C-phase winding. While tooth 0 and 3 generate staggered teeth with A- and B-phase poles, and tooth 2 and 5 generate staggered teeth with the magnetic poles of A- and D-phase poles. The similar situation goes on and on. Energize the A, B, C and D phases in turn, and the rotor will rotate in the order of A, B, C and D.
de: Wenn der Schalter SB eingeschaltet ist, sind die Schalter SA, SC und SD ausgeschaltet, und die B-Phasen-Magnetpole sind auf die Zähne 0 und 3 des Rotors ausgerichtet. Gleichzeitig erzeugen Zahn 1 und 4 versetzte Zähne mit C- und D-Phasenpolen. Zahn 2 und 5 erzeugen versetzte Zähne mit D- und A-Phasenpolen. Wenn der Schalter SC eingeschaltet ist, die Schalter SB, SA und SD ausgeschaltet sind, dreht sich der Rotor unter dem Magnetfeld der C-Phasenwicklung und dem zwischen Zahn 1 und 4. Dann richten sich Zahn 1 und 4 an den Magnetpolen der C-Phasenwicklung aus. Während Zahn 0 und 3 versetzte Zähne mit A- und B-Phasenpolen erzeugen, erzeugen Zahn 2 und 5 versetzte Zähne mit den Magnetpolen von A- und D-Phasenpolen. Die ähnliche Situation geht weiter und weiter. Schalten Sie die Phasen A, B, C und D nacheinander ein, und der Rotor dreht sich in der Reihenfolge A, B, C und D.
ja: スイッチSBの電源がオンになると、スイッチSA、SC、およびSDの電源がオフになり、B相の磁極がローターの歯0と3と整列する。同時に、歯1と4は、C相とD相の極を持つ互い違いに配列した歯を生成する。歯2と5は、D相とA相の極を持つ互い違いに配列した歯を生成する。スイッチSCの電源がオン、スイッチSB、SA、およびSDの電源がオフの場合、ローターはC相巻線の磁場と歯1と4の間の磁場の下で回転する。次に、歯1と4がC相巻線の磁極と整列する。一方、歯0と3はA相とB相の極を持つ互い違いに配列した歯を生成し、歯2と5はA相とD相の極を持つ互い違いに配列した歯を生成する。同様の状況が続いていく。A、B、C、D相に順番に通電すると、ローターはA、B、C、Dの順に回転する。

source: The four-phase stepper motor has three operating modes: single four-step, double four-step, and eight-step. The step angle for the single four-step and double four-step are the same, but the driving torque for the single four-step is smaller. The step angle of the eight-step is half that of the single four-step and double four-step. Thus, the eight-step operating mode can keep high driving torque and improve control accuracy.
de: Der Vierphasen-Schrittmotor verfügt über drei Betriebsarten: einfach vierstufig, doppelt vierstufig und achtstufig. Der Schrittwinkel für den einzelnen vierstufigen und den doppelten vierstufigen ist gleich, aber das Antriebsmoment für den einzelnen vierstufigen ist kleiner. Der Schrittwinkel des Achtstufens ist halb so groß wie der des Einzel-Vier-Stufen- und des Doppel-Vier-Stufen-Winkels. Somit kann der achtstufige Betriebsmodus ein hohes Antriebsmoment beibehalten und die Steuergenauigkeit verbessern.
ja: 4相ステッピングモーターには、3つの動作モードがある：シングル4ステップ、ダブル4ステップ、および8ステップ。シングル4ステップとダブル4ステップのステップ角は同じであるが、シングル4ステップの駆動トルクは小さくなる。8ステップのステップ角は、シングル4ステップおよびダブル4ステップの半分である。したがって、8ステップの動作モードは、高い駆動トルクを維持し、制御精度を向上させることができる。

source: The stator of Stepper Motor we use has 32 magnetic poles, so a circle needs 32 steps. The output shaft of the Stepper Motor is connected with a reduction gear set, and the reduction ratio is 1/64. So the final output shaft rotates a circle requiring a 32*64=2048 step.
de: Der von uns verwendete Stator des Schrittmotors hat 32 Magnetpole, sodass ein Kreis 32 Schritte benötigt. Die Abtriebswelle des Schrittmotors ist mit einem Untersetzungsgetriebesatz verbunden, und das Untersetzungsverhältnis beträgt 1/64. Die endgültige Abtriebswelle dreht also einen Kreis, der einen Schritt von 32 * 64 = 2048 erfordert.
ja: 使用するステッピングモーターのステータには32個の磁極があるため、円には32ステップが必要である。ステッピングモーターの出力軸は減速装置セットに接続され、減速比は1/64である。ですから、最終出力シャフトは32 * 64 = 2048ステップを必要とする円を回転させる。

source: To apply the motor in the circuit, a driver board needs to be used. Stepper Motor Driver-ULN2003 is a 7-channel inverter circuit. That is, when the input pin is at high level, the output pin of ULN2003 is at low level, and vice versa. If we supply high level to IN1, and low level to IN2, IN3 and IN4, then the output end OUT1 is at low level, and all the other output ends are at high level. The internal structure of the chip is shown as below.
de: Um den Motor in die Schaltung einzubringen, muss eine Treiberplatine verwendet werden. Stepper Motor Driver-ULN2003 ist eine 7-Kanal-Inverterschaltung. Das heißt, wenn der Eingangspin auf High-Pegel ist, ist der Ausgangspin von ULN2003 auf Low-Pegel und umgekehrt. Wenn wir IN1 High-Pegel und IN2, IN3 und IN4 Low-Pegel liefern, dann ist das Ausgangsende OUT1 auf Low-Pegel und alle anderen Ausgangsenden auf High-Pegel. Die interne Struktur des Chips ist wie folgt dargestellt.
ja: モーターを円に適用するには、ドライバーボードを使用する必要があります。ステッパーモータードライバ-ULN2003は7チャネルインバータサークルです。つまり、入力ピンが高レベルの場合、ULN2003の出力ピンは低レベルであり、その逆も同様です。IN1 に高レベルを供給し、IN2、IN3、IN4 に低レベルを供給すると、出力端 OUT1 は低レベルであり、他のすべての出力端は高レベルになります。チップの内部構造を以下に示します。

source: The stepper motor driver constituted by ULN2003 chip and 4 LEDs is shown as follows. On the board, IN1,IN2,IN3 and IN4 work as input and the four LEDs, A, B, C, D are the indicators of input pin. In addition, OUT1,OUT2, OUT3 and OUT4 are connected to SA, SB, SC and SD on the stepper motor driver. When the value of IN1 is set to a high level, A lights up; switch SA is power on, and the stepper motor rotates one step. The similar case repeats on and on. Therefore, just give the stepper motor a specific timing sequence, it will rotate step by step. The ULN2003 here is used to provide particular timing sequences for the stepper motor.
de: Der Schrittmotortreiber, der aus dem ULN2003-Chip und 4 LEDs besteht, ist wie folgt dargestellt. Auf der Platine fungieren IN1, IN2, IN3 und IN4 als Eingang und die vier LEDs A, B, C, D sind die Anzeigen des Eingangspins. Zusätzlich sind OUT1, OUT2, OUT3 und OUT4 mit SA, SB, SC und SD am Schrittmotortreiber verbunden. Wenn der Wert von IN1 auf einen hohen Niveau eingestellt ist, leuchtet A auf; Schalter SA ist eingeschaltet und der Schrittmotor dreht sich einen Schritt. Der ähnliche Fall wiederholt sich immer weiter. Geben Sie dem Schrittmotor daher einfach eine bestimmte Zeitfolge, er dreht sich Schritt für Schritt. Der ULN2003 wird hier verwendet, um bestimmte Zeitabläufe für den Schrittmotor bereitzustellen.
ja: ULN2003チップと4つのLEDで構成されるステッピングモータードライバーを以下に示す。ボードでは、IN1、IN2、IN3、IN4が入力として機能し、4つのLED、A、B、C、Dは入力ピンの指示器である。さらに、OUT1、OUT2、OUT3、およびOUT4はそれぞれ、ステッピングモータードライバーのSA、SB、SC、およびSDに接続されている。IN1の値が高レベルに設定されると、Aが点灯し、スイッチSAの電源がオンになり、ステッピングモーターが1ステップで回転する。同様のケースが何度も繰り返される。したがって、ステッピングモーターに特定の時系列を与えるだけで、ステップごとに回転する。ステッピングモーターに特定の時系列を提供するために、ここでULN2003を使用する。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 2**: Go to the folder of the code.
de: **Schritt 2**: Gehen Sie zum Ordner des Codes.
ja: **ステップ2：** コードのフォルダーに入る。

source: **Step 3**: Compile the code.
de: **Schritt 3**: Kompilieren Sie den Code.
ja: **ステップ3：** コードをコンパイルする。

source: **Step 4**: Run the executable file.
de: **Schritt 4**: Führen Sie die ausführbare Datei aus.
ja: **ステップ4：** EXEファイルを実行する。

source: As the code runs, the stepper motor will rotate clockwise or anticlockwise according to your input \'a\' or \'c\'.
de: Während der Code läuft, dreht sich der Schrittmotor entsprechend Ihrer Eingabe 'a' oder 'c' im oder gegen den Uhrzeigersinn.
ja: コードが実行されると、入力「a」または「c」に応じてステッピングモーターが時計回りまたは反時計回りに回転する。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code**
ja: **コード**

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: **rolePerMinute:** revolutions per minute, the RPM of the stepper motor used in this kit should be 0~17.
de: **rolePerMinute:** Umdrehungen pro Minute sollte die Drehzahl des in diesem Kit verwendeten Schrittmotors 0 bis 17 betragen.
ja: **rolePerMinute：** 1分あたりの回転数。このキットで使用されるステッピングモーターのRPMは0〜17である。

source: **stepPerRevolution:** the number of steps for each turn, and the stepper motor used in this kit needs 2048 steps per revolution.
de: **stepPerRevolution:** Die Anzahl der Schritte für jede Umdrehung und der in diesem Kit verwendete Schrittmotor benötigen 2048 Schritte pro Umdrehung.
ja: **stepPerRevolution：** 1ターンのステップ数、およびこのキットで使用されるステッピングモーターには、1回転あたり2048ステップが必要である。

source: **stepSpeed:** the time used for each step, and in main(), we assign the values to them:「(60000000 / rolePerMinute) / stepsPerRevolution」(60,000,000 us=1minute)
de: **stepSpeed:** Die für jeden Schritt verwendete Zeit. In main () weisen wir ihnen die folgenden Werte zu: 「(60000000 / rolePerMinute) / stepPerRevolution」 (60.000.000 us = 1 Minute)
ja: **stepSpeed：** 各ステップに使用される時間、main()では、それらに値を割り当てる。「（60000000/rolePerMinute）/ stepsPerRevolution」（60,000,000 us = 1分）

source: The loop() function is roughly divided into two parts (located between two while(1)) :
de: Die Funktion loop () ist grob in zwei Teile unterteilt (zwischen zwei während (1)):
ja: loop() 関数は、2つの部分（2つのwhile（1）の間にある）に大まかに分けられている：

source: The first part is to get the key value. When \'a\' or \'c\' is obtained, exit the loop and stop the input.
de: Der erste Teil besteht darin, den Schlüsselwert zu erhalten. Wenn 'a' oder 'c' erhalten wird, verlassen Sie die Schleife und stoppen Sie die Eingabe.
ja: 最初の部分の目的は、key valueを取得することである。「a」または「c」が取得されたら、ループを終了して入力を停止してください。

source: The second part calls rotary(direction) to make the stepper motor run.
de: Der zweite Teil ruft Drehung (Richtung) auf, um den Schrittmotor laufen zu lassen.
ja: 2番目の部分はロータリー（方向）を呼び出して、ステッピングモーターを動作させる。

source: To make stepper motor **rotate clockwise**, level status of motorPin should is shown in the table below:
de: Damit sich der Schrittmotor im **Uhrzeigersinn dreht**, sollte der Füllstandsstatus von motorPin in der folgenden Tabelle angezeigt werden:
ja: ステッピングモーターを **時計回りに回転させる** ために、motorPinのレベルス状態要求は以下の通りである：

source: Therefore, potential write of MotorPin is implemented by using a two-layer of for loop.
de: Daher wird das potentielle Schreiben von MotorPin unter Verwendung einer zweischichtigen for-Schleife implementiert.
ja: したがって、2層のfor文を使用してMotorPinの潜在的な書き込みを実装する。

source: In Step1, j=0, i=0~4.
de: In Schritt 1 ist j = 0, i = 0 ~ 4.
ja: Step1では、j=0、i=0〜4。

source: motorPin[0] will be written in the high level（10011001&00001000=1）
de: motorPin [0] wird in der hohen Ebene geschrieben (10011001 & 00001000 = 1)
ja: motorPin [0]は高レベル（10011001＆00001000 = 1）で書き込まれる

source: motorPin[1] will be written in the low level（10011001&00000100=0）
de: motorPin [1] wird auf dem niedrigen Niveau geschrieben (10011001 & 00000100 = 0)
ja: motorPin [1]は低レベル（10011001＆00000100=0）で書き込まれる

source: motorPin[2] will be written in the low level（10011001&00000010=0）
de: motorPin [2] wird in der niedrigen Ebene geschrieben (10011001 & 00000010 = 0)
ja: motorPin [2]は低レベル（10011001＆00000010 = 0）で書き込まれる

source: motorPin[3] will be written in the high level（10011001&00000001=1）
de: motorPin [3] wird in der hohen Ebene geschrieben (10011001 & 00000001 = 1)
ja: motorPin [3]は高レベル（10011001＆00000001=1）で書き込まれる

source: In Step2, j=1, i=0~4.
de: In Schritt 2 ist j = 1, i = 0 ~ 4.
ja: Step2では、j=1、i= 0〜4。

source: motorPin[0] will be written in the high level（01001100&00001000=1）
de: motorPin [0] wird in der hohen Ebene geschrieben (01001100 & 00001000 = 1)
ja: motorPin [0]は高レベル（01001100＆00001000 = 1）で書き込まれる

source: motorPin[1] will be written in the low level（01001100&00000100=1）
de: motorPin [1] wird auf dem niedrigen Niveau geschrieben (01001100 & 00000100 = 1)
ja: motorPin [1]は低レベル（01001100＆00000100 = 1）などで書き込

source: and so on.
de: usw.
ja: まれる。

source: And to make the stepper motor rotate **anti-clockwise**, the level status of motorPin is shown in the following table.
de: Damit sich der Schrittmotor gegen den **Uhrzeigersinn dreht**, wird der Füllstandsstatus von motorPin in der folgenden Tabelle angezeigt.
ja: また、ステッピングモーターを **反時計回り** に回転させるために、motorPinのレベルステータスを次の表に示す。

source: motorPin[0] will be written in the high level（10011001&10000000=1）
de: motorPin [0] wird in der hohen Ebene geschrieben (10011001 & 10000000 = 1)
ja: motorPin [0]は高レベル（10011001＆10000000 = 1）で書き込まれる

source: motorPin[1] will be written in the low level（10011001&01000000=0）
de: motorPin [1] wird auf dem niedrigen Niveau geschrieben (10011001 & 01000000 = 0)
ja: motorPin [1]は低レベル（10011001＆01000000 = 0）で書き込まれる

source: In Step2，j=1, i=0~4.
de: In Schritt 2 ist ， j = 1, i = 0 ~ 4.
ja: ステップ2では、j=1、i=0〜4。

source: motorPin[0] will be written in the high level（00110010&10000000=0）
de: motorPin [0] wird in der hohen Ebene geschrieben (00110010 & 10000000 = 0)
ja: motorPin [0]は高レベル（00110010＆10000000 = 0）で書き込まれる

source: motorPin[1] will be written in the low level（00110010&01000000=0）
de: motorPin [1] wird auf dem niedrigen Niveau geschrieben (00110010 & 01000000 = 0)
ja: motorPin [1]は低レベル（00110010＆01000000 = 0）で書き込まれる

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 3**: Run the executable file.
de: **Schritt 3**: Führen Sie die ausführbare Datei aus.
ja: **ステップ3：** EXEファイルを実行する。

source: As the code runs, the stepper motor will turn clockwise or anti-clockwise depending on your input \'a\' or \'c\'.
de: Während der Code läuft, dreht sich der Schrittmotor abhängig von Ihrer Eingabe 'a' oder 'a' im oder gegen den Uhrzeigersinn.
ja: コードが実行されると、入力「a」または「c」に応じて、ステッピングモーターが時計回りまたは反時計回りに回転する。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: **stepSpeed:** the time used for each step, and we assign the values to them:「(60 / rolePerMinute) / stepsPerRevolution」(60s=1minute).
de: **Schritt Geschwindigkeit:** Die Zeit, die für jeden Schritt verwendet wird, und wir weisen ihnen die Werte zu: 「(60 / rolePerMinute) / stepPerRevolution」 (60s = 1minute).
ja: **stepSpeed：** 各ステップに使用される時間。それらに値を割り当てる：「（60/ rolePerMinute）/stepsPerRevolution」（60s = 1分）。

source: The loop() function is roughly divided into two parts (located in two while(1)) :
de: Die Funktion loop () ist grob in zwei Teile unterteilt (in zwei Teilen, während (1)):
ja: loop() 関数は、大きく分けて2つの部分に分かれている（2つのwhile（1）にある）：

source: To make the stepper motor rotate clockwise, the level status of motorPin is shown in the following table:
de: Um den Schrittmotor im Uhrzeigersinn drehen zu lassen, wird der Niveau status von motorPin in der folgenden Tabelle angezeigt:
ja: ステッピングモーターを時計回りに回転させるために、motorPinのレベルステータスを次の表に示す：

source: and so on
de: usw
ja: まれる

source: And to make the stepper motor rotate anti - clockwise, the level status of motorPin is shown in the following table.
de: Um den Schrittmotor gegen den Uhrzeigersinn drehen zu lassen, wird der Füllstandsstatus von motorPin in der folgenden Tabelle angezeigt.
ja: また、ステッピングモーターを反時計回りに回転させるために、motorPinのレベルステータスを次の表に示す。

source: And so on.
de: usw.
ja: まれる。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像
