Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/2.1.5_keypad.po
Languages: de, ja

source: 2.1.5 Keypad
de: 2.1.5 Tastatur
ja: 2.1.5 キーパッド

source: Introduction
de: Einführung
ja: 前書き

source: A keypad is a rectangular array of buttons. In this project, We will use it input characters.
de: Eine Tastatur ist eine rechteckige Anordnung von Schaltflächen. In diesem Projekt werden wir Eingabezeichen verwenden.
ja: キーパッドは、ボタンの長方形の配列である。このプロジェクトでは、入力文字を使用する。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: **Keypad**
de: **Tastenfeld**
ja: **キーパッド**

source: A keypad is a rectangular array of 12 or 16 OFF-(ON) buttons. Their contacts are accessed via a header suitable for connection with a ribbon cable or insertion into a printed circuit board. In some keypads, each button connects with a separate contact in the header, while all the buttons share a common ground.
de: Eine Tastatur ist eine rechteckige Anordnung von 12 oder 16 AUS- (EIN) Tasten. Der Zugriff auf ihre Kontakte erfolgt über einen Header, der zum Anschluss mit einem Flachbandkabel oder zum Einsetzen in eine Leiterplatte geeignet ist. Bei einigen Tastaturen ist jede Taste mit einem separaten Kontakt in der Kopfzeile verbunden, während alle Tasten eine gemeinsame Masse haben.
ja: キーパッドは12個または16個のOFF-（ON）ボタンの長方形配列である。リボンケーブルとの接続またはプリント基板への挿入に適したヘッダーを介してそれらの接点にアクセスする。一部のキーパッドでは、各ボタンはヘッダーの個別の連絡先に接続されるが、すべてのボタンは共通の接地を共有する。

source: More often, the buttons are matrix encoded, meaning that each of them bridges a unique pair of conductors in a matrix. This configuration is suitable for polling by a microcontroller, which can be programmed to send an output pulse to each of the four horizontal wires in turn. During each pulse, it checks the remaining four vertical wires in sequence, to determine which one, if any, is carrying a signal. Pullup or pulldown resistors should be added to the input wires to prevent the inputs of the microcontroller from behaving unpredictably when no signal is present.
de: Häufiger sind die Tasten Matrix kodiert, was bedeutet, dass jede von ihnen ein eindeutiges Leiterpaar in einer Matrix überbrückt. Diese Konfiguration eignet sich zum Abfragen durch einen Mikrocontroller, der so programmiert werden kann, dass er nacheinander einen Ausgangsimpuls an jeden der vier horizontalen Drähte sendet. Während jedes Impulses werden die verbleibenden vier vertikalen Drähte nacheinander überprüft, um festzustellen, welcher, falls vorhanden, ein Signal führt. Pullup- oder Pulldown-Widerstände sollten zu den Eingangsleitungen hinzugefügt werden, um zu verhindern, dass sich die Eingänge des Mikrocontrollers unvorhersehbar verhalten, wenn kein Signal vorhanden ist.
ja: 多くの場合、ボタンはマトリックスエンコードされている。つまり、各ボタンはマトリックス内の一意のコンダクターペアをブリッジしている。この構成は、マイクロコントローラーによるポーリングに適し、4本の水平線のそれぞれに順番に出力パルスを送信するようにプログラムできる。各パルス中に、残りの4本の垂直ワイヤを順番にチェックして、信号を伝送しているのがどれかを判断する。信号が存在しない場合にマイクロコントローラの入力が予期しない動作をすることを防ぐため、入力ワイヤにプルアップまたはプルダウン抵抗を追加してください。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 2:** Open the code file.
de: **Schritt 2:** Öffnen Sie die Kodedatei.
ja: **ステップ2：** コードファイルを開く。

source: **Step 3:** Compile the code.
de: **Schritt 3:** Kompilieren Sie die Kode.
ja: **ステップ3：** コードをコンパイルする。

source: **Step 4:** Run.
de: **Schritt 4:** Ausführen.
ja: **ステップ4：** 実行する。

source: After the code runs, the values of pressed buttons on keypad (button Value) will be printed on the screen.
de: Nachdem die Kode ausgeführt wurde, werden die Werte der gedrückten Tasten auf der Tastatur (Tastenwert) auf dem Bildschirm gedruckt.
ja: コードの実行後、キーパッドで押されたボタンの値（ボタン値）が画面にプリントされる。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code**
ja: **コード**

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: Declare each key of the matrix keyboard to the array keys[] and define the pins on each row and column.
de: Deklarieren Sie jede Taste der Matrixtastatur zu den Array- keys[] und definieren Sie die Pins für jede Zeile und Spalte.
ja: マトリックスキーボードの各キーを配列keys []に表示し、各行と列にピンを定義する。

source: This is the part of the main function that reads and prints the button value.
de: Dies ist der Teil der Hauptfunktion, der den Tastenwert liest und druckt.
ja: これは、ボタン値を読み取り、プリントするメイン関数の一部である。

source: The function keyRead() will read the state of every button.
de: Die Funktion keys[] liest den Status jeder Taste.
ja: 関数keyRead() は、すべてのボタンの状態を読み取る。

source: KeyCompare() and keyCopy() are used to judge whether the state of a button has changed (that is, a button has been pressed or released).
de: Mit KeyCompare() und keyCopy () wird beurteilt, ob sich der Status einer Schaltfläche geändert hat (dh eine Schaltfläche wurde gedrückt oder losgelassen).
ja: KeyCompare() とkeyCopy() は、ボタンの状態が変化したかどうか（つまり、ボタンが押されたか離されたか）を判断するために使用される。

source: keyPrint() will print the button value of the button whose current level is high level (the button is pressed).
de: keyPrint() druckt den Tastenwert der Taste, deren aktueller Niveau hoch ist (die Taste wird gedrückt).
ja: keyPrint() は現在のレベルが高レベル（ボタンが押されている）のボタンのボタン値をプリントする。

source: This function assigns a high level to each row in turn, and when the key in the column is pressed, the column in which the key is located gets a high level. After the two-layer loop judgment, the key state compilation will generate an array (reasult[]).
de: Diese Funktion weist jeder Zeile nacheinander eine hohe Ebene zu, und wenn die Taste in der Spalte gedrückt wird, erhält die Spalte, in der sich die Taste befindet, eine hohe Ebene. Nach der zweischichtigen Schleifenbeurteilung generiert die Schlüsselzustandskompilierung ein Array (reasult[]).
ja: この関数は各行に順番に高レベルを割り当て、列のキーが押されると、キーが配置されている列が高レベルになる。two- layer loopの判定後、キー状態のコンパイルにより配列（reasult []）が生成される。

source: When pressing button 3:
de: Beim Drücken von Taste 3:
ja: ボタン3を押すとき：

source: RowPin [0] writes in the high level, and colPin[2] gets the high level. ColPin [0], colPin[1], colPin[3] get the low level.
de: RowPin [0] schreibt auf der hohen Ebene und colPin[2] erhält die hohe Ebene. ColPin [0], colPin[1], colPin[3] erhalten den niedrigen Wert.
ja: RowPin [0]は高レベルで書き込み、colPin [2]は高レベルになる。ColPin [0]、colPin [1]、colPin [3]は低レベルになる。

source: This gives us 0,0,1,0. When rowPin[1], rowPin[2] and rowPin[3] are written in high level, colPin[0]~colPin[4] will get low level.
de: Dies gibt uns 0,0,1,0. Wenn rowPin[1], rowPi [2] und rowPin[3] auf hoher Ebene geschrieben werden, wird colPin[0] ~ colPin[4] auf niedriger Ebene.
ja: これにより、0,0,1,0が得られる。rowPin [1]、rowPin [2]、rowPin [3]が高レベルで書き込まれると、colPin [0]〜colPin [4]は低レベルになる。

source: After the loop judgment is completed, an array will be generated:
de: Nach Abschluss der Schleifenbeurteilung wird ein Array generiert:
ja: ループ判定が完了すると、配列が生成される：

source: These two functions are used to judge whether the key state has changed, for example when you release your hand when pressing \'3\' or pressing \'2\', keyCompare() returns false.
de: Diese beiden Funktionen werden verwendet, um zu beurteilen, ob sich der Tastenstatus geändert hat. Wenn Sie beispielsweise Ihre Hand loslassen, wenn Sie '3' oder '2' drücken, gibt keyCompare () false zurück.
ja: これら二つの関数は、キーの状態が変化したかどうかを判断するために使用され、たとえば、「3」または「2」を押したときに手を離すと、keyCompare() はfalseを返す。

source: KeyCopy() is used to re-write the current button value for the a array (last_key_pressed[BUTTON_NUM]) after each comparison. So we can compare them next time.
de: Mit KeyCopy() wird der aktuelle Schaltflächenwert für ein Array (last_key_pressed[BUTTON_NUM]) nach jedem Vergleich neu geschrieben. So können wir sie beim nächsten Mal vergleichen.
ja: KeyCopy() はそれぞれの比較後に配列（last_key_pressed [BUTTON_NUM]）の現在のボタン値を書き換えるために使用される。ですから次回にそれらを比較できる。

source: This function is used to print the value of the button currently pressed. If the button \'1\' is pressed, the \'1\' will be printed. If the button \'1\' is pressed and the button \'3\' is pressed, the \'1, 3\' will be printed.
de: Mit dieser Funktion wird der Wert der aktuell gedrückten Taste gedruckt. Wenn die Taste '1' gedrückt wird, wird die '1' gedruckt. Wenn die Taste '1' gedrückt wird und die Taste '3' gedrückt wird, wird die '1, 3' gedruckt.
ja: この関数は現在押されているボタンの値をプリントするために使用される。「1」ボタンを押すと、「1」がプリントされる。ボタン「1」と「3」が押されると、「1、3」がプリントされる。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 3:** Run.
de: **Schritt 3:** Ausführen.
ja: **ステップ3：** 実行する。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: The statement if len(pressed_keys) != 0 and last_key_pressed != pressed_keys is used to judge
de: Die Anweisung if len(pressed_keys) != 0 und last_key_pressed != pressed_keys wird zur Beurteilung verwendet
ja: if len（pressed_keys）！= 0とlast_key_pressed！= Pressed_keysのステートメントは、

source: whether a key is pressed and the state of the pressed button. (If you press \'3\' when you press \'1\', the judgement is tenable.)
de: ob eine Taste gedrückt wird und der Status der gedrückten Taste. (Wenn Sie '3' drücken, während Sie '1' drücken, ist das Urteil haltbar.)
ja: キーが押されたかどうか、押されたボタンの状態を判断するために使用される。（「1」を押したときに「3」を押した場合、判断は受け入れられる。）

source: Prints the value of the currently pressed key when the condition is tenable.
de: Druckt den Wert der aktuell gedrückten Taste, wenn die Bedingung haltbar ist.
ja: 条件が主張できる場合、現在押されているキーの値をプリントする。

source: The statement last_key_pressed = pressed_keys assigns the state of each judgment to an array last_key_pressed to facilitate the next round of conditional judgment.
de: Die Anweisung last_key_pressed = pressed_keys weist einem Array last_key_pressed den Status jeder Beurteilung zu, um die nächste Runde der bedingten Beurteilung zu erleichtern.
ja: ステートメントlast_key_pressed = pressed_keysは、それぞれの判断の状態を配列last_key_pressedに割り当て、次の条件判断を容易にする。

source: This function assigns a high level to each row in turn, and when the button in the column is pressed, the column in which the key is located gets a high level. After the two-layer loop is judged, the value of the button whose state is 1 is stored in the array pressed_keys.
de: Diese Funktion weist jeder Zeile nacheinander eine hohe Ebene zu, und wenn die Schaltfläche in der Spalte gedrückt wird, erhält die Spalte, in der sich die Taste befindet, eine hohe Ebene. Nachdem die Zweischichtschleife beurteilt wurde, wird der Wert der Schaltfläche, deren Status 1 ist, im Array press_keys gespeichert.
ja: この関数は各行に順番に高レベルを割り当て、列のボタンが押されると、キーが配置されている列が高レベルになる。2層ループが判定された後、状態が1のボタンの値は、pressed_keys配列に保存される。

source: If you press the key \'3\':
de: Wenn Sie die Taste '3' drücken:
ja: キー「3」を押すと：

source: rowPins[0] is written in high level, and colPins[2] gets high level.
de: rowPins[0] wird auf hoher Ebene geschrieben, und colPins[2] wird auf hoher Ebene geschrieben.
ja: rowPins [0]は高レベルで書き込まれ、colPins [2]は高レベルになり、。

source: colPins[0]、colPins[1]、colPins[3] get low level.
de: colPins[0] 、 colPins[1] 、 colPins[3] erhalten einen niedrigen Wert.
ja: colPins [0]、colPins [1]、colPins [3]は低レベルになる。

source: There are four states:0, 0, 1, 0; and we write \'3\' into pressed_keys.
de: Es gibt vier Zustände: 0, 0, 1, 0; und wir schreiben '3' in press_keys.
ja: 4つの状態がある：0、0、1、0。そして、pressed_keysに「3」を書き込む。

source: When rowPins[1] , rowPins[2] , rowPins[3] are written into high level, colPins[0] ~ colPins[4] get low level.
de: Wenn rowPins[1], rowPins[2], rowPins[3] auf eine hohe Ebene geschrieben werden, erhalten colPins[0] ~ colPins[4] eine niedrige Ebene.
ja: rowPins [1]、rowPins [2]、rowPins [3]が高レベルに書き込まれると、colPins [0]〜colPins [4]は低レベルになる。

source: The loop stopped, there returns pressed_keys = \'3\'.
de: Die Schleife wurde gestoppt, dort wird press_keys = '3' zurückgegeben.
ja: ループが停止し、pressed_keys = '3' が返される。

source: If you press the buttons \'1\' and \'3\', there will return pressed_keys = [\'1\',\'3\'].
de: Wenn Sie die Tasten '1' und '3' drücken, wird pressed_keys = ['1','3'] zurückgegeben.
ja: ボタン「1」と「3」を押すと、pressed_keys = ['1'、'3']が返される。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像
