Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/2.1.4_potentiometer.po
Languages: de, ja

source: 2.1.4 Potentiometer
ja: 2.1.4 ポテンショメータ

source: Introduction
de: Einführung
ja: 前書き

source: The ADC function can be used to convert analog signals to digital signals, and in this experiment, ADC0834 is used to get the function involving ADC. Here, we implement this process by using potentiometer. Potentiometer changes the physical quantity -- voltage, which is converted by the ADC function.
de: Die ADC-Funktion kann verwendet werden, um analoge Signale in digitale Signale umzuwandeln, und in diesem Experiment wird ADC0834 verwendet, um die Funktion zu erhalten, an der ADC beteiligt ist. Hier implementieren wir diesen Prozess mithilfe eines Potentiometers. Das Potentiometer ändert die physikalische Größe - Spannung, die von der ADC-Funktion umgewandelt wird.
ja: ADC機能を使用してアナログ信号をデジタル信号に変換でき、この実験では、ADC0834を使用してADCに関する関数を取得する。ここでは、ポテンショメータを使用してこのプロセスを実装する。ポテンショメーターはADC機能によって変換される物理量-電圧を変更する。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: ADC0834 is an 8-bit `successive approximation <https://cn.bing.com/dict/search?q=successive approximations&FORM=BDVSP6&mkt=zh-cn>`__ analog-to-digital converter that is equipped with an input-configurable multichannel multi-plexer and serial input/output. The serial input/output is configured to interface with standard shift registers or microprocessors.
de: ADC0834 ist ein 8-Bit-der mit einem eingangskonfigurierbaren Mehrkanal-Multiplexer und einem seriellen Ein- / Ausgang ausgestattet ist. Der serielle Ein- / Ausgang ist für die Schnittstelle mit Standardschieberegistern oder Mikroprozessoren konfiguriert.
ja: ADC0834は、8ビットの `successive approximation <https://cn.bing.com/dict/search?q=successive approximations&FORM=BDVSP6&mkt=zh-cn>`__ 本製品は、入力設定可能なマルチチャンネル・マルチプレクサとシリアル入出力を備えたアナログ・デジタル・コンバータです。シリアル入出力は、標準的なシフトレジスターやマイクロプロセッサーとのインターフェースとして構成されています。

source: **Sequence of Operation**
de: **Betriebsablauf**
ja: **操作の順序**

source: A conversion is initiated by setting CS low, which enables all logic circuits. CS must be held low for the complete conversion process. A clock input is then received from the processor. On each low-to-high transition of the clock input, the data on DI is clocked into the multiplexer address shift register. The first logic high on the input is the start bit. A 3- to 4-bit assignment word follows the start bit. On each successive low-to-high transition of the clock input, the start bit and assignment word are shifted through the shift register. When the start bit is shifted into the start location of the multiplexer register, the input channel is selected and conversion starts. The SAR Statu output (SARS) goes high to indicate that a conversion is in progress, and DI to the multiplexer shift register is disabled the duration of the conversion.
de: Eine Konvertierung wird eingeleitet, indem CS auf niedrig gesetzt wird, wodurch alle Logikschaltungen aktiviert werden. CS muss für den gesamten Konvertierungsprozess niedrig gehalten werden. Ein Takteingang wird dann vom Prozessor empfangen. Bei jedem Übergang von niedrig nach hoch des Takteingangs werden die Daten auf DI in das Multiplexer-Adressschieberegister getaktet. Die erste Logik hoch am Eingang ist das Startbit. Auf das Startbit folgt ein 3- bis 4-Bit-Zuweisungswort. Bei jedem aufeinanderfolgenden Übergang von niedrig nach hoch des Takteingangs werden das Startbit und das Zuweisungswort durch das Schieberegister verschoben. Wenn das Startbit in den Startort des Multiplexerregisters verschoben wird, wird der Eingangskanal ausgewählt und die Umwandlung beginnt. Der SAR-Statu-Ausgang (SARS) geht auf High, um anzuzeigen, dass eine Konvertierung läuft, und DI in das Multiplexer-Schieberegister ist während der Konvertierungsdauer deaktiviert.
ja: 変換はCSをlowに設定することで開始され、論理回路がすべて有効になる。変換プロセスを完了するには、CSをlowに保持する必要がある。次に、プロセッサからクロック入力を受信する。クロック入力のLowからHighへの遷移ごとに、DI上のデータがマルチプレクサーアドレスシフトレジスタに入力される。入力の最初のロジックhighはスタートビットである。スタートビットの後に、3〜4ビットの割り当てワードが続く。クロック入力のLowからHighへの遷移ごとに、スタートビットと割り当てワードがシフトレジスターにシフトする。スタートビットがマルチプレクサレジスタの開始位置にシフトされると、入力チャネルが選択され、変換が開始される。SAR Statu出力（SARS）は、変換が進行中であることを示すために高レベルになり、マルチプレクサーシフトレジスタへのDIは変換中は無効になる。

source: An interval of one clock period is automatically inserted to allow the selected multiplexed channel to settle. The data output DO comes out of the high-impedance state and provides a leading low for this one clock period of multiplexer settling time. The SAR comparator compares successive outputs from the resistive ladder with the incoming analog signal. The comparator output indicates whether the analog input is greater than or less than the resistive ladder output. As the conversion proceeds, conversion data is simultaneously output from the DO output pin, with the most significant bit (MSB) first.
de: Ein Intervall von einer Taktperiode wird automatisch eingefügt, damit sich der ausgewählte Multiplexkanal einstellen kann. Der Datenausgang DO kommt aus dem hochohmigen Zustand heraus und liefert ein führendes Tief für diese Eintaktperiode der Multiplexer-Einschwingzeit. Der SAR-Komparator vergleicht aufeinanderfolgende Ausgänge von der Widerstandsleiter mit dem eingehenden analogen Signal. Der Komparatorausgang zeigt an, ob der Analogeingang größer oder kleiner als der Widerstandsleiterausgang ist. Während der Konvertierung werden die Konvertierungsdaten gleichzeitig vom DO-Ausgangspin ausgegeben, wobei das höchstwertige Bit (MSB) zuerst angezeigt wird.
ja: 1クロック周期の間隔が自動的に挿入されて、選択されたマルチプレックスチャネルの安定化を実現する。データ出力DOは高インピーダンス状態から出て、マルチプレクサの整定時間のこの1クロック期間に先行するLowを提供する。SARコンパレータは、抵抗ラダーからの連続出力を入力アナログ信号と比較する。コンパレータ出力は、アナログ入力が抵抗ラダー出力より大きいか小さいかを示す。変換が進むと、変換データがDO出力ピンから同時に出力され、最上位ビット（MSB）が最初になる。

source: After eight clock periods, the conversion is complete and the SARS output goes low. Finally outputs the least-significant-bit-first data after the MSB-first data stream.
de: Nach acht Taktperioden ist die Konvertierung abgeschlossen und der SARS-Ausgang wird niedrig. Schließlich werden die niedrigstwertigen Bit-First-Daten nach dem MSB-First-Datenstrom ausgegeben.
ja: 8クロック周期後、変換が完了し、SARS出力がLOWになる。最後に、MSBファーストデータストリームの後に最下位ビットファーストデータを出力する。

source: **ADC0834 MUX ADDRESS CONTROL LOGIC TABLE**
ja: **ADC0834 MUXアドレス制御論理表**

source: **Potentiometer**
ja: **ポテンショメータ**

source: Potentiometer is also a resistance component with 3 terminals and its resistance value can be adjusted according to some regular variation. Potentiometer usually consists of resistor and movable brush. When the brush is moving along the resistor, there is a certain resistance or voltage output depending on the displacement.
de: Das Potentiometer ist auch eine Widerstandskomponente mit 3 Anschlüssen und sein Widerstandswert kann gemäß einigen regelmäßigen Abweichungen eingestellt werden. Das Potentiometer besteht normalerweise aus einem Widerstand und einer beweglichen Bürste. Wenn sich die Bürste entlang des Widerstands bewegt, gibt es abhängig von der Verschiebung einen bestimmten Widerstand oder eine bestimmte Spannung.
ja: ポテンショメーターも3つの端子を持つ抵抗部品であり、その抵抗値は定期的な変動に応じて調整できる。ポテンショメータは通常、抵抗器と可動ブラシで構成されている。ブラシが抵抗に沿って移動しているとき、変位に応じて特定の抵抗または電圧出力が生成される。

source: The functions of the potentiometer in the circuit are as follows:
de: Die Funktionen des Potentiometers in der Schaltung sind wie folgt:
ja: 回路内のポテンショメータの機能は次のとおりである：

source: Serving as a voltage divider
de: Dient als Spannungsteiler
ja: 分圧器として機能する

source: Potentiometer is a continuously adjustable resistor. When you adjust the shaft or sliding handle of the potentiometer, the movable contact will slide on the resistor. At this point, a voltage can be output depending on the voltage applied onto the potentiometer and the angle the movable arm has rotated to or the distance it moves.
de: Das Potentiometer ist ein stufenlos einstellbarer Widerstand. Wenn Sie die Welle oder den Schiebegriff des Potentiometers einstellen, gleitet der bewegliche Kontakt auf dem Widerstand. Zu diesem Zeitpunkt kann eine Spannung ausgegeben werden, die von der an das Potentiometer angelegten Spannung und dem Winkel abhängt, in den sich der bewegliche Arm gedreht hat, oder von der Entfernung, um die er sich bewegt.
ja: ポテンショメータは連続的に調整可能な抵抗器である。ポテンショメータのシャフトまたはスライドハンドルを調整すると、可動接点が抵抗器上でスライドする。この時点で、ポテンショメータに印加される電圧と、可動アームが回転した角度または移動距離に応じて、電圧を出力できる。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: Please place the chip by referring to the corresponding position depicted in the picture. Note that the grooves on the chip should be on the left when it is placed.
de: Bitte platzieren Sie den Chip unter Bezugnahme auf die entsprechende Position auf dem Bild. Beachten Sie, dass sich die Rillen auf dem Chip beim Platzieren links befinden sollten.
ja: 写真に示されている対応する位置を参照して、チップを配置してください。配置するときにチップの溝は左側にあることに注意してください。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 2:** Open the code file.
de: **Schritt 2:** Öffnen Sie die Kodedatei.
ja: **ステップ2：** コードファイルを開く。

source: **Step 3:** Compile the code.
de: **Schritt 3:** Kompilieren Sie die Kode.
ja: **ステップ3：** コードをコンパイルする。

source: **Step 4:** Run.
de: **Schritt 4:** Ausführen.
ja: **ステップ4：** 実行する。

source: After the code runs, rotate the knob on the potentiometer, the intensity of LED will change accordingly.
de: Nachdem der Kode ausgeführt wurde, drehen Sie die Taste am Potentiometer. Die Intensität der LED ändert sich entsprechend.
ja: コードの実行後、ポテンショメーターのノブを回すと、それに応じてLEDの輝度が変化する。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code**
ja: **コード**

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: Define CS, CLK, DIO of ADC0834, and connect them to GPIO0, GPIO1 and GPIO2 respectively. Then attach LED to GPIO3.
de: Definieren Sie CS, CLK, DIO von ADC0834 und verbinden Sie sie mit GPIO0, GPIO1 bzw. GPIO2. Schließen Sie dann die LED an GPIO3 an.
ja: ADC0834のCS、CLK、DIOを定義し、それぞれGPIO0、GPIO1、GPIO2に接続する。それから、GPIO3にLEDを取り付ける。

source: There is a function of ADC0834 to get Analog to Digital Conversion. The specific workflow is as follows:
de: Es gibt eine Funktion von ADC0834, um die Analog-Digital-Wandlung zu erhalten. Der spezifische Workflow lautet wie folgt:
ja: ADC0834 には、 アナログからデジタルへの変換を行う機能がある。特定の ワークフローは次のとおりです：

source: Set CS to low level and start enabling AD conversion.
de: Stellen Sie CS auf einen niedrigen Wert ein und aktivieren Sie die AD-Konvertierung.
ja: CSを低レベルに設定し、AD変換の有効化を開始する。

source: When the low-to-high transition of the clock input occurs at the first time, set DIO to 1 as Start bit. In the following three steps, there are 3 assignment words.
de: Wenn der Übergang von niedrig zu hoch des Takteingangs zum ersten Mal auftritt, setzen Sie DIO als Startbit auf 1. In den folgenden drei Schritten gibt es 3 Zuweisungswörter.
ja: クロック入力の lowからhighへの遷移が最初に発生したとき、 スタートビットとしてDIOを 1に設定する。次の三つのステップには 、割り当て単語が3つある 。

source: As soon as the low-to-high transition of the clock input occurs for the second time, set DIO to 1 and choose SGL mode.
de: Sobald der von niedrig zu hoch Übergang des Takteingangs zum zweiten Mal erfolgt, setzen Sie DIO auf 1 und wählen Sie den SGL-Modus.
ja: クロック入力のlowからhighへの遷移が二回発生したらすぐに、DIOを1に設定し、SGLモードを選択する。

source: Once occurs for the third time, the value of DIO is controlled by the variable **odd**.
de: Einmal zum dritten Mal auftritt, wird der Wert von DIO durch die Variable **ungerade** gesteuert.
ja: 三回目に発生すると、DIOの値は変数 **odd** によって制御される。

source: The pulse of CLK converted from low level to high level for the forth time, the value of DIO is controlled by the variable **sel**.
de: Wenn der Impuls von CLK zum vierten Mal von einem niedrigen auf einen hohen Niveau umgewandelt wird, wird der Wert von DIO durch die Variable **sel** gesteuert.
ja: CLKのパルスが4番目に低レベルから高レベルに変換されると、DIOの値は変数 **sel** によって制御される。

source: Under the condition that channel=0, sel=0, odd=0, the operational formulas concerning **sel** and **odd** are as follows:
de: Unter der Bedingung, dass Kanal = 0, sel = 0, ungerade = 0 ist, lauten die Betriebsformeln bezüglich **sel** und **ungerade** wie folgt:
ja: channel = 0、sel = 0、odd = 0の条件下では、 **sel** および **odd** に関する演算式は次のとおりである：

source: When the condition that channel=1, sel=0, odd=1 is met, please refer to the following address control logic table. Here CH1 is chosen, and the start bit is shifted into the start location of the multiplexer register and conversion starts.
de: Wenn die Bedingung erfüllt ist, dass Kanal = 1, sel = 0, ungerade = 1 ist, lesen Sie bitte die folgende Adresssteuerungslogiktabelle. Hier wird CH1 gewählt und das Startbit wird in den Startort des Multiplexerregisters verschoben und die Umwandlung beginnt.
ja: channel = 1、sel = 0、odd = 1という条件が満たされている場合、次のアドレス制御ロジックテーブルを参照してください。ここで、CH1が選択され、開始ビットがマルチプレクサレジスタの開始位置にシフトされ、変換が開始される。

source: Here, set DIO to 1 twice, please ignore it.
de: Hier setzen Sie DIO zweimal auf 1, bitte ignorieren Sie es.
ja: ここでは、DIOを1に二回設定し、それを無視してください。

source: In the first for() statement, as soon as the fifth pulse of CLK is converted from high level to low level, set DIO to input mode. Then the conversion starts and the converted value is stored in the variable dat1. After eight clock periods, the conversion is complete.
de: Stellen Sie in der ersten for() - Anweisung DIO in den Eingangsmodus, sobald der fünfte Impuls von CLK von einem hohen Niveau in einen niedrigen Niveau umgewandelt wurde. Dann beginnt die Konvertierung und der konvertierte Wert wird in der Variablen dat1 gespeichert. Nach acht Taktperioden ist die Konvertierung abgeschlossen.
ja: 最初のfor() statementで、CLKの五番目のパルスがHighレベルから低レベルに変換したらすぐに、DIOを入力モードに設定してください。それから、変換が開始され、変換された値が変数dat1に保存される。8クロック周期後、変換が完了する。

source: In the second for() statement, output the converted values via DO after other eight clock periods and store them in the variable dat2.
de: Geben Sie in der zweiten for() - Anweisung die konvertierten Werte nach weiteren acht Taktperioden über DO aus und speichern Sie sie in der Variablen dat2.
ja: 2番目最初のfor()statementdでは、他の最初の8つの後にDOを介して値を変換を出力し、変数dat2に保存する。

source: return(dat1==dat2) ? dat1 : 0 is used to compare the value gotten during the conversion and the output value. If they are equal to each other, output the converting value dat1; otherwise, output 0. Here, the workflow of ADC0834 is complete.
de: return(dat1==dat2) ? dat1 : 0 wird verwendet, um den während der Konvertierung erhaltenen Wert mit dem Ausgabewert zu vergleichen. Wenn sie gleich sind, geben Sie den Konvertierungswert dat1 aus. Andernfalls wird 0 ausgegeben. Hier ist der Workflow von ADC0834 abgeschlossen.
ja: return（dat1 == dat2）？ dat1：0は、変換中に得られた値と出力値を比較するために使用される。それらが互いに等しい場合、変換値dat1を出力する。それ以外の場合は、0を出力する。これで、ADC0834の処理が完了した。

source: The function is to use software to create a PWM pin, LedPin, then the initial pulse width is set to 0, and the period of PWM is 100 x 100us.
de: Die Funktion besteht darin, mithilfe von Software einen PWM-Pin, LedPin, zu erstellen, dann die anfängliche Impulsbreite auf 0 zu setzen und die PWM-Periode 100 x 100us zu betragen.
ja: この機能はソフトウェアを使用してPWMピンLedPinを作成し、初期パルス幅を0に設定し、PWMの周期を100 x 100usにするために使用される。

source: In the main program, read the value of channel 0 that has been connected with a potentiometer. And store the value in the variable analogVal then write it in LedPin. Now you can see the brightness of LED changing with the value of the potentiometer.
de: Lesen Sie im Hauptprogramm den Wert von Kanal 0 ab, der mit einem Potentiometer verbunden wurde. Speichern Sie den Wert in der Variablen analogVal und schreiben Sie ihn in LedPin. Jetzt können Sie sehen, wie sich die Helligkeit der LED mit dem Wert des Potentiometers ändert.
ja: メイ プログラムで、 ポテンショメーターに最初接続されているチャンネル0 0 の値 を 読み取る 。そして、最初値を最初変数analogValに保存してから LedPinに書き込む。 これで、ポテンショメータの値によってLEDの輝度が変化することを見ることができる。

source: For Python Users
de: Für Python-Benutzer
ja: Pythonユーザー向け

source: **Step 2:** Open the code file
de: **Schritt 2:** Öffnen Sie die Kodedatei
ja: **ステップ2：** コードファイルを開く

source: **Step 3:** Run.
de: **Schritt 3:** Ausführen.
ja: **ステップ3：** 実行する。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: import ADC0834 library. You can check the content of the library by calling the command nano ADC0834.py.
de: Importieren ADC0834-Bibliothek Sie können den Inhalt der Bibliothek überprüfen, indem Sie den Befehl nano ADC0834.py aufrufen.
ja: ADC0834ライブラリをインポートする。コマンドnano ADC0834.pyを呼び出して、ライブラリの内容を確認できる。

source: In setup(), define the naming method as BCM, set LedPin as PWM channel and render it a frequency of 2Khz.
de: Definieren Sie in setup() die Benennungsmethode als BCM, legen Sie LedPin als PWM-Kanal fest und rendern Sie eine Frequenz von 2Khz.
ja: setup()で、命名方法をBCMとして定義し、LedPinをPWMチャネルとして設定し、2Khzの周波数にレンダリングする。

source: **ADC0834.setup():** Initialize ADC0834, and connect the defined CS, CLK, DIO of ADC0834 to GPIO17, GPIO18 and GPIO27 respectively.
de: **ADC0834.setup():** Initialisieren Sie ADC0834 und verbinden Sie das definierte CS, CLK, DIO von ADC0834 mit GPIO17, GPIO18 bzw. GPIO27.
ja: **ADC0834.setup()：** ADC0834を初期化し、ADC0834の定義されたCS、CLK、DIOをそれぞれGPIO17、GPIO18、GPIO27に接続する。

source: The function getResult() is used to read the analog values of the four channels of ADC0834. By default, the function reads the value of CH0, and if you want to read other channels, please input the channel number in **( )**, ex. getResult(1).
de: Mit der Funktion getResult () werden die Analogwerte der vier Kanäle von ADC0834 gelesen. Standardmäßig liest die Funktion den Wert von CH0. Wenn Sie andere Kanäle lesen möchten, geben Sie bitte die Kanalnummer in **( )** ein, z. getResult(1).
ja: 関数getResult()はADC0834の4つのチャンネルのアナログ値を読み取るために使用される。デフォルトでは、関数はCH0の値を読み取り、他のチャネルを読み取りたい場合は、（ ） にチャネル番号を入力してください(例えばex. getResult(1))。

source: The function loop() first reads the value of CH0, then assign the value to the variable res. After that, call the function MAP to map the read value of potentiometer to 0~100. This step is used to control the duty cycle of LedPin. Now, you may see that the brightness of LED is changing with the value of potentiometer.
de: Die Funktion loop() liest zuerst den Wert von CH0 und weist ihn dann der Variablen res zu. Rufen Sie danach die Funktion MAP auf, um den Lesewert des Potentiometers auf 0 ~ 100 abzubilden. Dieser Schritt wird verwendet, um den Arbeitszyklus von LedPin zu steuern. Jetzt können Sie sehen, dass sich die Helligkeit der LED mit dem Wert des Potentiometers ändert.
ja: 関数loop()は最初にCH0の値を読み取り、それから変数resに値を割り当てる。その後、関数MAPを呼び出して、ポテンショメーターの読み取り値を0〜100にマッピングする。このステップはLedPinのデューティサイクルを制御するために使用される。これで、ポテンショメータの値によってLEDの輝度が変化していることがわかる。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像
