Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/2.2.5_ultrasonic_sensor_module.po
Languages: de, ja

source: 2.2.5 Ultrasonic Sensor Module
de: 2.2.5 Ultraschallsensormodul
ja: 2.2.5 超音波センサーモジュール

source: Introduction
de: Einführung
ja: 前書き

source: The ultrasonic sensor uses ultrasonic to accurately detect objects and measure distances. It sends out ultrasonic waves and converts them into electronic signals.
de: Der Ultraschallsensor verwendet Ultraschall, um Objekte genau zu erfassen und die Entfernungen zu messen. Es sendet Ultraschallwellen aus und wandelt sie in elektronische Signale um.
ja: 超音波センサーは超音波を使用して物体を正確に検出し、距離を測定する。超音波を送り出し、電子信号に変換する。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: **Ultrasonic**
de: **Ultraschall**
ja: **超音波**

source: Ultrasonic ranging module provides 2cm - 400cm non-contact measurement function, and the ranging accuracy can reach to 3mm. It can ensure that the signal is stable within 5m, and the signal is gradually weakened after 5m, till the 7m position disappears.
de: Das Ultraschall-Entfernungsmessmodul bietet eine berührungslose Messfunktion von 2cm bis 400 cm, und die Entfernungsgenauigkeit kann bis zu 3mm betragen. Es kann sicherstellen, dass das Signal innerhalb von 5m stabil ist und das Signal nach 5m allmählich geschwächt wird, bis die 7m-Position verschwindet.
ja: 超音波測距モジュールは2cm-400cmの非接触測定機能を提供し、測距精度は3mmに達することができる。信号が5m以内で安定し、5m後に信号が徐々に弱まり、7mの位置が消えることを確認できる。

source: The module includes ultrasonic transmitters, receiver and control circuit. The basic principles are as follows:
de: Das Modul enthält Ultraschallsender, Empfänger und Steuerschaltung. Die Grundprinzipien sind wie folgt:
ja: モジュールには、超音波送信機、受信機、と制御回路が含まれている。基本的な原理は次のとおりである：

source: (1)Use an IO flip-flop to process a high level signal of at least 10us.
de: (1) Verwenden Sie ein IO -Flipflop, um ein Signal mit hohem Niveau von mindestens 10us zu verarbeiten.
ja: (1)IOフリップフロップを使用して、少なくとも10usの高レベル信号を処理する。

source: (2)The module automatically sends eight 40khz and detects if there is a pulse signal return.
de: (2) Das Modul sendet automatisch acht 40kHz und erkennt, ob ein Impulssignal zurückkehrt.
ja: (2)モジュールは8つの40khzを自動的に送信し、パルス信号が戻すかどうかを検出する。

source: (3)If the signal returns, passing the high level, the high output IO duration is the time from the transmission of the ultrasonic wave to the return of it. Here, test distance = (high time x sound speed (340 m / s) / 2.
de: (3) Wenn das Signal zurückkehrt und den hohen Niveau überschreitet, ist die IO -Dauer des hohen Ausgangs die Zeit von der Übertragung der Ultraschallwelle bis zu ihrer Rückkehr. Hier Testabstand = (hohe Zeit x Schallgeschwindigkeit (340 m / s) / 2.
ja: (3)信号が戻し、高レベルを通過する場合、高出力IO持続時間は、超音波の送信から信号の戻りまでの時間である。ここでは、テスト距離=（高時間x音速（340 m/s）/ 2。

source: The timing diagram is shown below. You only need to supply a short 10us pulse for the trigger input to start the ranging, and then the module will send out an 8 cycle burst of ultrasound at 40 kHz and raise its echo. You can calculate the range through the time interval between sending trigger signal and receiving echo signal.
de: Das Zeitdiagramm ist unten dargestellt. Sie müssen nur einen kurzen 10us-Impuls für den Triggereingang liefern, um die Entfernungsmessung zu starten. Anschließend sendet das Modul einen Ultraschallstoß von 8 Zyklen bei 40 kHz und erhöht sein Echo. Sie können den Bereich über das Zeitintervall zwischen dem Senden des Triggersignals und dem Empfangen des Echosignals berechnen.
ja: タイミング図を以下に示す。トリガー入力に10usの短いパルスを供給してレンジングを開始するだけで、モジュールは40 kHzで8サイクルの超音波バーストを送信し、エコーを上げる。トリガー信号を送信してからエコー信号を受信するまでの時間間隔で範囲を計算できる。

source: Formula: us / 58 = centimeters or us / 148 =inch; or: the range = high level time \* velocity (340M/S) / 2; you are suggested to use measurement cycle over 60ms in order to prevent signal collisions of trigger signal and the echo signal.
de: Formel: us / 58 = Zentimeter oder us / 148 = Zoll; oder: der Bereich = hohe Niveauzeit \* Geschwindigkeit (340M/S) / 2; Es wird empfohlen, einen Messzyklus über 60ms zu verwenden, um Signalkollisionen des Triggersignals und des Echosignals zu vermeiden.
ja: 式：us/58 =センチメートルまたはus/148 =インチ;または：範囲=高レベル時間 \* 速度（340M/S）/ 2;トリガー信号とエコー信号の信号衝突を防ぐために、60ms以上の測定サイクルを使用することをお勧めする。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 2:** Go to the folder of the code.
de: **Schritt 2:** Gehen Sie zum Ordner der Kode.
ja: **ステップ2：** コードのフォルダーに入る。

source: **Step 3:** Compile the code.
de: **Schritt 3:** Kompilieren Sie die Kode.
ja: **ステップ3：** コードをコンパイルする。

source: **Step 4:** Run the executable file.
de: **Schritt 4:** Führen Sie die ausführbare Datei aus.
ja: **ステップ4：** EXEファイルを実行する。

source: With the code run, the ultrasonic sensor module detects the distance between the obstacle ahead and the module itself, then the distance value will be printed on the screen.
de: Wenn die Kode ausgeführt wird, erkennt das Ultraschallsensormodul den Abstand zwischen dem vorausfahrenden Hindernis und dem Modul selbst. Anschließend wird der Abstandswert auf dem Bildschirm gedruckt.
ja: コードを実行すると、超音波センサーモジュールが前方の障害物とモジュール自体の間の距離を検出し、距離値が画面に出力される。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code**
ja: **コード**

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: Initialize the ultrasonic pin; meanwhile, set Echo to input, Trig to output.
de: Initialisieren Sie den Ultraschall Pin. Stellen Sie währenddessen Echo auf Eingabe und Trig auf Ausgabe.
ja: 超音波ピンを初期化する。一方、Echoを入力、Trigを出力に設定する。

source: This function is used to realize the function of ultrasonic sensor by calculating the return detection distance.
de: Diese Funktion wird verwendet, um die Funktion des Ultraschallsensors durch Berechnung der Rückerkennungsentfernung zu realisieren.
ja: 戻り検出距離を計算することにより、この機能は超音波センサーの機能を実現するために使用される。

source: Struct timeval is a structure used to store the current time. The complete structure is as follows:
de: Strukturzeitwert ist eine Struktur, die zum Speichern der aktuellen Zeit verwendet wird. Die vollständige Struktur ist wie folgt:
ja: 構造体timevalは、現在の時刻を保存するために使用される構造体である。完全な構造は次の通りである：

source: Here, tv_sec represents the seconds that Epoch spent when creating struct timeval. Tv_usec stands for microseconds or a fraction of seconds.
de: Hier repräsentiert tv_sec die Sekunden, die Epoch beim Erstellen des Strukturzeitwerts verbracht hat. Tv_usec steht für Mikrosekunden oder einen Bruchteil von Sekunden.
ja: ここで、tv_secは、エポックがstruct timevalを作成するときに費やした秒を表す。Tv_usecはマイクロ秒または秒の一部を表す。

source: A 10us ultrasonic pulse is being sent out.
de: Ein 10us Ultraschallimpuls wird gesendet.
ja: 10usの超音波パルスが送信されている。

source: This empty loop is used to ensure that when the trigger signal is sent, there is no interfering echo signal and then get the current time.
de: Diese leere Schleife wird verwendet, um sicherzustellen, dass beim Senden des Triggersignals kein störendes Echosignal vorhanden ist, und um dann die aktuelle Zeit zu erhalten.
ja: このempty loopは、トリガー信号が送信されたときに、干渉エコー信号がないことを確認してから現在の時刻を取得するために使用される。

source: This empty loop is used to ensure that the next step is not performed until the echo signal is received and then get the current time.
de: Diese leere Schleife wird verwendet, um sicherzustellen, dass der nächste Schritt erst ausgeführt wird, wenn das Echosignal empfangen wird, und um dann die aktuelle Zeit abzurufen.
ja: このempty loopは、エコー信号が受信されて現在の時刻が取得されるまで次のステップが実行されないようにするために使用される。

source: Convert the time stored by struct timeval into a full microsecond time.
de: Konvertieren Sie die von struct timeval gespeicherte Zeit in eine volle Mikrosekundenzeit.
ja: struct timevalによって保存された時間を完全なマイクロ秒時間に変換する。

source: The distance is calculated by the time interval and the speed of sound propagation. The speed of sound in the air: 34000cm/s.
de: Die Entfernung wird durch das Zeitintervall und die Geschwindigkeit der Schallausbreitung berechnet. Die Schallgeschwindigkeit in der Luft: 34000cm/s.
ja: 距離は時間間隔と音の伝播速度によって計算される。空気中の音速：34000cm/s。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 3:** Run the executable file.
de: **Schritt 3:** 8 Führen Sie die ausführbare Datei aus.
ja: **ステップ3：** EXEファイルを実行する。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi\\python``.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、「davinci-kit-for-raspberry-pi\\python」のようなソースコードパスに移動する必要があります。

source: This is sending out a 10us ultrasonic pulse.
de: Dies sendet einen 10us Ultraschallimpuls aus.
ja: これは10usの超音波パルスを送信している。

source: Execute the interval calculation.
de: Führen Sie die Intervallberechnung durch.
ja: 間隔計算を実行する。

source: The distance is calculated in the light of time interval and the speed of sound propagation. The speed of sound in the air: 340m/s.
de: Die Entfernung wird unter Berücksichtigung des Zeitintervalls und der Schallausbreitungsgeschwindigkeit berechnet. Die Schallgeschwindigkeit in der Luft: 340 m/s.
ja: 距離は時間間隔の光と音の伝播速度によって計算される。空気中の音速：340m / s。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
