Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/2.2.6_mpu6050_module.po
Languages: de, ja

source: 2.2.6 MPU6050 Module
de: 2.2.6 MPU6050-Modul
ja: 2.2.6 MPU6050モジュール

source: Introduction
de: Einführung
ja: 前書き

source: The MPU-6050 is the world’s first and only 6-axis motion tracking devices (3-axis Gyroscope and 3-axis Accelerometer) designed for smartphones, tablets and wearable sensors that have these features, including the low power, low cost, and high performance requirements.
de: Die MPU-6050 ist das weltweit erste und einzige 6-Achsen-Bewegungsverfolgungsgerät (3-Achsen-Gyroskop und 3-Achsen-Beschleunigungsmesser), das für Smartphones, Tablets und tragbare Sensoren entwickelt wurde, die diese Funktionen aufweisen, einschließlich geringer Leistung, geringer Kosten und hoher Leistung Leistungsanforderungen.
ja: MPU-6050は、低消費電力、低コスト、高性能などの機能を備えたスマートフォン、タブレット、ウェアラブルセンサー向けに設計された世界初で唯一の6軸物標追跡装置（3軸ジャイロスコープと3軸加速度センサー）である。

source: In this experiment, use I2C to obtain the values of the three-axis acceleration sensor and three-axis gyroscope for MPU6050 and display them on the screen.
de: Verwenden Sie in diesem Experiment I2C, um die Werte des dreiachsigen Beschleunigungssensors und des dreiachsigen Gyroskops für MPU6050 zu erhalten und auf dem Bildschirm anzuzeigen.
ja: この実験では、I2Cを使用して、MPU6050の3軸加速度センサーと3軸ジャイロスコープの値を取得し、画面に表示する。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: The MPU-6050 is a 6-axis(combines 3-axis Gyroscope, 3-axis Accelerometer) motion tracking devices.
de: Die MPU-6050 ist ein 6-Achsen-Bewegungsverfolgungsgerät (kombiniert 3-Achsen-Gyroskop, 3-Achsen-Beschleunigungsmesser).
ja: MPU-6050は、6軸（3軸ジャイロスコープ、3軸加速度計を組み合わせた）物標追跡装置である。

source: Its three coordinate systems are defined as follows:
de: Seine drei Koordinatensysteme sind wie folgt definiert:
ja: その三つの座標系は次のように定義される：

source: Put MPU6050 flat on the table, assure that the face with label is upward and a dot on this surface is on the top left corner. Then the upright direction upward is the z-axis of the chip. The direction from left to right is regarded as the X-axis. Accordingly the direction from back to front is defined as the Y-axis.
de: Legen Sie die MPU6050 flach auf den Tisch und stellen Sie sicher, dass das Gesicht mit dem Etikett nach oben zeigt und sich ein Punkt auf dieser Oberfläche in der oberen linken Ecke befindet. Dann ist die aufrechte Richtung nach oben die z-Achse des Chips. Die Richtung von links nach rechts wird als X-Achse angesehen. Dementsprechend ist die Richtung von hinten nach vorne als Y-Achse definiert.
ja: MPU6050をテーブルの上に平らに置き、ラベルのある面が上向きで、この表面のドットが左上隅にあることを確認してください。次に、上向きの直立方向がチップのz軸である。左から右への方向はX軸と見なされる。したがって、後ろから前への方向はY軸として定義される。

source: **3-axis Accelerometer**
de: **3-Achsbeschleunigungsmesser**
ja: **3-軸加速度計**

source: The accelerometer works on the principle of piezo electric effect, the ability of certain materials to generate an electric charge in response to applied mechanical stress.
de: Der Beschleunigungsmesser arbeitet nach dem Prinzip des piezoelektrischen Effekts, der Fähigkeit bestimmter Materialien, als Reaktion auf angelegte mechanische Beanspruchung eine elektrische Ladung zu erzeugen.
ja: 加速度計は加えられた機械応力に応答して電荷を生成する特定の材料の能力である圧電効果の原理で動作する。

source: Here, imagine a cuboidal box, having a small ball inside it, like in the picture above. The walls of this box are made with piezo electric crystals. Whenever you tilt the box, the ball is forced to move in the direction of the inclination, due to gravity. The wall with which the ball collides, creates tiny piezo electric currents. There are totally, three pairs of opposite walls in a cuboid. Each pair corresponds to an axis in 3D space: X, Y and Z axes. Depending on the current produced from the piezo electric walls, we can determine the direction of inclination and its magnitude.
de: Stellen Sie sich hier eine quaderförmige Kisten vor, in der sich eine kleine Kugel befindet, wie im obigen Bild. Die Wände dieser Kisten bestehen aus piezoelektrischen Kristallen. Immer wenn Sie die Kisten kippen, muss sich der Ball aufgrund der Schwerkraft in Richtung der Neigung bewegen. Die Wand, mit der die Kugel kollidiert, erzeugt winzige piezoelektrische Ströme. Es gibt insgesamt drei Paare gegenüberliegender Wände in einem Quader. Jedes Paar entspricht einer Achse im 3D-Raum: X-, Y- und Z-Achse. Abhängig vom Strom, der von den piezoelektrischen Wänden erzeugt wird, können wir die Neigungsrichtung und ihre Größe bestimmen.
ja: ここで、上記の写真のように、小さなボールの中に直方体の箱があることを想像してください。この箱の壁は圧電結晶で作られている。箱を傾けると、重力によりボールが傾斜の方向に移動する。ボールが衝突する壁は、小さな圧電電流を生成する。合計で、立方体には3組の向かい合った壁がある。各ペアは、3D空間の軸：X、Y、Z軸に対応する。圧電壁から生成される電流に応じて、傾斜の方向とその大きさを決定できる。

source: We can use the MPU6050 to detect its acceleration on each coordinate axis (in the stationary desktop state, the Z-axis acceleration is 1 gravity unit, and the X and Y axes are 0). If it is tilted or in a weightless/overweight condition, the corresponding reading will change.
de: Wir können die MPU6050 verwenden, um ihre Beschleunigung auf jeder Koordinatenachse zu erfassen (im stationären Desktop-Zustand beträgt die Beschleunigung der Z-Achse 1 Schwerkrafteinheit und die X- und Y-Achse 0). Wenn es gekippt ist oder sich in einem schwerelosen / übergewichtigen Zustand befindet, ändert sich der entsprechende Wert.
ja: MPU6050を使用して、各座標軸の加速度を検出できる（静止デスクトップ状態では、Z軸の加速度は1重力単位で、X軸とY軸は0である）。傾斜または無重量/重量超過の状態にある場合、対応する測定値が変化する。

source: There are four kinds of measuring ranges that can be selected programmatically: +/-2g, +/-4g, +/-8g, and +/-16g (2g by default) corresponding to each precision. Values range from -32768 to 32767.
de: Es gibt vier Arten von Messbereichen, die programmgesteuert ausgewählt werden können: +/-2g, +/-4g, +/-8g und +/-16g (standardmäßig 2 g), die jeder Genauigkeit entsprechen. Die Werte reichen von -32768 bis 32767.
ja: プログラムで選択できる測定範囲には、+/-2g、+/-4g、+/-8g、と各精度に対応する+/-16g（デフォルトでは2g）の4種類がある。値の範囲は-32768〜32767である。

source: The reading of accelerometer is converted to an acceleration value by mapping the reading from the reading range to the measuring range.
de: Der Messwert des Beschleunigungsmessers wird in einen Beschleunigungswert umgewandelt, indem der Messwert vom Messbereich auf den Messbereich abgebildet wird.
ja: 読み取り値を測定範囲にマッピングすることにより、加速度計の読み取り値は加速度値に変換される。

source: Acceleration = (Accelerometer axis raw data / 65536 \* full scale Acceleration range) g
de: Beschleunigung = (Rohdaten der Beschleunigungsmesserachse / 65536 \* voller Beschleunigungsbereich) g
ja: 加速度=（加速度計軸の生データ / 65536 \* フルスケールの加速度範囲）g

source: Take the X-axis as an example, when Accelerometer X axis raw data is 16384 and the range is selected as +/-2g:
de: Nehmen Sie als Beispiel die X-Achse, wenn die Rohdaten der X-Achse des Beschleunigungsmessers 16384 sind und der Bereich als +/- 2 g ausgewählt ist:
ja: X軸を例として、加速度計X軸の生データは16384の場合、範囲を +/-2gに選択する：

source: **Acceleration along the X axis = (16384 / 65536 \* 4) g** **=1g**
de: **Beschleunigung entlang der X-Achse = (16384/65536 \* 4) g = 1 g**
ja: **X軸=（16384 / 65536 \* 4）g による加速度 = 1g**

source: **3-axis Gyroscope**
de: **3-Achsen-Gyroskop**
ja: **3軸ジャイロスコープ**

source: Gyroscopes work on the principle of Coriolis acceleration. Imagine that there is a fork like structure, that is in constant back and forth motion. It is held in place using piezo electric crystals. Whenever, you try to tilt this arrangement, the crystals experience a force in the direction of inclination. This is caused as a result of the inertia of the moving fork. The crystals thus produce a current in consensus with the piezo electric effect, and this current is amplified.
de: Gyroskope arbeiten nach dem Prinzip der Coriolis-Beschleunigung.. Stellen Sie sich vor, es gibt eine gabelartige Struktur, die sich ständig hin und her bewegt. Es wird mit piezoelektrischen Kristallen an Ort und Stelle gehalten. Immer wenn Sie versuchen, diese Anordnung zu kippen, erfahren die Kristalle eine Kraft in Neigungsrichtung. Dies wird durch die Trägheit der beweglichen Gabel verursacht. Die Kristalle erzeugen somit einen Strom, der mit dem piezoelektrischen Effekt übereinstimmt, und dieser Strom wird verstärkt.
ja: ジャイロスコープはコリオリ加速の原理で動作する。フォークのような構造があり、常に前後に動いていると想像してください。圧電結晶を使用して所定の位置に保持される。この配置を傾けようとするたびに、結晶は傾斜の方向に力を受ける。これは、可動フォークの慣性の結果によって引き起こされる。したがって、結晶は圧電効果と一致して電流を生成し、この電流は増幅される。

source: The Gyroscope also has four kinds of measuring ranges: +/- 250, +/- 500, +/- 1000, +/- 2000. The calculation method and Acceleration are basically consistent.
de: Das Gyroskop verfügt außerdem über vier Arten von Messbereichen: +/- 250, +/- 500, +/- 1000, +/- 2000. Die Berechnungsmethode und die Beschleunigung sind grundsätzlich konsistent.
ja: また、ジャイロスコープには、+ /-250、+ /-500、+ /-1000、+/- 2000.計算方法と加速は基本的に一貫している。

source: The formula for converting the reading into angular velocity is as follows:
de: Die Formel zum Umwandeln des Messwerts in die Winkelgeschwindigkeit lautet wie folgt:
ja: 読み取り値を角速度に変換する式は次の通りである：

source: Angular velocity = (Gyroscope axis raw data / 65536 \* full scale Gyroscope range) °/s
de: Winkelgeschwindigkeit = (Rohdaten der Gyroskopachse / 65536 \* Gyroskopbereich im vollen Maßstab) °/s
ja: 角速度=（ジャイロスコープの軸生データ/ 65536 \*フルスケールジャイロスコープの範囲）°/ s

source: The X axis, for example, the Accelerometer X axis raw data is 16384 and ranges + / - 250°/ s:
de: Die X-Achse, zum Beispiel die Rohdaten der X-Achse des Beschleunigungsmessers, ist 16384 und reicht von +/- 250 °/s:
ja: X軸、たとえば、加速度計のX軸の生データは16384で、範囲は+ /-250°/ sである：

source: **Angular velocity along the X axis = (16384 / 65536 \* 500)°/s** **=125°/s**
de: **Winkelgeschwindigkeit entlang der X-Achse = (16384/65536 \* 500) °/s** **= 125 °/s**
ja: **X軸による角速度 = (16384 / 65536 \* 500)°/s** **=125°/s**

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: MPU6050 communicates with the microcontroller through the I2C bus interface. The SDA1 and SCL1 need to be connected to the corresponding pin.
de: Die MPU6050 kommuniziert mit dem Mikrocontroller über die I2C-Busschnittstelle. Der SDA1 und der SCL1 müssen mit dem entsprechenden Pin verbunden werden.
ja: MPU6050はI2Cバスインターフェイスを介してマイクロコントローラーと通信する。SDA1とSCL1を対応するピンに接続する必要がある。

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: **Step 2**: Setup I2C (see Appendix. If you have set I2C, skip this step.)
de: **Schritt 2:** I2C einrichten (siehe Anhang. Wenn Sie I2C eingestellt haben, überspringen Sie diesen Schritt.)
ja: **ステップ2：** I2C設定（付録を参照してください。I2Cを設定している場合は、この手順をスキップしてください。）

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 3:** Go to the folder of the code.
de: **Schritt 3:** Gehen Sie zum Ordner der Kode.
ja: **ステップ3：** コードのフォルダーに入る。

source: **Step 4:** Compile the code.
de: **Schritt 4:** Kompilieren Sie der Kode.
ja: **ステップ4：** コードをコンパイルする。

source: **Step 5:** Run the executable file.
de: **Schritt 5:** Führen Sie die ausführbare Datei aus.
ja: **ステップ5：** EXEファイルを実行する。

source: With the code run, deflection angle of x axis, y axis and the acceleration, angular velocity on each axis read by MPU6050 will be printed on the screen after being calculating.
de: Wenn die Kode ausgeführt wird, werden der Ablenkwinkel der x-Achse, der y-Achse und die Beschleunigung sowie die Winkelgeschwindigkeit auf jeder von der MPU6050 gelesenen Achse nach der Berechnung auf dem Bildschirm gedruckt.
ja: コードを実行すると、MPU6050によって読み取られたx軸、y軸の転向角、加速度、各軸の角速度が計算後に画面に入力される。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code**
ja: **コード**

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: Read sensor data sent from MPU6050.
de: Lesen Sie die von der MPU6050 gesendeten Sensordaten.
ja: MPU6050から送信されたセンサーデータを読み取る。

source: We get the deflection angle on the Y-axis.
de: Wir erhalten den Ablenkwinkel auf der Y-Achse.
ja: Y軸の転向角を取得する。

source: Calculate the deflection angle of the X-axis.
de: Berechnen Sie den Ablenkwinkel der x-Achse.
ja: x軸の転向角を計算する。

source: Read the values of the x axis, y axis and z axis on the gyroscope sensor, convert the metadata to angular velocity values, and then print them.
de: Lesen Sie die Werte der x-Achse, der y-Achse und der z-Achse auf dem Gyroskopsensor, konvertieren Sie die Metadaten in Winkelgeschwindigkeitswerte und drucken Sie sie dann aus.
ja: ジャイロセンサーのx軸、y軸、z軸の値を読み取り、メタデータを角速度値に変換してから出力する。

source: Read the values of the x axis, y axis and z axis on the acceleration sensor, convert the metadata to accelerated speed values (gravity unit), and then print them.
de: Lesen Sie die Werte der x-, y- und z-Achse auf dem Beschleunigungssensor ab, konvertieren Sie die Metadaten in beschleunigte Geschwindigkeitswerte (Schwerkrafteinheit) und drucken Sie sie dann aus.
ja: 加速度センサーのx軸、y軸、z軸の値を読み取り、メタデータを加速速度値（重力単位）に変換してから出力する。

source: Print the deflection angles of the x-axis and y-axis.
de: Drucken Sie die Ablenkwinkel der x- und y-Achse.
ja: x軸とy軸の転向角をプリントする。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 4:** Run the executable file.
de: **Schritt 4:** Führen Sie die ausführbare Datei aus.
ja: **ステップ4：** EXEファイルを実行する。

source: With the code run, the angle of deflection of the x-axis and y-axis and the acceleration, angular velocity on each axis read by MPU6050 will be printed on the screen after being calculating.
de: Wenn die Kode ausgeführt wird, werden der Ablenkwinkel der x- und y-Achse sowie die Beschleunigung und Winkelgeschwindigkeit auf jeder von MPU6050 gelesenen Achse nach der Berechnung auf dem Bildschirm gedruckt.
ja: コードを実行し、x軸とy軸の転向角、加速度とMPU6050によって読み取られた各軸の角速度は、計算後に画面に入力される。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi\\python``.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、「davinci-kit-for-raspberry-pi\\python」のようなソースコードパスに移動する必要があります。

source: Calculate the deflection angle of the y-axis.
de: Berechnen Sie den Ablenkwinkel der y-Achse.
ja: y軸の転向角を計算する。

source: Calculate the deflection angle of the x-axis.
de: Berechnen Sie den Ablenkwinkel der x-Achse.
ja: x軸の転向角を計算する。

source: Read the values of the x axis, y axis and z axis on the acceleration sensor, convert the elements to accelerated speed value (gravity unit), and print them.
de: Lesen Sie die Werte der x-Achse, der y-Achse und der z-Achse auf dem Gyroskopsensor, konvertieren Sie die Metadaten in Winkelgeschwindigkeitswerte und drucken Sie sie dann aus.
ja: ジャイロセンサーのx軸、y軸、z軸の値を読み取り、メタデータを角速度値に変換してから出力する。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
