Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/2.2.3_dht-11.po
Languages: de, ja

source: Introduction
de: Einführung
ja: 前書き

source: The digital temperature and humidity sensor DHT11 is a composite sensor that contains a calibrated digital signal output of temperature and humidity. The technology of a dedicated digital modules collection and the technology of the temperature and humidity sensing are applied to ensure that the product has high reliability and excellent stability.
de: Der digitale Temperatur- und Feuchtigkeitssensor DHT11 ist ein Verbundsensor, der einen kalibrierten digitalen Signalausgang für Temperatur und Luftfeuchtigkeit enthält. Die Technologie einer speziellen Sammlung digitaler Module und die Technologie der Temperatur- und Feuchtigkeitsmessung werden angewendet, um sicherzustellen, dass das Produkt eine hohe Zuverlässigkeit und ausgezeichnete Stabilität aufweist.
ja: デジタル温湿度センサーDHT11は、温度と湿度の校正済みデジタル信号出力を含む複合センサーである。専用のデジタルモジュールコレクションの技術と温湿度検知の技術を適用して、製品の高い信頼性と優れた安定性を確保している。

source: The sensors include a wet element resistive sensor and a NTC temperature sensor and they are connected to a high performance 8-bit microcontroller.
de: Die Sensoren umfassen einen Nasselement-Widerstandssensor und einen NTC-Temperatursensor und sind mit einem Hochleistungs-8-Bit-Mikrocontroller verbunden.
ja: センサーには、湿式素子抵抗センサーとNTC温度センサーが含まれており、高性能の8ビットマイクロコントローラーに接続されている。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: The DHT11 is a basic, ultra low-cost digital temperature and humidity sensor. It uses a capacitive humidity sensor and a thermistor to measure the surrounding air, and spits out a digital signal on the data pin (no analog input pins are needed).
de: Der DHT11 ist ein grundlegender, äußerst kostengünstiger digitaler Temperatur- und Feuchtigkeitssensor. Es verwendet einen kapazitiven Feuchtigkeitssensor und einen Thermistor, um die Umgebungsluft zu messen, und spuckt ein digitales Signal auf den Datenstift aus (es werden keine analogen Eingangsstifte benötigt).
ja: DHT11は基本的な超低コストのデジタル温湿度センサーである。容量性湿度センサーとサーミスタを使用して周囲の空気を測定し、データピンにデジタル信号を出力する（アナログ入力ピンは不要）。

source: Only three pins are available: VCC, GND, and DATA. The communication process begins with the DATA line sending start signals to DHT11, and DHT11 receives the signals and returns an answer signal. Then the host receives the answer signal and begins to receive 40-bit humiture data (8-bit humidity integer + 8-bit humidity decimal + 8-bit temperature integer + 8-bit temperature decimal + 8-bit checksum). For more information, please refer to DHT11 datasheet.
de: Es sind nur drei Pins verfügbar: VCC, GND und DATA. Der Kommunikationsprozess beginnt damit, dass die DATA-Leitung Startsignale an DHT11 sendet, und DHT11 empfängt die Signale und gibt ein Antwortsignal zurück. Dann empfängt der Host das Antwortsignal und beginnt mit dem Empfang von 40-Bit-Feuchtigkeitsdaten (8-Bit-Feuchtigkeits-Ganzzahl + 8-Bit-Feuchtigkeits-Dezimalzahl + 8-Bit-Temperatur-Ganzzahl + 8-Bit-Temperatur-Dezimalzahl + 8-Bit-Prüfsumme). Weitere Informationen finden Sie im DHT11-Datenblatt.
ja: VCC、GND、とDATAの三つのピンのみが利用できる。通信プロセスは開始信号をDHT11に送信するDATAラインから始まり、DHT11は信号を受信して応答信号を返す。次に、ホストは応答信号を受信し、40ビットの湿度データ（8ビット湿度整数+ 8ビット湿度10進数+ 8ビット温度整数+ 8ビット温度10進数+ 8ビットチェックサム）の受信を開始する。詳細については、DHT11データシートを参照してください。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 2:** Go to the folder of the code.
de: **Schritt 2:** Gehen Sie zum Ordner der Kode.
ja: **ステップ2：** コードのフォルダーに入る。

source: **Step 3:** Compile the code.
de: **Schritt 3:** Kompilieren Sie die Kode.
ja: **ステップ3：** コードをコンパイルする。

source: **Step 4:** Run the executable file.
de: **Schritt 4:** Führen Sie die ausführbare Datei aus.
ja: **ステップ4：** EXEファイルを実行する。

source: After the code runs, the program will print the temperature and humidity detected by DHT11 on the computer screen.
de: Nachdem die Kode ausgeführt wurde, druckt das Programm die von DHT11 erfasste Temperatur und Luftfeuchtigkeit auf dem Computerbildschirm.
ja: コードの実行後、プログラムはDHT11によって検出された温度と湿度をコンピューター画面にプリントする。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code**
ja: **コード**

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: This function is used to realize the function of DHT11.
de: Diese Funktion wird verwendet, um die Funktion von DHT11 zu realisieren.
ja: この機能はDHT11の機能を実現するために使用される。

source: It generally can be divided into 3 parts:
de: Es kann im Allgemeinen in 3 Teile unterteilt werden:
ja: 通常、次の3つの部分に分けることができる：

source: prepare to read the pin:
de: Bereiten Sie sich darauf vor, den Stift zu lesen:
ja: ピンを読む準備ができた：

source: Its communication flow is determined by work timing.
de: Sein Kommunikationsfluss wird durch den Arbeitszeitpunkt bestimmt.
ja: その通信フローは、作業のタイミングによって決まる。

source: When DHT11 starts up, MCU will send a low level signal and then keep the signal at high level for 40us. After that, the detection of the condition of external environment will start.
de: Wenn DHT11 startet, sendet die MCU ein Signal mit niedrigem Niveau und hält das Signal dann für 40us auf hohem Niveau. Danach beginnt die Erkennung des Zustands der externen Umgebung.
ja: DHT11が起動すると、MCUは低レベルの信号を送信し、40usの間信号を高レベルに保つ。その後、外部環境の状態の検出が開始される。

source: read data:
de: Daten lesen:
ja: データの読み取り：

source: The loop stores the detected data in the dht11_dat[] array. DHT11 transmits data of 40 bits at a time. The first 16 bits are related to humidity, the middle 16 bits are related to temperature, and the last eight bits are used for verification. The data format is:
de: Die Schleife speichert die erkannten Daten im Array dht11_dat []. DHT11 überträgt Daten von jeweils 40 Bit. Die ersten 16 Bits beziehen sich auf die Luftfeuchtigkeit, die mittleren 16 Bits auf die Temperatur und die letzten acht Bits werden zur Überprüfung verwendet. Das Datenformat ist:
ja: ループは検出されたデータをdht11_dat []配列に保存する。DHT11は一度に40ビットのデータを転送する。最初の16ビットは湿度に関連し、中央の16ビットは温度に関連し、最後の8ビットは検証に使用される。データ形式は次のとおりである：

source: **8bit humidity integer data** + **8bit humidity decimal data** + **8bit temperature integer data** + **8bit temperature decimal data** + **8bit check bit**.
de: **8-Bit-Feuchtigkeits-Integer-Daten** + **8-Bit-Feuchtigkeits-Dezimaldaten** + **8-Bit-Temperatur-Integer-Daten** + **8-Bit-Temperatur-Dezimaldaten** + **8-Bit-Prüfbit**.
ja: **8ビット湿度整数データ** + **8ビット湿度10進データ** + **8ビット温度整数データ** + **8ビット温度10進データ** + **8ビットチェックビット**。

source: Print Humidity & Temperature.
de: Luftfeuchtigkeit und Temperatur drucken.
ja: 湿度と温度をプリントする。

source: When the data storage is up to 40 bits, check the validity of the data through the **check bit (dht11_dat[4])**, and then print the temperature and humidity.
de: Wenn der Datenspeicher bis zu 40 Bit beträgt, überprüfen Sie die Gültigkeit der Daten über das **Prüfbit (dht11_dat[4])** und drucken Sie dann Temperatur und Luftfeuchtigkeit aus.
ja: データストレージが最大40ビットの場合、 **check bit (dht11_dat[4])** を通じてデータの有効性をチェックし、温度と湿度をプリントする。

source: For example, if the received data is 00101011(8-bit value of humidity integer) 00000000 (8-bit value of humidity decimal) 00111100 (8-bit value of temperature integer) 00000000 (8-bit value of temperature decimal) 01100111 (check bit)
de: Wenn die empfangenen Daten beispielsweise 00101011 (8-Bit-Wert der Feuchtigkeits-Ganzzahl) 00000000 (8-Bit-Wert der Feuchtigkeits-Dezimalzahl) 00111100 (8-Bit-Wert der Temperatur-Ganzzahl) 00000000 (8-Bit-Wert der Temperatur-Dezimalzahl) 01100111 ( Bit prüfen)
ja: たとえば、受信データが00101011（湿度整数の8ビット値）00000000（湿度10進数の8ビット値）00111100（温度整数の8ビット値）00000000（温度10進数の8ビット値）01100111（チェックビット）の場合、

source: **Calculation:**
de: **Berechnung:**
ja: **計算：**

source: The final result is equal to the check bit data, then the received data is correct:
de: Das Endergebnis ist gleich mit den Prüfbitdaten, dann sind die empfangenen Daten korrekt:
ja: 最終結果はチェックビットデータに等しく、受信データは正しいである：

source: Humidity =43%，Temperature =60*C.
de: Luftfeuchtigkeit = 43% ， Temperatur = 60 * C.
ja: 湿度= 43％、温度= 60 * C。

source: If it is not equal to the check bit data, the data transmission is not normal and the data is received again.
de: Wenn es nicht gleich mit den Prüfbitdaten ist, ist die Datenübertragung nicht normal und die Daten werden erneut empfangen.
ja: チェックビットデータと等しくない場合、データ送信は正常ではなく、データが再度受信される。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 3:** Run the executable file.
de: **Schritt 3:** Führen Sie die ausführbare Datei aus.
ja: **ステップ3：** EXEファイルを実行する。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: This function is used to implement the functions of DHT11. It stores the detected data in the the_bytes[] array. DHT11 transmits data of 40 bits at a time. The first 16 bits are related to humidity, the middle 16 bits are related to temperature, and the last eight bits are used for verification. The data format is:
de: Diese Funktion wird verwendet, um die Funktionen von DHT11 zu implementieren. Es speichert die erkannten Daten im Array the_bytes[]. DHT11 überträgt Daten von jeweils 40 Bit. Die ersten 16 Bits beziehen sich auf die Luftfeuchtigkeit, die mittleren 16 Bits auf die Temperatur und die letzten acht Bits werden zur Überprüfung verwendet. Das Datenformat ist:
ja: この関数はDHT11の関数を実装するために使用される。それは検出されたデータをthe_bytes []配列に保存する。DHT11は一度に40ビットのデータを点灯する。最初の16ビットは湿度に関連し、中央の16ビットは温度に関連し、最後の8ビットは検証に使用される。データ形式は次のとおりである：

source: **8bit humidity integer data** +\ **8bit humidity decimal data** +\ **8bit temperature integer data** + **8bit temperature decimal data** + **8bit check bit**.
de: **8bit feuchtigkeits integer daten** +\ **8bit feuchtigkeits dezimaldaten** +\ **8bit temperatur integer daten** + **8bit temperatur dezimaldaten** + **8bit prüfbit**.
ja: **8ビット湿度整数データ** +\ **8ビット湿度10進データ** +\ **8ビット温度整数データ** + **8ビット温度10進データ** + **8ビットチェックビット**。

source: When the validity is detected via the check bit, the function returns two results: 1. error; 2. humidity and temperature.
de: Wenn die Gültigkeit über das Prüfbit erkannt wird, gibt die Funktion zwei Ergebnisse zurück: 1. Fehler; 2. Luftfeuchtigkeit und Temperatur.
ja: チェックビットを介して有効性が検出されると、関数は2つの結果を返す：1. エラー; 2.湿度と温度。

source: For example, if the received date is 00101011(8-bit value of humidity integer) 00000000 (8-bit value of humidity decimal) 00111100 (8-bit value of temperature integer) 00000000 (8-bit value of temperature decimal) 01100111 (check bit)
de: Wenn das Empfangsdatum beispielsweise 00101011 (8-Bit-Wert der Feuchtigkeits-Ganzzahl) 00000000 (8-Bit-Wert der Feuchtigkeits-Dezimalzahl) 00111100 (8-Bit-Wert der Temperatur-Ganzzahl) 00000000 (8-Bit-Wert der Temperatur-Dezimalzahl) 01100111 ( Bit prüfen)
ja: たとえば、受信した日付が00101011（湿度整数の8ビット値）00000000（湿度10進数の8ビット値）00111100（温度整数の8ビット値）00000000（温度10進数の8ビット値）01100111（チェックビット）の場合、

source: If the final result is equal to the check bit data, the data transmission is abnormal: return False.
de: Wenn das Endergebnis den Prüfbitdaten entspricht, ist die Datenübertragung abnormal: return False.
ja: 最終結果がチェックビットデータと等しい場合、データ送信は異常である：Falseを返す。

source: If the final result is equal to the check bit data, the received data is correct, then there will return the_bytes[0] and the_bytes[2] and output \"Humidity =43%，Temperature =60C\".
de: Wenn das Endergebnis den Prüfbitdaten entspricht, sind die empfangenen Daten korrekt, dann werden die_Bytes [0] und die_Bytes [2] zurückgegeben und "Luftfeuchtigkeit = 43% ， Temperatur = 60 ° C" ausgegeben.
ja: 最終結果がチェックビットデータと等しく、受信データは正しい場合、the_bytes [0]とthe_bytes [2]が返され、「Humidity = 43％、Temperature= 60C」が出力される。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像
