Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/2.2.7_mfrc522_rfid_module.po
Languages: de, ja

source: 2.2.7 MFRC522 RFID Module
de: 2.2.7 MFRC522 RFID-Modul
ja: 2.2.7 MFRC522 RFIDモジュール

source: Introduction
de: Einführung
ja: 前書き

source: Radio Frequency Identification (RFID) refers to technologies that use wireless communication between an object (or tag) and interrogating device (or reader) to automatically track and identify such objects.
de: Radio Frequency Identification (RFID) bezieht sich auf Technologien, die die drahtlose Kommunikation zwischen einem Objekt (oder Tag) und einem Abfragegerät (oder Lesegerät) verwenden, um solche Objekte automatisch zu verfolgen und zu identifizieren.
ja: 無線周波数識別（RFID）は、オブジェクト（またはタグ）と質問デバイス（またはリーダー）の間の無線通信を使用して、そのようなオブジェクトを自動的に追跡したり識別したりする技術を指す。

source: Some of the most common applications for this technology include retail supply chains, military supply chains, automated payment methods, baggage tracking and management, document tracking and pharmaceutical management, to name a few.
de: Einige der häufigsten Anwendungen für diese Technologie sind Lieferketten für den Einzelhandel, militärische Lieferketten, automatisierte Zahlungsmethoden, Gepäckverfolgung und -verwaltung, Dokumentenverfolgung und pharmazeutische Verwaltung, um nur einige zu nennen.
ja: この技術の最も一般的なアプリケーションには、小売サプライチェーン、軍事サプライチェーン、自動決済方法、荷物の追跡と管理、ドキュメントの追跡と医薬品管理などが含まれておる。

source: In this project, we will use RFID for reading and writing.
de: In diesem Projekt werden wir RFID zum Lesen und Schreiben verwenden.
ja: このプロジェクトでは、読み取りと書き込みにRFIDを使用する。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: Radio Frequency Identification (RFID) refers to technologies that involve using wireless communication between an object (or tag) and an interrogating device (or reader) to automatically track and identify such objects. The tag transmission range is limited to several meters from the reader. A clear line of sight between the reader and tag is not necessarily required.
de: Radio Frequency Identification (RFID) bezieht sich auf Technologien, bei denen eine drahtlose Kommunikation zwischen einem Objekt (oder Tag) und einem Abfragegerät (oder Lesegerät) verwendet wird, um solche Objekte automatisch zu verfolgen und zu identifizieren. Die Tag-Übertragungsreichweite ist auf mehrere Meter vom Lesegerät begrenzt. Eine klare Sichtlinie zwischen Lesegerät und Etikett ist nicht unbedingt erforderlich.
ja: 無線周波数識別（RFID）は、オブジェクト（またはタグ）と質問デバイス（またはリーダー）の間の無線通信を使用して、そのようなオブジェクトを自動的に追跡したり識別したりする技術を指す。タグの送信範囲はリーダーから数メートルに制限されている。リーダーとタグの間の明確な見通し線は必ずしも必要ではない。

source: Most tags contain at least one integrated circuit (IC) and an antenna. The microchip stores information and is responsible for managing the radio frequency (RF) communication with the reader. Passive tags do not have an independent energy source and depend on an external electromagnetic signal, provided by the reader, to power their operations. Active tags contain an independent energy source, such as a battery. Thus, they may have increased processing, transmission capabilities and range.
de: Die meisten Etikette enthalten mindestens eine integrierte Schaltung (IC) und eine Antenne. Der Mikrochip speichert Informationen und ist für die Verwaltung der Hochfrequenzkommunikation mit dem Lesegerät verantwortlich. Passive Etiketts haben keine unabhängige Energiequelle und sind auf ein externes elektromagnetisches Signal angewiesen, das vom Lesegerät bereitgestellt wird, um ihren Betrieb zu betreiben. Aktive Etiketts enthalten eine unabhängige Energiequelle, z. B. eine Batterie. Dann können sie eine erhöhte Verarbeitung, Übertragungsfähigkeit und Reichweite aufweisen.
ja: ほとんどのタグには、少なくとも1つの集積回路（IC）とアンテナが含まれている。マイクロチップは情報を保存し、リーダーとの無線周波数（RF）通信を管理する。パッシブタグは独立したエネルギー源を持たず、リーダーによって提供される外部電磁信号に依存して動作する。しかしアクティブタグバッテリーなどの独立したエネルギー源が含まれている。したがって、処理、送信機能と範囲が拡大している可能性がある。

source: MFRC522 is a kind of integrated read and write card chip. It is commonly used in the radio at 13.56MHz. Launched by the NXP Company, it is a low-voltage, low-cost, and small-sized non-contact card chip, a best choice of intelligent instrument and portable handheld device.
de: MFRC522 ist eine Art integrierter Lese- und Schreibkartenchip. Es wird üblicherweise im Radio bei 13,56 MHz verwendet. Es wurde von der NXP Company eingeführt und ist ein berührungsloser, kostengünstiger und kleiner Niederspannungs-Kartenchip, der die beste Wahl für intelligente Instrumente und tragbare Handheld-Geräte darstellt.
ja: MFRC522は、読み取りと書き込みカードチップの一種である。通常、13.56MHzの無線で使用される。NXP Companyによって発売された低電圧、低コスト、小型の非接触カードチップであり、インテリジェント機器と持ち転びやすい手持ちデバイスの最良の選択である。

source: The MF RC522 uses advanced modulation and demodulation concept which fully presented in all types of 13.56MHz passive contactless communication methods and protocols. In addition, it supports rapid CRYPTO1 encryption algorithm to verify MIFARE products. MFRC522 also supports MIFARE series of high-speed non-contact communication, with a two-way data transmission rate up to 424kbit/s. As a new member of the 13.56MHz highly integrated reader card series, MF RC522 is much similar to the existing MF RC500 and MF RC530 but there also exists great differences. It communicates with the host machine via the serial manner which needs less wiring. You can choose between SPI, I2C and serial UART mode (similar to RS232), which helps reduce the connection, save PCB board space (smaller size), and reduce cost.
de: Der MF RC522 verwendet ein fortschrittliches Modulations- und Demodulationskonzept, das in allen Arten von passiven kontaktlosen Kommunikationsmethoden und -protokollen mit 13,56 MHz vollständig dargestellt wird. Darüber hinaus unterstützt es den schnellen CRYPTO1-Verschlüsselungsalgorithmus zur Überprüfung von MIFARE-Produkten. Der MFRC522 unterstützt auch die berührungslose Hochgeschwindigkeitskommunikation der MIFARE-Serie mit einer bidirektionalen Datenübertragungsrate von bis zu 424 kbit/s. Als neues Mitglied der hochintegrierten 13,56-MHz-Lesekartenserie ist der MF RC522 dem vorhandenen MF RC500 und MF RC530 sehr ähnlich, es gibt jedoch auch große Unterschiede. Es kommuniziert mit dem Host-Computer über die serielle Art und Weise, die weniger Verkabelung erfordert. Sie können zwischen SPI-, I2C- und seriellem UART-Modus (ähnlich wie RS232) wählen, um die Verbindung zu reduzieren, Platz auf der Leiterplatte zu sparen (kleinere Größe) und Kosten zu senken.
ja: MF RC522はすべてのタイプの13.56MHzパッシブ非接触通信方法とプロトコルで完全に開示された高度な変調と復調の概念を使用している。さらに、MIFARE製品を検証するための高速CRYPTO1暗号化アルゴリズムをサポートしている。MFRC522は最大424kbit/sの双方向データ伝送速度で、MIFAREシリーズの高速非接触通信もサポートしている。13.56MHz高集積リーダーカードシリーズの新しいメンバーとして、MF RC522は既存のMF RC500とMF RC530と非常に似ているが、多くの違いがある。配線が少ないシリアル方式でホストマシンと通信する。SPI、I2C、とシリアルUARTモード（RS232に類似）から選択できる。これにより、接続の削減、PCBボードスペースの節約（サイズの縮小）、およびコストの削減に役立つ。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: **Step 2:** Set up SPI (refer to :ref:`Appendix` for more details. If you have set SPI, skip this step.)
de: **Schritt 2:** SPI einrichten (weitere Informationen finden Sie in :ref:`Appendix`. Wenn Sie SPI festgelegt haben, überspringen Sie diesen Schritt.)
ja: **ステップ2：** SPIを設定します（詳細については、:ref:`Appendix` を参照してください。SPIを設定している場合は、このステップをスキップしてください。）

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 3:** Go to the folder of the code.
de: **Schritt 3:** Gehen Sie zum Ordner der Kode.
ja: **ステップ3：** コードのフォルダーに入る。

source: **Step 4:** Compile the code.
de: **Schritt 4:** Kompilieren Sie die Kode.
ja: **ステップ4：** コードをコンパイルする。

source: There are two examples for you to read or write the card ID, and you can choose one of them according to your need.
de: Es gibt zwei Beispiele, mit denen Sie die Karten-ID lesen oder schreiben können. Sie können je nach Bedarf eines davon auswählen.
ja: カードIDの読み取りまたは書き込みには二つの例があり、必要に応じていずれかを選択できる。

source: **Step 5:** Run the executable file.
de: **Schritt 5:** Führen Sie die ausführbare Datei aus.
ja: **ステップ5：** EXEファイルを実行する。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: This function is used to initialize the RFID RC522 module.
de: Mit dieser Funktion wird das RFID RC522-Modul initialisiert.
ja: この関数はRFID RC522モジュールを初期化するために使用される。

source: This function is used to read the data of the card, and if the read is successful, it will return "1".
de: Diese Funktion wird zum Lesen der Daten der Karte verwendet. Wenn der Lesevorgang erfolgreich ist, wird "1" zurückgegeben.
ja: この関数はカードのデータを読み取るために使用され、読み取りが成功すると「1」が返されます。

source: This function is used to write the data of card and returns "1" if the write is successful. \*data is the information that will be written to the card.
de: Diese Funktion wird verwendet, um die Daten der Karte zu schreiben und gibt "1" zurück, wenn das Schreiben erfolgreich war. \*Daten sind die Informationen, die auf die Karte geschrieben werden.
ja: この関数はカードのデータを書き込むために使用され、書き込みが成功すると「1」を返します。 \ * dataは、カードに書き込まれる情報です。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 2:** Install the libraries.
de: **Schritt 2:** Installieren Sie die Bibliotheken.
ja: **ステップ2：** ライブラリをインストールします。

source: The ``spidev`` library helps handle interactions with the SPI and is a key component to this tutorial as we need it for the Raspberry Pi to interact with the RFID RC522.
de: Die ``spidev``-Bibliothek hilft bei der Handhabung von Interaktionen mit dem SPI und ist eine Schlüsselkomponente für dieses Tutorial, da wir sie für die Interaktion des Raspberry Pi mit dem RFID RC522 benötigen.

source: Run the following command to install ``spidev`` to your Raspberry Pi via ``pip``.
de: Führen Sie den folgenden Befehl aus, um ``spidev`` über ``pip`` auf Ihrem Raspberry Pi zu installieren.

source: Continue to install the MFRC522 library. The MFRC522 library contains two files: ``MFRC522.py`` and ``SimpleMFRC522.py``.
de: Fahren Sie mit der Installation der MFRC522-Bibliothek fort. Die MFRC522-Bibliothek enthält zwei Dateien: ``MFRC522.py`` und ``SimpleMFRC522.py``.

source: Among them ``MFRC522.py`` is the realization of RFID RC522 interface, this library handles all the heavy work of communicating with RFID through Pi's SPI interface.
de: Unter ihnen ist ``MFRC522.py`` die Realisierung der RFID-RC522-Schnittstelle, diese Bibliothek übernimmt die gesamte schwere Arbeit der Kommunikation mit RFID über die SPI-Schnittstelle von Pi.

source: ``SimpleMFRC522.py`` takes the ``MFRC522.py`` file and greatly simplifies it by allowing you to deal with only a few functions instead of a few functions.
de: ``SimpleMFRC522.py`` nimmt die Datei ``MFRC522.py`` und vereinfacht sie stark, indem es Ihnen erlaubt, nur wenige Funktionen anstelle von wenigen Funktionen zu bearbeiten.

source: **Step 4:** Run the executable file.
de: **Schritt 4:** Führen Sie die ausführbare Datei aus.
ja: **ステップ4：** EXEファイルを実行する。

source: After running ``2.2.7_read.py``, it will print the ``id`` and ``text`` of your card in the shell.
de: Nach dem Ausführen von ``2.2.7_read.py`` werden die ``id`` und der ``text`` Ihrer Karte in der Shell ausgegeben.

source: After running ``2.2.7_write.py``, you need to write a message first, press ``Enter`` to confirm, and finally put your card on the MFRC522 RFID module to finish writing.
de: Nachdem Sie ``2.2.7_write.py`` ausgeführt haben, müssen Sie zuerst eine Nachricht schreiben, zur Bestätigung ``Enter`` drücken und schließlich Ihre Karte auf das MFRC522 RFID-Modul legen, um das Schreiben abzuschließen.

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: Instantiate ``SimpleMFRC522()`` class.
de: Instanziieren Sie die Klasse ``SimpleMFRC522()``.
ja: ``SimpleMFRC522()`` クラスをインスタンス化します。

source: This function is used to read card data. If the reading is successful, id and text will be returned.
de: Diese Funktion dient zum Auslesen von Kartendaten. Wenn das Lesen erfolgreich ist, werden ID und Text zurückgegeben.
ja: この機能は、カードデータを読み取るために使用されます。 読み取りが成功すると、IDとテキストが返されます。

source: This function is used to write information to the card, press ``Enter`` key to finish writing. ``text`` is the information to be written to the card.
de: Diese Funktion wird verwendet, um Informationen auf die Karte zu schreiben. Drücken Sie die Taste ``Enter``, um das Schreiben zu beenden. ``Text`` ist die Information, die auf die Karte geschrieben werden soll.
ja: この機能は、カードに情報を書き込むために使用されます。「Enter」キーを押して書き込みを終了します。 `` text``は、カードに書き込まれる情報です。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像

source: **code**
ja: **コード**
