Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/2.2.2_thermistor.po
Languages: de, ja

source: 2.2.2 Thermistor
ja: 2.2.2 サーミスタ

source: Introduction
de: Einführung
ja: 前書き

source: Just like photoresistor can sense light, thermistor is a temperature sensitive electronic device that can be used for realizing functions of temperature control, such as making a heat alarm.
de: Genau wie der Fotowiderstand Licht erfassen kann, ist der Thermistor ein temperaturempfindliches elektronisches Gerät, mit dem Funktionen der Temperaturregelung wie z. B. ein Wärmealarm realisiert werden können.
ja: フォトレジスターが光を感知できるように、サーミスターは温度に敏感な電子デバイスであり、過熱警報装置の作成など、温度制御の機能を実現するために使用できる。

source: Components
de: Komponenten
ja: 部品

source: Principle
de: Prinzip
ja: 原理

source: A thermistor is a thermally sensitive resistor that exhibits a precise and predictable change in resistance proportional to small changes in temperature. How much its resistance will change is dependent upon its unique composition. Thermistors are the parts of a larger group of passive components. And unlike their active component counterparts, passive devices are incapable of providing power gain, or amplification to a circuit.
de: Ein Thermistor ist ein wärmeempfindlicher Widerstand, der eine präzise und vorhersagbare Widerstandsänderung proportional zu kleinen Temperaturänderungen aufweist. Wie sehr sich sein Widerstand ändert, hängt von seiner einzigartigen Zusammensetzung ab. Thermistoren sind Teile einer größeren Gruppe passiver Komponenten. Und im Gegensatz zu ihren Gegenstücken mit aktiven Komponenten können passive Geräte keine Leistungsverstärkung oder Verstärkung für eine Schaltung bereitstellen.
ja: サーミスタは、温度のわずかな変化に比例して抵抗の予測可能な変化を正確に示す熱に敏感な抵抗器である。その抵抗がどの程度変化するかは、その独自の構成に依存する。サーミスタは、受動部品の大きなグループの一部である。また、対応するアクティブコンポーネントとは異なり、パッシブデバイスは回路に電力上昇または増幅を提供できない。

source: Thermistor is a sensitive element, and it has two types: Negative Temperature Coefficient (NTC) and Positive Temperature Coefficient (PTC), also known as NTC and PTC. Its resistance varies significantly with temperature. The resistance of PTC thermistor increases with temperature ,while the condition of NTC is opposite to the former In this experiment we use NTC.
de: Der Thermistor ist ein empfindliches Element und es gibt zwei Arten: den negativen Temperaturkoeffizienten (NTC) und den positiven Temperaturkoeffizienten (PTC), auch bekannt als NTC und PTC. Sein Widerstand variiert erheblich mit der Temperatur. Der Widerstand des PTC-Thermistors steigt mit der Temperatur, während der Zustand des NTC dem ersteren entgegengesetzt ist. In diesem Experiment verwenden wir NTC.
ja: サーミスタは敏感な要素であり、負の温度係数（NTC）と正の温度係数（PTC）の2つのタイプがあり、NTCとPTCとも呼ばれる。その抵抗は温度によって大きく異なる。PTCサーミスタの抵抗は温度とともに増加するが、NTCの条件は前者とは逆である この実験では、NTCを使用する。

source: The principle is that the resistance of the NTC thermistor changes with the temperature of the outer environment. It detects the real-time temperature of the environment. When the temperature gets higher, the resistance of the thermistor decreases. Then the voltage data is converted to digital quantities by the A/D adapter. The temperature in Celsius or Fahrenheit is output via programming.
de: Das Prinzip ist, dass sich der Widerstand des NTC-Thermistors mit der Temperatur der äußeren Umgebung ändert. Es erfasst die Echtzeit-Temperatur der Umgebung. Wenn die Temperatur höher wird, nimmt der Widerstand des Thermistors ab. Anschließend werden die Spannungsdaten vom A / D-Adapter in digitale Größen umgewandelt. Die Temperatur in Celsius oder Fahrenheit wird über die Programmierung ausgegeben.
ja: その動作原理は、NTCサーミスタの抵抗が外部環境の温度とともに変化することである。環境のリアルタイム温度を検出できる。温度が高くなると、サーミスタの抵抗が減少する。次に、電圧データはA/Dアダプターによってデジタル量に変換される。摂氏または華氏の温度はプログラミングにより出力される。

source: In this experiment, a thermistor and a 10k pull-up resistor are used. Each thermistor has a normal resistance. Here it is 10k ohm, which is measured under 25 degree Celsius.
de: In diesem Experiment werden ein Thermistor und ein 10k-Pull-up-Widerstand verwendet. Jeder Thermistor hat einen normalen Widerstand. Hier sind es 10 kOhm, die unter 25 Grad Celsius gemessen werden.
ja: この実験では、サーミスタと10kプルアップ抵抗が使用される。各サーミスタには通常の抵抗がある。ここでは、25℃で測定されると、10k ohmである。

source: Here is the relation between the resistance and temperature:
de: Hier ist die Beziehung zwischen dem Widerstand und der Temperatur:
ja: 抵抗と温度の関係は次の通りである：

source: **R\ T** is the resistance of the NTC thermistor when the temperature is **T\ K**.
de: **R\ T** ist der Widerstand des NTC-Thermistors bei einer Temperatur von **T\ K**.
ja: **R\ T** は温度が **T\ K** のときのNTCサーミスタの抵抗である。

source: **R\ N** is the resistance of the NTC thermistor under the rated temperature **T\ N**. Here, the numerical value of **R\ N** is 10k.
de: **R\ N** ist der Widerstand des NTC-Thermistors unter der Nenntemperatur **T\ N**. Hier beträgt der numerische Wert von **R\ N** 10k.
ja: **R\ N** は、定格温度 **T\ N** でのNTCサーミスタの抵抗である。ここで、 **R\ N** の数値は10kである。

source: **T\ K** is a Kelvin temperature and the unit is K. Here, the numerical value of **T\ K**\ is 273.15 + degree Celsius.
de: **T\ K** ist eine Kelvin-Temperatur und die Einheit ist K. Hier beträgt der numerische Wert von **T\ K**\ 273.15 + Grad Celsius.
ja: **T\ K** はケルビン温度で、単位はKである。ここで、 **T\ K** の数値は273.15である。+摂氏度である。

source: **T\ N** is a rated Kelvin temperature; the unit is K too. Here, the numerical value of **T\ N** is 273.15+25.
de: **T\ N** ist eine Kelvin-Nenntemperatur; Das Gerät ist auch K. Hier beträgt der numerische Wert von **T\ N** 273.15+25.
ja: **T\ N** は定格ケルビン温度で、単位もKである。ここで、 **T\ N** の数値は273.15 + 25である。

source: And **B**\ (beta), the material constant of NTC thermistor, is also called heat sensitivity index with a numerical value 3950.
de: Und **B**\ (beta), die Materialkonstante des NTC-Thermistors, wird auch als Wärmeempfindlichkeitsindex mit einem numerischen Wert von 3950 bezeichnet.
ja: また、NTCサーミスタの構成要素定数である **B**\ （ベータ）は、数値3950の熱感受性指数とも呼ばれる。

source: **exp** is the abbreviation of exponential, and the base number e is a natural number and equals 2.7 approximately.
de: **exp** ist die Abkürzung für exponentiell, und die Basisnummer ist eine natürliche Nummer und entspricht ungefähr 2.7.
ja: **exp** は指数の略語で、基数eは自然数であり、約2.7に等しくなる。

source: Convert this formula T\ :sub:`K`\ =1/(ln(R\ :sub:`T`/R\ :sub:`N`)/B+1/T\ :sub:`N`) to get Kelvin temperature that minus 273.15 equals degree Celsius.
de: Konvertieren Sie diese Formel T\ :sub:`K`\ =1/(ln(R\ :sub:`T`/R\ :sub:`N`)/B+1/T\ :sub:`N`), um eine Kelvin-Temperatur zu erhalten, die minus 273.15 Grad Celsius entspricht.
ja: この式T\ :sub:`K`\ =1/(ln(R\ :sub:`T`/R\ :sub:`N`)/B+1/T\ :sub:`N`) を変換して、マイナス273.15が摂氏温度に相当するケルビン温度を取得する。

source: This relation is an empirical formula. It is accurate only when the temperature and resistance are within the effective range.
de: Diese Beziehung ist eine empirische Formel. Sie ist nur dann genau, wenn Temperatur und Widerstand im effektiven Bereich liegen.
ja: この関係は実験式である。温度と抵抗が有効範囲内にある場合にのみそれは正確である。

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: For C Language Users
de: Für Benutzer in C-Sprache
ja: C言語ユーザー向け

source: **Step 2:** Go to the folder of the code.
de: **Schritt 2:** Gehen Sie zum Ordner der Kode.
ja: **ステップ2：** コードのフォルダーに入る。

source: **Step 3:** Compile the code.
de: **Schritt 3:** Kompilieren Sie die Kode.
ja: **ステップ3：** コードをコンパイルする。

source: -lm is to load the library math. Do not omit, or you will make an error.
de: -lm dient zum Laden der Bibliotheksmathematik. Nicht weglassen, sonst wird ein Fehler gemacht.
ja: -lmはライブラリの数学をロードする。省略すると、エラーが発生する。

source: **Step 4:** Run the executable file.
de: **Schritt 4:** Führen Sie die ausführbare Datei aus.
ja: **ステップ4：** EXEファイルを実行する。

source: With the code run, the thermistor detects ambient temperature which will be printed on the screen once it finishes the program calculation.
de: Während die Kode ausgeführt wird, erkennt der Thermistor die Umgebungstemperatur, die nach Abschluss der Programmberechnung auf dem Bildschirm angezeigt wird.
ja: コードを実行すると、サーミスタは周囲温度を検出する。周囲温度は、プログラムの計算が終了すると画面に出力される。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code**
ja: **コード**

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: There is a C numerics library which declares a set of functions to compute common mathematical operations and transformations.
de: Es gibt eine C-Numerik-Bibliothek, die eine Reihe von Funktionen deklariert, um allgemeine mathematische Operationen und Transformationen zu berechnen.
ja: 一般的な数学的操作と変換を計算する一連の関数を宣言するC数値ライブラリがある。

source: This function is used to read the value of the thermistor.
de: Mit dieser Funktion wird der Wert des Thermistors abgelesen.
ja: この関数はサーミスタの値を読み取るために使用される。

source: These calculations convert the thermistor values into Celsius values.
de: Diese Berechnungen wandeln die Thermistorwerte in Celsiuswerte um.
ja: これらの計算により、サーミスタ値が摂氏値に変換される。

source: These two lines of codes are calculating the voltage distribution with the read value analog so as to get Rt (resistance of thermistor).
de: Diese beiden Kodezeilen berechnen die Spannungsverteilung mit dem analogen Lesewert, um Rt (Widerstand des Thermistors) zu erhalten.
ja: Rt（サーミスタの抵抗）を取得するために、これらの2行のコードは読み取り値アナログを使って電圧分布を計算している。

source: This code refers to plugging Rt into the formula **T\ K\ =1/(ln(R\ T/R\ N)/B+1/T\ N)** to get Kelvin temperature.
de: Diese Kode bezieht sich auf das Einstecken von Rt in die Formel **T\ K\ =1/(ln(R\ T/R\ N)/B+1/T\ N)**,um die Kelvin-Temperatur zu erhalten.
ja: このコードは、Rtを式 **T\ K\ =1/(ln(R\ T/R\ N)/B+1/T\ N)** に挿入してケルビン温度を取得することを意味する。

source: Convert Kelvin temperature into degree Celsius.
de: Wandeln Sie die Kelvin-Temperatur in Grad Celsius um.
ja: ケルビン温度を摂氏に変換する。

source: Convert degree Celsius into Fahrenheit.
de: Konvertieren Sie Grad Celsius in Fahrenheit.
ja: 摂氏を華氏に変換する。

source: Print centigrade degree, Fahrenheit degree and their units on the display.
de: Drucken Sie Celsius, Fahrenheit und ihre Einheiten auf dem Display.
ja: ディスプレイに摂氏度、華氏度とそれらの単位を表示する。

source: For Python Language Users
de: Für Python-Sprachbenutzer
ja: Python言語ユーザー向け

source: **Step 3:** Run the executable file
de: **Schritt 3:** Führen Sie die ausführbare Datei aus
ja: **ステップ3：** EXEファイルを実行する。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: There is a numerics library which declares a set of functions to compute common mathematical operations and transformations.
de: Es gibt eine numerische Bibliothek, die eine Reihe von Funktionen deklariert, um allgemeine mathematische Operationen und Transformationen zu berechnen.
ja: 一般的な数学的操作と変換を計算する一連の関数を宣言するC数値ライブラリがある。

source: These calculations convert the thermistor values into centigrade degree and Fahrenheit degree.
de: Diese Berechnungen wandeln die Thermistorwerte in Grad Celsius und Fahrenheit um.
ja: これらの計算はサーミスタの値を摂氏度と華氏度に変換する。

source: Convert Kelvin temperature into centigrade degree.
de: Wandeln Sie die Kelvin-Temperatur in Grad Celsius um.
ja: ケルビン温度を摂氏に変換する。

source: Convert the centigrade degree into Fahrenheit degree.
de: Konvertieren Sie den Celsius-Grad in Fahrenheit-Grad.
ja: 摂氏を華氏に変換する。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像
