Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/3.1.14_game_not_not.po
Languages: de, ja

source: 3.1.14 GAME– Not Not
de: 3.1.14 SPIEL - Nicht nicht
ja: 3.1.14 ゲーム–Not Not-頭脳耐久ゲーム

source: Introduction
de: Einführung
ja: 前書き

source: In this lesson, we will make an interesting game device, and we call it \"Not Not\".
de: In dieser Lektion werden wir ein interessantes Spielgerät herstellen und es "Nicht nicht" nennen.
ja: このレッスンでは、面白いゲームデバイスを作成し、「Not Not」と呼ぶ。

source: During the game, the dot matrix will refresh an arrow randomly. What you need to do is to press the button in the opposite direction of the arrow within a limited time. If the time is up, or if the button in the same direction as the arrow is pressed, you are out.
de: Während des Spiels aktualisiert die Punktmatrix einen Pfeil nach dem Zufallsprinzip. Sie müssen die Taste innerhalb einer begrenzten Zeit in die entgegengesetzte Richtung des Pfeils drücken. Wenn die Zeit abgelaufen ist oder wenn die Taste in die gleiche Richtung wie der Pfeil gedrückt wird, sind Sie raus.
ja: ゲーム中、ドットマトリックスは矢印をランダムに更新する。必要なのは、限られた時間内に矢印の反対方向にボタンを押すことである。時間になった場合、または矢印と同じ方向のボタンが押された場合、敗北すると意味する。

source: This game can really practice your reverse thinking, and now shall we have a try?
de: Dieses Spiel kann wirklich Ihr umgekehrtes Denken üben, und jetzt sollen wir es versuchen?
ja: このゲームは本当にあなたの逆思考を実践することができる。

source: Components
de: Komponenten
ja: 部品

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: T-Board Name
de: T-Karte Name
ja: Tボード名

source: physical
de: physisch

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1:** Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: **For C Language Users**
de: **Für Benutzer in C-Sprache**
ja: **C言語ユーザー向け**

source: **Step 2:** Go to the folder of code.
de: **Schritt 2:** Gehen Sie zum Code-Ordner.
ja: **ステップ2：** コードのフォルダに移動します。

source: **Step 3**: Compile.
de: **Schritt 3**: Kompilieren.
ja: **ステップ3：** コンパイルします。

source: **Step 4**: Run.
de: **Schritt 4**: Ausführen.
ja: **ステップ4：** 実行します。

source: After the program starts, a left or right arrow will be refreshed at random on the dot matrix. What you need to do is to press the button in the opposite direction of the arrow within a limited time. Then \"**√**\" appears on the dot matrix. If the time is up, or if the button in the same direction as the arrow is pressed, you are out and the dot matrix displays \"x\". You can also add 2 new buttons or replace them with Joystick keys for up, down, left and right— 4 directions to increase the difficulty of the game.
de: Nach dem Start des Programms wird ein Pfeil nach links oder rechts in der Punktmatrix nach dem Zufallsprinzip aktualisiert. Sie müssen die Taste innerhalb einer begrenzten Zeit in die entgegengesetzte Richtung des Pfeils drücken. Dann erscheint "**√**" auf der Punktmatrix. Wenn die Zeit abgelaufen ist oder wenn die Taste in die gleiche Richtung wie der Pfeil gedrückt wird, sind Sie ausgeschaltet und die Punktmatrix zeigt "x" an. Sie können auch 2 neue Schaltflächen hinzufügen oder durch Joystick-Tasten für Auf, Ab, Links und Rechts ersetzen - 4 Richtungen, um die Schwierigkeit des Spiels zu erhöhen.
ja: プログラムの開始後、左矢印または右矢印がドットマトリックス上でランダムに更新されます。 限られた時間内に矢印の反対方向にボタンを押す必要があります。 次に、「**√**」がドットマトリックスに表示されます。 時間切れの場合、または矢印と同じ方向のボタンが押された場合は、外に出て、ドットマトリックスに「x」が表示されます。 また、2つの新しいボタンを追加したり、上下左右のジョイスティックキーに置き換えたりすることもできます。4方向でゲームの難易度を上げることができます。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: Based on **1.1.6 LED Dot Matrix**, this lesson adds **2** buttons to make an amusing game device. So, if you are not very familiar with the dot matrix, please refer to :ref:`1.1.6 LED Dot Matrix`.
de: Basierend auf **1.1.6 LED Dot Matrix** fügt diese Lektion **2** Tasten hinzu, um ein amüsantes Spielgerät zu erstellen. Wenn Sie mit der Punktmatrix nicht sehr vertraut sind, lesen Sie bitte :ref:`1.1.6 LED Dot Matrix`.
ja: **1.1.6 LEDドットマトリックス** に基づいて、このレッスンでは **2** ボタンを追加して面白いゲームデバイスを作成します。 したがって、ドットマトリックスにあまり詳しくない場合は、:ref:`1.1.6 LED Dot Matrix` を参照してください。

source: The whole program process is as below:
de: Der gesamte Programmprozess ist wie folgt:
ja: プログラム全体のプロセスは次のとおりである：

source: Randomly select an arrow direction and generate **timer 1**.
de: Wählen Sie zufällig eine Pfeilrichtung und generieren Sie **Timer 1**.
ja: 矢印の方向をランダムに選択し、 **タイマー1** を生成する。

source: Display the arrow image on the dot matrix.
de: Zeigen Sie das Pfeilbild auf der Punktmatrix an.
ja: ドットマトリックスに矢印画像を表示する。

source: Judge the button input. If the button is pressed or **timer 1** reminds time’s up, judgement starts.
de: Beurteilen Sie die Tasteneingabe. Wenn die Taste gedrückt wird oder **Timer 1** daran erinnert, dass die Zeit abgelaufen ist, beginnt die Beurteilung.
ja: ボタン入力を判断する。ボタンが押されるか、 **タイマー1** が時間切れを想起させると、判定が開始される。

source: Display the image on the basis of a judging result; meanwhile, generate **timer 2**.
de: Zeigen Sie das Bild anhand eines Bewertungsergebnisses an. In der Zwischenzeit **Timer 2** generieren.
ja: 判定結果に基づいて画像を表示する。その間、 **タイマー2** を生成する。

source: Rerun **step 1** when **timer 2** reminds time’s up.
de: Führen Sie **Schritt 1** erneut aus, wenn **Timer 2** daran erinnert, dass die Zeit abgelaufen ist.
ja: **タイマー2** が時間切れを想起させると、 **ステップ1** を再実行する。

source: GLYPH structure works like a dictionary: the **word** attribute corresponds to the **key** on the dictionary; the **code** attribute corresponds to the **value**.
de: Die GLYPH-Struktur funktioniert wie ein Wörterbuch: Das **Wort** Attribut entspricht **dem Schlüssel** im Wörterbuch. Das **Kode**-Attribut entspricht dem **Wert**.
ja: GLYPH構造は辞書のように動作します。**word** 属性は辞書の **key** に対応し、**コード** 属性は **value** に対応します。

source: Here, code is used to store an array for dot matrix to display images (an 8x8 bit array).
de: Hier wird Kode verwendet, um ein Array für die Punktmatrix zum Anzeigen von Bildern zu speichern (ein 8x8-Bit-Array).
ja: ここでは、ドットマトリックスが画像を表示するための配列（8×8ビットの配列）を格納するためのコードを使用しています。

source: Here, the array **arrow** can be used to display the arrow pattern in up, down, left and right directions on the LED dot matrix.
de: Hier kann der Array-**Pfeil** verwendet werden, um das Pfeilmuster in Aufwärts-, Abwärts-, Links- und Rechtsrichtung auf der LED-Punktmatrix anzuzeigen.
ja: ここでは、配列 **arrow** を用いて、上下左右の矢印パターンをLEDドットマトリクスに表示することができます。

source: Now **down** and **up** are commented and uncomment them if needed.
de: Jetzt werden **unten** und **oben** kommentiert und bei Bedarf auskommentiert.
ja: **上下** が付注され、必要に応じて解除できる。

source: The array **check** is used to display these two images: \"**×**\" and \"**√**\".
de: Die Array-**Prüfung** wird verwendet, um diese beiden Bilder anzuzeigen: "**×**" und "**√**".
ja: 配列 **チェック** を使用して、これらの2つの画像「 **×** 」と「 **√** 」を表示する。

source: The function **lookup()** works by \"checking the dictionary\". Define a **key,** search the same words as **key** in the structure **GLYPH \*glyph** and return the corresponding information— \"**code**\" of the certain word.
de: Die Funktion **lookup()** funktioniert durch "Überprüfen des Wörterbuchs". Definieren Sie **einen Schlüssel**, suchen Sie die gleichen Wörter wie der Schlüssel in der Struktur **GLYPH * glyph** und geben Sie die entsprechenden Informationen zurück - "**kode**" des bestimmten Wortes.
ja: 関数 **lookup()** は、「checking the dictionary」によって機能する。 **キー** を定義し、構造 **GLYPH * glyph** のキーと同じ単語を検索し、対応する情報（特定の単語の「 **コード** 」）を返す。

source: The function **Strcmp()** is used to compare the identity of two character strings **glyph[i].word** and **key**; if the identity is judged, return **glyph[i].code** ( as shown).
de: Die Funktion **Strcmp()** wird verwendet, um die Identität von zwei Zeichenfolgen **glyph[i].word** und **Schlüssel** zu vergleichen; Wenn die Identität beurteilt wird, geben Sie den **glyph[i].code** zurück (wie gezeigt).
ja: 関数 **Strcmp()** は、2つの文字列 **glyph[i].単語** と **キー** の同一性を比較するために使用される。同一性が判断された場合、 **glyph[i].コード** （示すように）を返す。

source: Display the specified pattern on the dot matrix.
de: Zeigen Sie das angegebene Muster in der Punktmatrix an.
ja: 指定したパターンをドットマトリックスに表示する。

source: The function **createGlyph()** is used to randomly select a direction (the word attribute of an element in the array **arrow[]:** \"**left**\", \"**right**\"... ). Set the stage as \"PLAY\" and start a 2-second alarm clock function.
de: Mit der Funktion **createGlyph()** wird zufällig eine Richtung ausgewählt (das Wortattribut eines Elements im array **arrow[]:** "**left**", "**right**"...). Stellen Sie die Bühne auf "PLAY" und starten Sie eine 2-Sekunden-Weckerfunktion.
ja: 関数 **createGlyph()** を使用して、方向（配列 **arrow []** の要素の単語属性："**left**"、"**right**" ...）をランダムに選択する。ステージを「PLAY」に設定し、2秒の目覚まし時計機能を開始する。

source: **srand(time(NULL)):** Initializes random seeds that are from the system clock.
de: **srand(time(NULL)):** Initialisiert zufällige Seeds, die von der Systemuhr stammen.
ja: **srand（time（NULL））：** システムクロックからのランダムシードを初期化する。

source: **(sizeof(arrow)/sizeof(arrow[0]))：** Get the length of the array, the outcome is 2.
de: **(sizeof(arrow)/sizeof(arrow[0])):** Ermittelt die Länge des Arrays, das Ergebnis ist 2.
ja: **(sizeof(arrow)/sizeof(arrow[0]))：** 配列の長さを取得し、結果は2である。

source: **rand()%2:** The remainder is **0** or **1,** gotten from dividing a generated random number by 2.
de: **rand()%2:** Der Rest ist **0** oder **1**, erhalten durch Teilen einer generierten Zufallsnummer durch 2.
ja: **rand()%2:** 余りは **0** または **1** で、生成された乱数を2で割ったものである。

source: **waypoint=arrow[i].word:** The outcome should be \"right\" or \"left\".
de: **waypoint=arrow[i].word:** Das Ergebnis sollte "rechts" oder "links" sein.
ja: **waypoint=arrow[i].単語：** 結果は「right」または「left」でなければならない。

source: checkPoint() is used to check the button input; if the button is not pressed or the button in the same direction as the arrow is pressed, the outcome of the waypoint is wrong and \"**x**\" appears on the dot matrix. Otherwise, the waypoint is right and dot matrix displays \"**√**\". Here the **stage** is **CHECK,** and there can be set a 1-second alarm clock function.
de: Mit checkPoint() wird die Tasteneingabe überprüft. Wenn die Taste nicht gedrückt wird oder die Taste in die gleiche Richtung wie der Pfeil gedrückt wird, ist das Ergebnis des Wegpunkts falsch und auf der Punktmatrix wird "**x**" angezeigt. Andernfalls ist der Wegpunkt richtig und die Punktmatrix zeigt "**√**" an. Hier ist die **Stufe** **CHECK** und es kann eine 1-Sekunden-Weckerfunktion eingestellt werden.
ja: checkPoint()は、ボタンの入力をチェックするためのもので、ボタンが押されていなかったり、矢印と同じ方向のボタンが押されていたりすると、ウェイポイントの結果がおかしくなり、ドットマトリクスに「**x**」と表示されます。そうでなければ、ウェイポイントの結果は正しく、ドットマトリクスには「**√**」と表示されます。ここでは、**ステージ** が **CHECK** となり、1秒単位の目覚まし時計機能を設定することができます。

source: alarm() is also called \"alarm clock\", in which a timer can be set, and it sends **SIGALRM** signals to the progress when the defined time is up.
de: alarm() wird auch als "Wecker" bezeichnet, bei dem ein Timer eingestellt werden kann, und sendet **SIGALRM**-Signale an den Fortschritt, wenn die definierte Zeit abgelaufen ist.
ja: alarm()は「目覚まし時計」とも呼ばれ、タイマーを設定し、設定した時間が経過すると **SIGALRM** 信号をプログレスに送信します。

source: getKey() reads the states of the these two buttons; if the right button is pressed, the parameter of the function checkPoint() is **right** and if the left button is pressed, the parameter is **left**.
de: getKey() liest die Zustände dieser beiden Schaltflächen; Wenn die rechte Taste gedrückt wird, ist der Parameter der Funktion checkPoint() **rechts** und wenn die **linke** Taste gedrückt wird, bleibt der Parameter links.
ja: getKey()は、これら2つのボタンの状態を読み取ります。右ボタンが押されている場合、関数checkPoint()のパラメータは **right** 、左ボタンが押されている場合、パラメータは **left** となります。

source: Previously, timer() was called when set as the alarm() time’s up. Then under the \"PLAY\" mode, checkPoint() is to be called to judge the outcome. If the program is set to \"CHECK\" mode, the function createGlyph() should be called to select new patterns.
de: Zuvor wurde timer() aufgerufen, wenn die Alarmzeit abgelaufen ist. Im Modus "PLAY" soll dann checkPoint() aufgerufen werden, um das Ergebnis zu beurteilen. Wenn das Programm auf den Modus "CHECK" eingestellt ist, sollte die Funktion createGlyph() aufgerufen werden, um neue Muster auszuwählen.
ja: これまでは、アラーム()が鳴ったときにtimer()が呼ばれていました。そして、「PLAY」モードでは、結果を判断するためにcheckPoint()を呼び出すことになっています。「CHECK」モードの場合は、createGlyph()を呼び出してパターンを選択します。

source: The working of the function signal(SIGALRM,timer): calling the timer() function when a SIGALRM signal (generated by the alarm clock function alarm()) is received.
de: Die Funktionsweise des Funktionssignals (SIGALRM, Timer): Aufruf der Funktion timer(), wenn ein SIGALRM-Signal (vom Weckerfunktionsalarm() erzeugt) empfangen wird.
ja: 関数signal（SIGALRM、timer）の動作：（目覚まし時計関数alarm()によって生成された）SIGALRM信号を受信したときに関数timer()を呼び出す。

source: When the program starts, call createGlyph() one time at first and then start the loop.
de: Wenn das Programm startet, rufen Sie zunächst einmal createGlyph() auf und starten Sie dann die Schleife.
ja: プログラムが起動したら、最初に1回だけcreateGlyph()を呼び出してから、ループを開始します。

source: In the loop: under PLAY mode, the dot matrix displays arrow patterns and check the button state; if under CHECK mode, what is displayed is \"**x**\" or \"**√**\".
de: In der Schleife: Im PLAY-Modus zeigt die Punktmatrix Pfeilmuster an und überprüft den Schaltflächenstatus. Im CHECK-Modus wird "**x**" oder "**√**" angezeigt.
ja: ループ内：PLAYモードでは、ドットマトリックスに矢印パターンが表示され、ボタンの状態が確認されます。 チェックモードの場合、表示されるのは「**x**」または「**√**」です。

source: **For Python Language Users**
de: **Für Python-Sprachbenutzer**
ja: **Python言語ユーザー向け**

source: **Step 2**: Get into the folder of code.
de: **Schritt 2**: Rufen Sie den Code-Ordner auf.
ja: **ステップ2**：コードのフォルダーに入ります。

source: **Step 3**: Run.
de: **Schritt 3**: Ausführen.
ja: **ステップ3**：実行します。

source: After starting the program, on the dot matrix appears an arrow pointing to the right or the left. What you need to do is to press the button in the opposite direction of the arrow within a limited time. Then \"**√**\" appears on the dot matrix. If the time is up, or if the button in the same direction as the arrow is pressed, you are out and the dot matrix displays \"x\". You can also add 2 new buttons or replace them with Joystick keys for up, down, left and right— 4 directions to increase the difficulty of the game.
de: Nach dem Starten des Programms erscheint auf der Punktmatrix ein Pfeil nach rechts oder links. Sie müssen die Taste innerhalb einer begrenzten Zeit in die entgegengesetzte Richtung des Pfeils drücken. Dann erscheint "**√**" auf der Punktmatrix. Wenn die Zeit abgelaufen ist oder wenn die Taste in die gleiche Richtung wie der Pfeil gedrückt wird, sind Sie ausgeschaltet und die Punktmatrix zeigt "x" an. Sie können auch 2 neue Schaltflächen hinzufügen oder durch Joystick-Tasten für Auf, Ab, Links und Rechts ersetzen - 4 Richtungen, um die Schwierigkeit des Spiels zu erhöhen.
ja: プログラムを起動すると、ドットマトリックス上に右または左を指す矢印が表示されます。 あなたがする必要があるのは、限られた時間内に矢印の反対方向にボタンを押すことです。 次に、「**√**」がドットマトリックスに表示されます。 時間切れの場合、または矢印と同じ方向のボタンが押された場合は、外に出て、ドットマトリックスに「x」が表示されます。 また、2つの新しいボタンを追加したり、上下左右のジョイスティックキーに置き換えたりすることもできます。4方向でゲームの難易度を上げることができます。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: Display the corresponding arrow image on the dot matrix.
de: Zeigen Sie das entsprechende Pfeilbild in der Punktmatrix an.
ja: ドットマトリックスに対応する矢印画像を表示する。

source: Main() contains the whole running process.
de: Main() enthält den gesamten laufenden Prozess.
ja: Main()には実行中のプロセス全体が含まれている。

source: Here, the **dictionary** arrow can be used to display the arrow pattern in up, down, left and right directions on the LED dot matrix.
de: Hier kann der **Wörterbuch**-Pfeil verwendet werden, um das Pfeilmuster nach oben, unten, links und rechts auf der LED-Punktmatrix anzuzeigen.
ja: ここで、**辞書** 矢印を使用して、LEDドットマトリックス上で上、下、左、右の方向に矢印パターンを表示できます。

source: Now down and up are commented and uncomment them if needed.
de: Jetzt werden unten und oben kommentiert und bei Bedarf auskommentiert.
ja: 上下が付注され、必要に応じて解除できる。

source: The **dictionary** check is used to display these two images: \"**×**\" and \"**√**\".
de: Die **Wörterbuch** Prüfung wird verwendet, um diese beiden Bilder anzuzeigen: "**×**" und "**√**".
ja: **辞書** チェックは、「**×**」と「**√**」の2つの画像を表示するために使用されます。

source: **arrow.keys():** Select the keys \"right\"and \"left\" in the arrow array.
de: **arrow.keys():** Wählen Sie die Tasten "rechts" und "links" im Pfeilarray.
ja: **arrow.keys():** 矢印配列のキー「右」と「左」を選択する。

source: **list(arrow.keys()):** Combine these keys into an array.
de: **list(arrow.keys()):** Kombinieren Sie diese Schlüssel zu einem Array.
ja: 、**list(arrow.keys()）：** これらのキーを配列に結合する。

source: **random.choice(list(arrow.keys())):** Randomly select an element in the array.
de: **random.choice(list(arrow.keys())):** Wählen Sie zufällig ein Element im Array aus.
ja: **random.choice(list(arrow.keys()））：** 配列内の要素をランダムに選択する。

source: So, The outcome of **waypoint=random.choice(list(arrow.keys()))** should be \"right\" or \"left\".
de: Das Ergebnis von **waypoint=random.choice(list(arrow.keys()))** sollte also "rechts" oder "links" sein.
ja: したがって、**waypoint = random.choice（list（arrow.keys()））** の結果は「右」または「左」になります。

source: checkPoint() is to detect the current state of button input:
de: Mit checkPoint() wird der aktuelle Status der Tasteneingabe ermittelt:
ja: checkPoint()はボタン入力の現在の状態を検出する：

source: If no button is pressed or the button in the same direction as the the arrow is pressed, the assigned value of the **``waypoint``** is **``wrong``** and there displays ``x`` on the dot matrix.
de: Wenn keine Taste gedrückt wird oder die Taste in die gleiche Richtung wie der Pfeil gedrückt wird, ist der zugewiesene Wert des **``Wegpunkt``** **``falsch``** und zeigt ``x`` auf der Punktmatrix.
ja: ボタンが押されていないか、矢印と同じ方向のボタンが押されている場合、 **``ウェイポイント``** の割り当てられた値は **``間違っています``** 、ドットマトリックスに ``x`` が表示されます。

source: Otherwise, the waypoint is right and \"**√**\" appears.
de: Andernfalls ist der Wegpunkt richtig und "**√**" wird angezeigt.
ja: それ以外の場合、ウェイポイントは正しく、「 **√** 」が表示される。

source: Now the stage is **CHECK** and start a 1-second timer **timerCheck** to call the function creatGlyph() in a second.
de: Jetzt ist die Stufe **CHECK** und startet einen 1-Sekunden-Timer **timerCheck**, um die Funktion creatGlyph () in einer Sekunde aufzurufen.
ja: これで、ステージは **CHECK** になり、1秒のタイマー **timerCheck** を開始して、関数creatGlyph()を1秒で呼び出します。

source: In the function timeout(), set the parameter of checkPoint() as \"**empty**\".
de: Setzen Sie im Funktionszeitlimit() den Parameter von checkPoint() auf "**leer**".
ja: 関数timeout()で、checkPoint()のパラメーターを「**empty**」に設定します。

source: getKey() reads the state of these two buttons, and if the right button is pressed, the parameter of checkPoint() is **right**; if the left button is pressed, the parameter is **left**.
de: getKey() liest den Status dieser beiden Schaltflächen, und wenn die rechte Schaltfläche gedrückt wird, ist der Parameter von checkPoint() **richtig**. Wenn die **linke** Taste gedrückt wird, bleibt der Parameter übrig.
ja: getKey()は、これら2つのボタンの状態を読み取り、右ボタンが押された場合、checkPoint()のパラメーターは **右** です。 左ボタンが押された場合、パラメータは **左** です。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像

source: **Code**
ja: **コード**
