Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/3.1.10_alarm_bell.po
Languages: de, ja

source: 3.1.10 Alarm Bell
de: 3.1.10 Alarmglocke
ja: 3.1.10 警報ベル

source: Introduction
de: Einführung
ja: 前書き

source: In this course, we will make a manual alarm device. You can replace the toggle switch with a thermistor or a photosensitive sensor to make a temperature alarm or a light alarm.
de: In diesem Kurs erstellen wir ein manuelles Alarmgerät. Sie können den Kippschalter durch einen Thermistor oder einen lichtempfindlichen Sensor ersetzen, um einen Temperaturalarm oder einen Lichtalarm auszulösen.
ja: このコースでは、手動警報装置を作成する。トグルスイッチをサーミスタまたは感光センサーに交換して、温度警報または光警報を作成できる。

source: Components
de: Komponenten
ja: 部品

source: Schematic Diagram
de: Schematische Darstellung
ja: 回路図

source: T-Board Name
de: T-Karte Name
ja: Tボード名

source: physical
de: physisch

source: Experimental Procedures
de: Experimentelle Verfahren
ja: 実験手順

source: **Step 1**: Build the circuit.
de: **Schritt 1:** Bauen Sie die Schaltung auf.
ja: **ステップ1：** 回路を作る。

source: **For C Language Users**
de: **Für Benutzer in C-Sprache**
ja: **C言語ユーザー向け**

source: **Step 2**: Change directory.
de: **Schritt 2:** Verzeichnis wechseln.
ja: **ステップ2：** ディレクトリを変更する。

source: **Step 3**: Compile.
de: **Schritt 3:** Kompilieren.
ja: **ステップ3：** コンパイルする。

source: **Step 4**: Run.
de: **Schritt 4:** Ausführen.
ja: **ステップ4：** 実行。

source: After the program starts, the toggle switch will be toggled to the right, and the buzzer will give out alarm sounds. At the same time, the red and green LEDs will flash at a certain frequency.
de: Nach dem Start des Programms wird der Kippschalter nach rechts umgeschaltet und der Summer gibt Alarmtöne aus. Gleichzeitig blinken die roten und grünen LEDs mit einer bestimmten Frequenz.
ja: プログラムが起動すると、トグルスイッチが右に切り替わり、ブザーが警報音を出す。同時に、特定の周波数で赤と緑のLEDが点滅する。

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`
ja: 実行後に機能しない場合は、:ref:`C code is not working?` を参照してください。

source: **Code Explanation**
de: **Code Erklärung**
ja: **コードの説明**

source: In this code, you'll use a new library, pthread.h, which is a set of common thread libraries and can realize multithreading. We add the **-lpthread** parameter at compile time for the independent working of the LED and the buzzer.
de: In dieser Kode verwenden Sie eine neue Bibliothek, pthread.h, die aus einer Reihe allgemeiner Thread-Bibliotheken besteht und Multithreading realisieren kann. Wir fügen den Parameter **-lpthread** zur Kompilierungszeit hinzu, damit die LED und der Summer unabhängig voneinander arbeiten können.
ja: このコードでは、新しいライブラリpthread.hを使用する。これは、一般的なスレッドライブラリのセットであり、マルチスレッドを実現できる。コンパイル時に **-lpthread** パラメーターを追加して、LEDとブザーを独立して動作させる。

source: The function ledWork() helps to set the working state of these 2 LEDs: it keeps the green LED lighting up for 0.5s and then turns off; similarly, keeps the red LED lighting up for 0.5s and then turns off.
de: Die Funktion ledWork() hilft beim Einstellen des Arbeitszustands dieser beiden LEDs: Sie leuchtet die grüne LED 0,5 Sekunden lang auf und erlischt dann. In ähnlicher Weise leuchtet die rote LED 0,5 Sekunden lang auf und erlischt dann.
ja: 関数ledWork()は、これら2つのLEDの動作状態を設定するために役立つ：緑色のLEDを0.5秒間点灯させた後、消灯する。同様に、赤いLEDを0.5秒間点灯させてから消灯する。

source: The function buzzWork() is used to set the working state of the buzzer. Here we set the frequency as between 130 and 800, to accumulate or decay at an interval of 20.
de: Mit der Funktion summWork() wird der Arbeitszustand des Summers eingestellt. Hier stellen wir die Frequenz zwischen 130 und 800 ein, um sie in einem Intervall von 20 zu akkumulieren oder abzunehmen.
ja: 関数buzzWork()は、ブザーの動作状態を設定するために使用される。ここでは、周波数を130〜800に設定し、20の間隔で累積・減衰する。

source: In the function on():
de: In der Funktion on ():
ja: 関数on()で：

source: Define the mark \"flag=1\", indicating the ending of the control thread.
de: Definieren Sie die Markierung "flag = 1", die das Ende des Kontrollthreads angibt.
ja: 制御スレッドの終了を示すマーク「flag = 1」を定義する。

source: Create a software-controlled tone pin **BeepPin**.
de: Erstellen Sie einen softwaregesteuerten Ton-Pin **BeepPin**.
ja: ソフトウェア制御のトーンピン **BeepPin** を作成する。

source: Create two separate threads so that the LED and the buzzer can work at the same time.
de: Erstellen Sie zwei separate Threads, damit die LED und der Summer gleichzeitig arbeiten können.
ja: LEDとブザーが同時に動作できるように、二つの個別のスレッドを作成する。

source: **pthread_t tLed:** Declare a thread **tLed**.
de: **pthread_t tLed:** Deklariert einen Thread **tLed**.
ja: **pthread_t tLed：** スレッド **tLed** を宣言する。

source: **pthread_create(&tLed,NULL,ledWork,NULL)：** Create the thread and its prototype is as follows:
de: **pthread_create(&tLed,NULL,ledWork,NULL):** Erstellen Sie den Thread und sein Prototyp lautet wie folgt:
ja: **pthread_create（＆tLed、NULL、ledWork、NULL）：** スレッドを作成し、そのプロトタイプは次の通りである：

source: int pthread_create(pthread_t \*restrict tidp,const pthread_attr_t \*restrict_attr,void*（*start_rtn)(void*),void \*restrict arg);
de: int pthread_create(pthread_t \*restrict tidp,const pthread_attr_t \*restrict_attr,void*（*start_rtn)(void*),void \*restrict arg);einschränken);

source: **Return the Value**
de: **Geben Sie den Wert zurück**
ja: **値を返す**

source: If successful, return \"**0**\"；otherwise, return the **fall number** \"**-1**\".
de: Wenn dies erfolgreich ist, geben Sie "**0**" zurück. Andernfalls geben Sie **die Fallzahl** "**-1**" zurück.
ja: 成功した場合は「**0**」を返し、それ以外の場合は落下数「**-1**」を返します。

source: The first parameter is a pointer to the thread identifier.
de: Der erste Parameter ist ein Zeiger auf die Thread-ID.
ja: 最初のパラメーターは、スレッドIDへのポインターです。

source: The second one is used to set the thread attribute.
de: Der zweite wird verwendet, um das Thread-Attribut festzulegen.
ja: 2つ目は、スレッド属性を設定するために使用されます。

source: The third one is the starting address of the thread running function.
de: Die dritte ist die Startadresse der Thread-Running-Funktion.
ja: 3番目は、スレッド実行関数の開始アドレスです。

source: The last one is the one that runs the function.
de: Der letzte ist derjenige, der die Funktion ausführt.
ja: 最後のものは、関数を実行するものです。

source: The function Off() defines \"flag=0\" so as to exit the threads **ledWork** and **BuzzWork** and then turn off the buzzer and the LED.
de: Die Funktion Off() definiert "flag=0", um die Threads **ledWork** und **BuzzWork** zu verlassen und dann den Summer und die LED auszuschalten.
ja: スレッド **ledWork** と **BuzzWork** を終了するために、関数Off()は「flag = 0」を定義しそして、ブザーとLEDをオフにする。

source: Main() contains the whole process of the program: firstly read the value of the slide switch; if the toggle switch is toggled to the right (the reading is 1), the function on() is called, the buzzer is driven to emit sounds and the the red and the green LEDs blink. Otherwise, the buzzer and the LED don’t work.
de: Main() enthält den gesamten Prozess des Programms: Lesen Sie zuerst den Wert des Schiebeschalters; Wenn der Kippschalter nach rechts umgeschaltet ist (der Messwert ist 1), wird die Funktion on () aufgerufen, der Summer wird zur Ausgabe von Tönen angesteuert und die rote und die grüne LED blinken. Andernfalls funktionieren der Summer und die LED nicht.
ja: Main()には、プログラムのプロセス全体が含まれている：まず、スライドスイッチの値を読み取る。トグルスイッチが右に切り替えられた場合（読み取り値が1）、関数on()が呼び出され、ブザーが駆動されて音が鳴り、赤と緑のLEDが点滅する。そうしないと、ブザーとLEDが機能しない。

source: **For Python Language Users**
de: **Für Python-Sprachbenutzer**
ja: **Python言語ユーザー向け**

source: **Step 2:** Change directory.
de: **Schritt 2:** Verzeichnis wechseln.
ja: **ステップ2：** ディレクトリを変更する。

source: **Step 3:** Run.
de: **Schritt 3:** Ausführen.
ja: **ステップ3：** 実行する。

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/ Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.
ja: 以下のコードを **変更/リセット/コピー/実行/停止** できます。 ただし、その前に、 ``davinci-kit-for-raspberry-pi/python`` のようなソースコードパスに移動する必要があります。

source: Here, we import the **Threading** module and it allows you to do multiple things at once, while normal programs can only execute code from top to bottom. With **Threading** modules, the LED and the buzzer can work separately.
de: Hier importieren wir das **Threading**-Modul und es ermöglicht Ihnen, mehrere Dinge gleichzeitig zu tun, während normale Programme Kode nur von oben nach unten ausführen können. Bei **Threading**-Modulen können die LED und der Summer separat arbeiten.
ja: ここでは、 **Threading** モジュールをインポートし、複数のことを一度に行えるようにするが、通常のプログラムはコードを上から下にしか実行できない。 **Threading** モジュールを使用すると、LEDとブザーを個別に動作させることができる。

source: Start the Buzz, and set the duty cycle to 50%.
de: Starten Sie den Buzz und stellen Sie den Arbeitszyklus auf 50% ein.
ja: バズを開始し、デューティサイクルを50％に設定する。

source: Create **2** separate threads so that the LED and the buzzer can work at the same time.
de: Erstellen Sie **2** separate Threads, damit die LED und der Summer gleichzeitig arbeiten können.
ja: LEDとブザ **ー** が同時に動作できるように、二つの個別のスレッドを作成する。

source: tBuzz = threading.Thread(target=buzzerWork) **:** Create the thread and its prototype is as follows:
de: tBuzz = threading.Thread (target = buzzerWork) **:** Erstellen Sie den Thread und sein Prototyp lautet wie folgt:
ja: tBuzz = threading.Thread（target = buzzerWork） **：** スレッドを作成すると、そのプロトタイプは以下の通りである：

source: Among the construction methods, the principal parameter is **target**, we need to assign a callable object (here are the functions **ledWork** and **BuzzWork** ) to **target**.
de: Unter den Konstruktionsmethoden ist der Hauptparameter **target**. Wir müssen dem Ziel ein aufrufbares Objekt zuweisen (hier sind die Funktionen **ledWork** und **BuzzWork**).
ja: 構築メソッドの中で、主要なパラメーターは **ターゲット** であり、呼び出し可能なオブジェクト（ここでは関数 **ledWork** と **BuzzWork** ）を **ターゲット** に割り当てる必要がある。

source: Next **start()** is called to start the thread object, ex., tBuzz.start() is used to start the newly installed tBuzz thread.
de: Next **start()** wird aufgerufen, um das Thread-Objekt zu starten. Beispiel: tBuzz.start () wird verwendet, um den neu installierten tBuzz-Thread zu starten.
ja: 次に、スレッドオブジェクトを開始するために **start()** が呼び出される。たとえば、tBuzz.start()は、新しくインストールされたtBuzzスレッドを開始するために使用される。

source: Phenomenon Picture
de: Phänomen Bild
ja: 現象画像

source: **Parameter**
ja: **パラメータ**

source: **Code**
ja: **コード**
