Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/3.1.11_morse_code_generator.po
Languages: de

source: 3.1.11 Morse Code Generator
de: 3.1.11 Morsekode-Generator

source: Introduction
de: Einführung

source: In this lesson, we'll make a Morse code generator, where you type in a series of English letters in the Raspberry Pi to make it appear as Morse code.
de: In dieser Lektion erstellen wir einen Morsekode-Generator, in den Sie eine Reihe englischer Buchstaben in den Raspberry Pi eingeben, damit er als Morsekode angezeigt wird.

source: Components
de: Komponenten

source: Schematic Diagram
de: Schematische Darstellung

source: T-Board Name
de: T-Karte Name

source: physical
de: physisch

source: Experimental Procedures
de: Experimentelle Verfahren

source: **Step 1:** Build the circuit. (Pay attention to poles of the buzzer: The one with + label is the positive pole and the other is the negative.)
de: **Schritt 1:** Bauen Sie die Schaltung auf. (Achten Sie auf die Pole des Summers: Der mit dem + Etikett ist der positive Pol und der andere der negative.)

source: **For C Language Users**
de: **Für Benutzer in C-Sprache**

source: **Step 2**: Open the code file.
de: **Schritt 2:** Öffnen Sie die Kodedatei.

source: **Step 3**: Compile the code.
de: **Schritt 3:** Kompilieren Sie den Kode.

source: **Step 4**: Run the executable file above.
de: **Schritt 4:** Führen Sie die obige ausführbare Datei aus.

source: After the program runs, type a series of characters, and the buzzer and the LED will send the corresponding Morse code signals.
de: Geben Sie nach dem Ausführen des Programms eine Reihe von Zeichen ein, und der Summer und die LED senden die entsprechenden Morsekodesignale.

source: If it does not work after running, please refer to :ref:`C code is not working?`
de: Wenn es nach dem Ausführen nicht funktioniert, lesen Sie bitte :ref:`C code is not working?`

source: **Code Explanation**
de: **Code Erklärung**

source: This structure MORSE is the dictionary of the Morse code, containing characters A-Z, numbers 0-9 and marks \"?\" \"/\" \":\" \",\" \".\" \";\" \"!\" \"@\" .
de: Diese Struktur MORSE ist das Wörterbuch des Morsecodes und enthält die Zeichen A-Z, die Zahlen 0-9 und die Zeichen "?" "/" ":" " " "," "." ";" "!" "@".

source: The function **lookup()** works by \"checking the dictionary\". Define a **key,** search the same words as **key** in the structure **morseDict** and return the corresponding information— \"**code**\" of the certain word.
de: Die Funktion **lookup()** funktioniert durch "Überprüfen des Wörterbuchs". Definieren Sie **einen Schlüssel**, suchen Sie die gleichen Wörter wie **den Schlüssel** in der Struktur **morseDict** und geben Sie die entsprechenden Informationen zurück - "**kode**" des bestimmten Wortes.

source: Create a function on() to start the buzzer and the LED.
de: Erstellen Sie eine Funktion auf(), um den Summer und die LED zu starten.

source: The function off() turns off the buzzer and the LED.
de: Die Funktion off () schaltet den Summer und die LED aus.

source: Define a function beep() to make the buzzer and the LED emit sounds and blink in a certain interval of **dt**.
de: Definieren Sie einen Funktionston (), damit der Summer und die LED in einem bestimmten Intervall von **dt** ertönen und blinken.

source: The function morsecode() is used to process the Morse code of input characters by making the \"1\" of the code keep emitting sounds or lights and the \"0\"shortly emit sounds or lights, ex., input \"SOS\", and there will be a signal containing three short three long and then three short segments \" · · · - - - · · · \".
de: Die Funktion morsecode() wird verwendet, um den Morsecode von Eingabezeichen zu verarbeiten, indem die "1" der Kode weiterhin Töne oder Lichter aussendet und die "0" in Kürze Töne oder Lichter aussendet, z. B. "SOS" eingibt und dort wird ein Signal sein, das drei kurze, drei lange und dann drei kurze Segmente "· · · - - - · · ·" enthält.

source: Before coding, you need to unify the letters into capital letters.
de: Vor dem Codieren müssen Sie die Buchstaben in Großbuchstaben vereinheitlichen.

source: When you type the relevant characters with the keyboard, code=strupr(code) will convert the input letters to their capital form.
de: Wenn Sie die relevanten Zeichen mit der Tastatur eingeben, konvertiert code = strupr (code) die Eingabebuchstaben in ihre Großbuchstaben.

source: Printf() then prints the clear text on the computer screen, and the morsecod() function causes the buzzer and the LED to emit Morse code.
de: Printf() druckt dann den Klartext auf dem Computerbildschirm, und die Funktion morsecod() bewirkt, dass der Summer und die LED Morsecode ausgeben.

source: Note that the length of the input character mustn’t exceed the **length** (can be revised).
de: Beachten Sie, die Länge des Eingabezeichens darf **die Länge** nicht überschreiten(kann überarbeitet werden).

source: **For Python Language Users**
de: **Für Python-Sprachbenutzer**

source: **Step 3**: Run.
de: **Schritt 3:** Ausführen.

source: You can **Modify/Reset/Copy/Run/Stop** the code below. But before that, you need to go to source code path like ``davinci-kit-for-raspberry-pi/python``.
de: Sie können den folgenden Code **Ändern/Zurücksetzen/Kopieren/Ausführen/Stoppen**. Zuvor müssen Sie jedoch zu einem Quellcodepfad wie ``davinci-kit-for-raspberry-pi/python`` gehen.

source: The function on() starts the buzzer and the LED.
de: Die Funktion on() startet den Summer und die LED.

source: The function off() is used to turn off the buzzer and the LED.
de: Mit der Funktion off () werden der Summer und die LED ausgeschaltet.

source: When you type the relevant characters with the keyboard, upper() will convert the input letters to their capital form.
de: Wenn Sie die relevanten Zeichen mit der Tastatur eingeben, konvertiert Upper() die Eingabebuchstaben in ihre Großbuchstaben.

source: Printf () then prints the clear text on the computer screen, and the morsecod() function causes the buzzer and the LED to emit Morse code.
de: Printf() druckt dann den Klartext auf dem Computerbildschirm, und die Funktion morsecod() bewirkt, dass der Summer und die LED Morsecode ausgeben.

source: Phenomenon Picture
de: Phänomen Bild
