Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/i2c_configuration.po
Languages: de, ja

source: I2C Configuration
de: 3.2.1 I2C-Konfiguration
ja: I2Cコンフィギュレーション

source: **Step 1**: Enable the I2C port of your Raspberry Pi (If you have enabled it, skip this; if you do not know whether you have done that or not, please continue).
de: **Schritt 1:** Aktivieren Sie den I2C-Port Ihres Raspberry Pi (Wenn Sie ihn aktiviert haben, überspringen Sie diesen; wenn Sie nicht wissen, ob Sie dies getan haben oder nicht, fahren Sie bitte fort).
ja: **ステップ1：** Raspberry PiのI2Cポートを作動させる（作動した場合は、これをスキップしてください。これを行ったかどうかわからない場合は、続行してください）。

source: **3 Interfacing options**
de: **3 Schnittstellenoptionen**
ja: **3 インターフェースオプション**

source: **<Yes>, then <Ok> -> <Finish>**
de: **<Yes>, dann<Ok> -><Finish>**
ja: **<Yes>，その時<Ok> -> <Finish>**

source: **Step 2:** Check whether the i2c modules are loaded and active.
de: **Schritt 2:** Überprüfen Sie, ob die i2c-Module geladen und aktiv sind.
ja: **ステップ2：** i2cモジュールがロードされ作動しているかどうかを確認する。

source: Then the following codes will appear (the number may be different).
de: Dann erscheinen die folgenden Codes (die Nummer kann abweichen).
ja: すると、次のようなコードが表示されます（番号は異なる場合があります）。

source: **Step 3:** Install i2c-tools.
de: **Schritt 3:** Installieren Sie i2c-tools.
ja: **ステップ3：** i2c-toolsを実装する。

source: **Step 4:** Check the address of the I2C device.
de: **Schritt 4:** Überprüfen Sie die Adresse des I2C-Geräts.
ja: **ステップ4：** I2Cデバイスのアドレスを確認する。

source: **Step 5:**
de: **Schritt 5:**
ja: **ステップ5：**

source: **For C language users:** Install libi2c-dev.
de: **Für Benutzer in C-Sprache:** Installieren Sie libi2c-dev.
ja: **C言語ユーザーの場合：** libi2c-devを実装する。

source: **For Python users:** Install smbus for I2C.
de: **Für Python-Benutzer:** Installieren Sie smbus für I2C.
ja: **Pythonユーザーの場合：** I2C用のsmbusを実装する。
