Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/libraries.po
Languages: de, ja

source: Libraries
de: Bibliotheken
ja: ライブラリ

source: Two important libraries are used in programming with Raspberry Pi, and they are wiringPi and RPi.GPIO. The Raspberry Pi OS installs them by default, so you can use them directly.
de: Bei der Programmierung mit Raspberry Pi werden zwei wichtige Bibliotheken verwendet: WiringPi und RPi.GPIO. Das Raspberry Pi OS installiert sie standardmäßig, Sie können sie direkt verwenden.
ja: Raspberry Piを使用したプログラミングでは、wiringPiとRPi.GPIOという2つの重要なライブラリが使用されている。Raspberry PiのRaspbian OSイメージはデフォルトでそれらを実装するため、直接使用できる。

source: If you are a Python user, you can program GPIOs with API provided by RPi.GPIO.
de: Wenn Sie ein Python-Benutzer sind, können Sie GPIOs mit der von RPi.GPIO bereitgestellten API programmieren.
ja: Pythonユーザーの場合、RPi.GPIOが提供するAPIを使用してGPIOをプログラミングできる。

source: RPi.GPIO is a module to control Raspberry Pi GPIO channels. This package provides a class to control the GPIO on a Raspberry Pi. For examples and documents, visit: http://sourceforge.net/p/raspberry-gpio-python/wiki/Home/.
de: RPi.GPIO ist ein Modul zur Steuerung von Raspberry Pi GPIO-Kanälen. Dieses Paket enthält eine Klasse zur Steuerung des GPIO einer Raspberry Pi. Beispiele und Dokumente finden Sie unter http://sourceforge.net/p/raspberry-gpio-python/wiki/Home/
ja: RPi.GPIOは、Raspberry Pi GPIOチャネルを制御するモジュールである。このパッケージはRaspberry PiでGPIOを制御するクラスを提供する。例とドキュメントについては、次のURLにアクセスしてください： http://sourceforge.net/p/raspberry-gpio-python/wiki/Home/。

source: Test whether RPi.GPIO is installed or not, type in python:
de: Beim Testen ob RPi.GPIO installiert ist oder nicht, geben Sie bitte Python ein:
ja: RPi.GPIOが実装されているかどうかをテストするには、Pythonを入力する：

source: In Python CLI, input \"import RPi.GPIO\", If no error prompts, it means RPi.GPIO is installed.
de: Geben Sie in Python CLI "import RPi.GPIO" ein. Wenn kein Fehler stellt, bedeutet, RPi.GPIO ist installiert.

source: If you want to quit python CLI, type in:
de: Wenn Sie die Python-CLI beenden möchten, geben Sie ein:
ja: Python CLIを終了する場合は、次を入力する：

source: wiringPi is a C language GPIO library applied to the Raspberry Pi platform. It complies with GUN Lv3. The functions in wiringPi are similar to those in the wiring system of Arduino. They enable the users familiar with Arduino to use wiringPi more easily.
de: wiringPi ist eine GPIO-Bibliothek in C-Sprache, die auf die Raspberry Pi-Plattform angewendet wird. Es entspricht GUN Lv3. Die Funktionen in WiringPi sind ähnlich wie im Verkabelungssystem von Arduino. Die mit Arduino vertrauten Benutzer wird die einfachere Verwendung von wiringPi.
ja: wiringPiは、Raspberry Piプラットフォームに適用されるC言語のGPIOライブラリである。GUN Lv3に準拠している。wiringPi の機能は、Arduinoの配線システムの機能と似ている。Arduinoに精通したユーザーは、wiringPiをより簡単に使用できる。

source: wiringPi includes lots of GPIO commands which enable you to control all kinds of interfaces on Raspberry Pi. You can test whether the wiringPi library is installed successfully or not by the following instructions.
de: WiringPi enthält viele GPIO-Befehle, mit denen Sie alle Arten von Schnittstellen auf Raspberry Pi steuern können. Anhand der folgenden Anweisungen können Sie testen, ob die wiringPi-Bibliothek erfolgreich installiert wurde oder nicht.
ja: wiringPiには、Raspberry Piのあらゆる種類のインターフェイスを制御できる多数のGPIOコマンドが含まれている。以下の手順により、wiringPiライブラリが正常に実装されたかどうかをテストできる。

source: If you are using Raspberry Pi 4B, but the GPIO version is **2.50**, it will cause no response after the C language code is running, that is, GPIO pins do not work. At this time, you need to manually update to version **2.52**, the update steps are as follows :
de: Wenn Sie Raspberry Pi 4B verwenden, die GPIO-Version jedoch **2.50** ist, wird nach Ausführung des C-Sprachcodes keine Antwort ausgegeben, die GPIO-Pins funktionieren nicht. Da müssen Sie manuell auf Version **2.52** aktualisieren. Die Aktualisierungsschritte lauten wie folgt:
ja: Raspberry Pi 4Bを使用している場合、GPIOのバージョンは **2.50** なので、C言語コードを実行した後応答が来ないです。つまり、GPIOピンは機能しません。解決策では、手動でGPIOバージョンを **2.52** に更新する必要があります。更新手順は次の通りです：

source: Check with:
de: Überprüfen Sie mit:
ja: と確認します：

source: and make sure it’s version 2.52.
de: und sicherstellen, es ist Version 2.52.
ja: をクリックし、バージョン2.52であることを確認してください。

source: For more details about wiringPi, you can refer to `WiringPi <http://wiringpi.com/download-and-install/>`_.
de: Weitere Informationen zu wiringPi finden Sie unter: `WiringPi <http://wiringpi.com/download-and-install/>`_.
ja: ワイヤリングパイの詳細については、以下を参照してください `WiringPi <http://wiringpi.com/download-and-install/>`_。

source: In Python CLI, input “import RPi.GPIO”, If no error prompts, it means RPi.GPIO is installed.
ja: Python CLIで、「import RPi.GPIO」と入力する。エラーが表示されない場合は、RPi.GPIOの実装が完了したと意味する。
