Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/remote_desktop.po
Languages: de, ja

source: Remote Desktop
ja: リモートデスクトップ

source: There are two ways to control the desktop of the Raspberry Pi remotely:
de: Es gibt zwei Möglichkeiten, den Desktop des Raspberry Pi aus der Ferne zu steuern:
ja: Raspberry Piのデスクトップを遠隔操作するには2つの方法があります：

source: **VNC** and **XRDP**, you can use any of them.
de: **VNC** und **XRDP**, Sie können jeden von ihnen verwenden.
ja: **VNC** と **XRDP** という二つの方法がある。

source: You can use the function of remote desktop through VNC.
de: Sie können die Funktion des Remotedesktops über VNC verwenden.
ja: VNCを介してリモートデスクトップの機能を使用できる。

source: **Enable VNC service**
de: **Aktivieren Sie den VNC-Dienst**
ja: **VNCサービスを有効にする**

source: The VNC service has been installed in the system. By default, VNC is disabled. You need to enable it in config.
de: Der VNC-Dienst wurde im System installiert. Mit Default ist VNC deaktiviert. Sie müssen es in der Konfiguration aktivieren.
ja: VNCサービスがシステムに実装された。デフォルトでは、VNCは無効である。設定で有効にする必要がある。

source: **Step 1**
de: **Schritt 1**
ja: **ステップ1**

source: Input the following command:
de: Geben Sie den folgenden Befehl ein:
ja: 次のコマンドを入力する：

source: **Step 2**
de: **Schritt 2**
ja: **ステップ2**

source: Choose **3** **Interfacing Options** by press the down arrow key on your keyboard, then press the **Enter** key.
de: Wählen Sie **3** **Schnittstellenoptionen**, indem Sie die Abwärtspfeiltaste auf Ihrer Tastatur drücken und dann die **Eingabetaste** drücken.
ja: キーボードの下矢印キーを押して **3** **Interfacing Options** を選択し、**Enter** キーを押します。

source: **Step 3**
de: **Schritt 3**
ja: **ステップ3**

source: **Step 4**
de: **Schritt 4**
ja: **ステップ4**

source: Select **Yes -> OK -> Finish** to exit the configuration.
de: Wählen Sie **Ja -> OK -> Fertig** stellen, um die Konfiguration zu beenden.
ja: 「YES」-> 「OK」-> 「FINISH」を選択して、構成を終了する。

source: **Login to VNC**
de: **Melden Sie sich bei VNC an**
ja: **VNCにログインする**

source: You need to download and install the `VNC Viewer <https://www.realvnc.com/en/connect/download/viewer/>`_ on personal computer. After the installation is done, open it.
de: Sie müssen den `VNC Viewer <https://www.realvnc.com/en/connect/download/viewer/>`_ herunterladen und auf Ihrem PC installieren. Nachdem die Installation abgeschlossen ist, öffnen Sie es.
ja: `VNC Viewer <https://www.realvnc.com/en/connect/download/viewer/>`_ をダウンロードしてパソコンにインストールする必要があります。 インストールが完了したら、それを開きます。

source: Then select “\ **New connection**\ ”.
de: Wählen Sie dann “\ **Neue Verbindung**\ ”.
ja: T次に、「 **New connection** 」を選択する。

source: Input IP address of Raspberry Pi and any **Name**.
de: Geben Sie die IP-Adresse des Raspberry Pi und einen beliebigen **Namen** ein.
ja: Raspberry PiのIPアドレスと任意の **名** 前を入力する。

source: Double click the **connection** just created:
de: Doppelklicken Sie auf die gerade erstellte **Verbindung**:
ja: 作成した **接続** をダブルクリックする：

source: **Step 5**
de: **Schritt 5**
ja: **ステップ5**

source: Enter Username (**pi**) and Password (**raspberry** by default).
de: Geben Sie Benutzername (**pi**) und Passwort ein (**raspberry** mit Default).
ja: ユーザー名 (**pi**) とパスワード（デフォルトでは **raspberry** である）を入力する。

source: **Step 6**
de: **Schritt 6**
ja: **ステップ6**

source: Now you can see the desktop of the Raspberry Pi:
de: Jetzt können Sie den Desktop des Raspberry Pi sehen:
ja: これで、Raspberry Piのデスクトップが表示される:

source: Another method of remote desktop is XRDP, it provides a graphical login to remote machines using RDP (Microsoft Remote Desktop Protocol).
de: Eine andere Methode des Remote-Desktops ist XRDP. Sie bietet eine grafische Anmeldung an Remote-Computern mithilfe von RDP (Microsoft Remote Desktop Protocol).
ja: リモートデスクトップのもう一つの方法はXRDPで、RDP（Microsoft Remote Desktop Protocol）を使用してリモートマシンへのグラフィカルなログインを提供します。

source: **Install XRDP**
de: **Installieren Sie XRDP**
ja: **XRDPを実装する**

source: Login to Raspberry Pi by using SSH.
de: Melden Sie sich mit SSH bei Raspberry Pi an.
ja: SSHを使用してRaspberry Piにログインする。

source: Input the following instructions to install XRDP.
de: Geben Sie die folgenden Anweisungen ein, um XRDP zu installieren.
ja: 以下の指示を入力して、XRDPを実装する。

source: Later, the installation starts.
de: Später beginnt die Installation.
ja: その後、実装が開始される。

source: Enter "Y", press key “Enter” to confirm.
de: Geben Sie “Y” ein und drücken Sie zur Bestätigung die Taste “Enter”.
ja: 「Y」を入力し、「Enter」キーを押して確認する。

source: 图片1
ja: 画像1

source: Finished the installation, you should login to your Raspberry Pi by using Windows remote desktop applications.
de: Wenn Sie die Installation abgeschlossen haben, sollten Sie sich mit Windows-Remotedesktopanwendungen bei Ihrem Raspberry Pi anmelden.
ja: 実装が完了したら、Windowsリモートデスクトップアプリケーションを使用してRaspberry Piにログインする必要がある。

source: **Login to XRDP**
de: **Melden Sie sich bei XRDP an**
ja: **XRDPにログインする**

source: If you are a Windows user, you can use the Remote Desktop feature that comes with Windows. If you are a Mac user, you can download and use Microsoft Remote Desktop from the APP Store, and there is not much difference between the two. The next example is Windows remote desktop.
de: Wenn Sie Windows-Benutzer sind, können Sie die mit Windows gelieferte Remotedesktopfunktion verwenden. Wenn Sie Mac-Benutzer sind, können Sie Microsoft Remote Desktop aus dem APP Store herunterladen und verwenden, und es gibt keinen großen Unterschied dazwischen. Das nächste Beispiel ist der Windows-Remotedesktop.
ja: Windowsユーザーの場合、Windowsに付属のリモートデスクトップ機能を利用できる。Macユーザーの場合は、APP StoreからMicrosoftリモートデスクトップをダウンロードして使用できる。両者に特に大きな違いはない。Windowsリモートデスクトップについて、次の例をご参照ください。

source: Type in“\ **mstsc**\ ” in Run (WIN+R) to open the Remote Desktop Connection, and input the IP address of Raspberry Pi, then click on “Connect”.
de: Geben Sie “\ **mstsc**\ ” in Ausführen (WIN + R) ein, um die Remotedesktopverbindung zu öffnen, und geben Sie die IP-Adresse von Raspberry Pi ein. Klicken Sie dann auf “Verbinden”.
ja: [実行（WIN + R）]に「 **mstsc** 」と入力してリモートデスクトップ接続を開き、Raspberry PiのIPアドレスを入力して、「接続」をクリックする。

source: Then the xrdp login page pops out. Please type in your username and password. After that, please click “OK”. At the first time you log in, your username is “pi” and the password is “raspberry”.
de: Dann erscheint die xrdp-Anmeldeseite. Bitte geben Sie Ihren Benutzernamen und Ihr Passwort ein. Danach klicken Sie bitte auf “OK”. Wenn Sie sich zum ersten Mal anmelden, lautet Ihr Benutzername “pi” und das Passwort “raspberry”.
ja: 次に、xrdpログインページが表示される。ユーザー名とパスワードを入力してください。その後、「OK」をクリックしてください。初めてログインする場合は、ユーザー名は「pi」、パスワードは「raspberry」である。

source: Here, you successfully login to RPi by using the remote desktop.
de: Hier können Sie sich erfolgreich über den Remotedesktop bei RPi anmelden.
ja: ここでは、リモートデスクトップを使用してRPiに正常にログインできる。

source: **Copyright Notice**
de: **Urheberrechtshinweis**
ja: **著作権表示**

source: All contents including but not limited to texts, images, and code in this manual are owned by the SunFounder Company. You should only use it for personal study, investigation, enjoyment, or other non-commercial or nonprofit purposes, under the related regulations and copyrights laws, without infringing the legal rights of the author and relevant right holders. For any individual or organization that uses these for commercial profit without permission, the Company reserves the right to take legal action.
de: Alle Inhalte, einschließlich, aber nicht beschränkt auf Texte, Bilder und Kode in diesem Handbuch, sind Eigentum der SunFounder Unternehmen. Sie sollten es nur für persönliche Studien, Nachforschungen, Genüsse oder andere nichtkommerzielle oder gemeinnützige Zwecke gemäß den entsprechenden Bestimmungen und Urheberrechtsgesetzen verwenden, ohne die gesetzlichen Rechte des Autors und der relevanten Rechteinhaber zu verletzen. Für jede Person oder Organisation, die diese ohne Erlaubnis für kommerzielle Zwecke nutzt, behält sich das Unternehmen das Recht vor, rechtliche Schritte einzuleiten.
ja: このマニュアルのテキスト、画像とコードを含むがこれらに限定されないすべての内容は、SunFounder Companyが所有している。関連する規制と著作権法に基づき、著者と関連する権利所有者の法的権利を侵害することなく、個人的な研究、調査、享楽、またはその他の非営利目的でのみ使用してください。許可なく営利目的でこれを使用する個人または組織については、会社は法的措置を取る権利を留保する。
