Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/set_up_your_raspberry_pi.po
Languages: de

source: Set up Your Raspberry Pi
de: Richten Sie Ihren Raspberry Pi ein

source: If You Have a Screen
de: Wenn Sie einen Bildschirm haben

source: If you have a screen, it will be easy for you to operate on the Raspberry Pi.
de: Wenn Sie einen Bildschirm haben, können Sie den Raspberry Pi problemlos bedienen.

source: **Required Components**
de: **Erforderliche Komponenten**

source: Any Raspberry Pi
de: Jeglicher Raspberry -Pi

source: 1 \* Power Adapter
de: 1 \* Netzteil

source: 1 \* Micro SD card
de: 1 \* Micro SD Karte

source: 1 \* Screen Power Adapter
de: 1 \* Bildschirm Netzteil

source: 1 \* HDMI cable
de: 1 \* HDMI Kabel

source: 1 \* Screen
de: 1 \* Bildschirm

source: 1 \* Mouse
de: 1 \* Maus

source: 1 \* Keyboard
de: 1 \* Tastatur

source: Insert the SD card you’ve set up with Raspberry Pi OS into the micro SD card slot on the underside of your Raspberry Pi.
de: Legen Sie die mit Raspberry Pi OS eingerichtete SD-Karte in den Micro-SD-Kartensteckplatz an der Unterseite Ihres Raspberry Pi ein.

source: Plug in the Mouse and Keyboard.
de: Stecken Sie die Maus und Tastatur ein.

source: Connect the screen to Raspberry Pi’s HDMI port and make sure your screen is plugged into a wall socket and switched on.
de: Schließen Sie den Bildschirm an den HDMI-Anschluss von Raspberry Pi an und stellen Sie sicher, dass Ihr Bildschirm an eine Wand Steckdose angeschlossen und eingeschaltet ist.

source: If you use a Raspberry Pi 4, you need to connect the screen to the HDMI0 (nearest the power in port).
de: Hinweis: Wenn Sie einen Raspberry Pi 4 verwenden, müssen Sie den Bildschirm an den HDMI0 anschließen (der dem Stromanschluss am nächsten liegt).

source: Use the power adapter to power the Raspberry Pi. After a few seconds, the Raspberry Pi OS desktop will be displayed.
de: Verwenden Sie das Netzteil und versorgen den Raspberry Pi mit Strom. Nach einigen Sekunden wird der Raspberry Pi OS-Bildschirm angezeigt.

source: If You Have No Screen
de: Wenn Sie keinen Bildschirm haben

source: If you don’t have a display, you can log in to the Raspberry Pi remotely, but before that, you need to get the IP of the Raspberry Pi.
de: Wenn Sie keine Anzeige haben, können Sie sich aus der Ferne beim Raspberry Pi anmelden. Zuvor müssen Sie jedoch die IP-Addresse des Raspberry Pi abrufen.

source: Get the IP Address
de: Die IP-Adresse bekommen

source: After the Raspberry Pi is connected to WIFI, we need to get the IP address of it. There are many ways to know the IP address, and two of them are listed as follows.
de: Nachdem der Raspberry Pi mit WIFI verbunden ist, müssen wir die IP-Adresse davon erhalten. Es gibt viele Möglichkeiten, die IP-Adresse zu ermitteln, und zwei davon sind wie folgt aufgeführt.

source: **1. Checking via the router**
de: **1. Überprüfung über den Router**

source: If you have permission to log in the router(such as a home network), you can check the addresses assigned to Raspberry Pi on the admin interface of router.
de: Wenn Sie berechtigt sind, sich beim Router anzumelden (z. B. in einem Heimnetzwerk), können Sie die Raspberry Pi zugewiesenen Adressen auf der Administrationsoberfläche des Routers überprüfen.

source: The default hostname of the Raspberry Pi OS is **raspberrypi**, and you need to find it. (If you are using ArchLinuxARM system, please find alarmpi.)
de: Der Default Hostname des Raspberry Pi-Betriebssystems ist **raspberrypi**, und bitte Sie ihn finden. (Wenn Sie das ArchLinuxARM-System verwenden, suchen Sie bitte alarmpi.)

source: **2. Network Segment Scanning**
de: **2. Scannen von Netzwerksegmenten**

source: You can also use network scanning to look up the IP address of Raspberry Pi. You can apply the software, **Advanced IP scanner** and so on.
de: Sie können auch Netzwerk Scannen verwenden, um die IP-Adresse von Raspberry Pi zu ermitteln. Sie können die Software anwenden, den **erweiterten IP-Scanner** usw.

source: Scan the IP range set, and the name of all connected devices will be displayed. Similarly, the default hostname of the Raspberry Pi OS is **raspberrypi**, if you haven't modified it.
de: Scannen Sie den eingestellten IP-Bereich, und alle angeschlossenen Gerätsnamen wird angezeigt. Ebenso, der Default Hostname des Raspberry Pi-Betriebssystems ist **raspberrypi**, wenn Sie ihn nicht geändert haben.

source: Use the SSH Remote Control
de: Verwenden Sie die SSH-Fernbedienung

source: We can open the Bash Shell of Raspberry Pi by applying SSH. Bash is the standard default shell of Linux. The Shell itself is a program written in C that is the bridge linking the customers and Unix/Linux. Moreover, it can help to complete most of the work needed.
de: Wir können die Bash Shell von Raspberry Pi öffnen, mit Anwendung von SSH. Bash ist die Default Standard Shell von Linux. Die Shell selbst ist ein in C geschriebenes Programm und stellt die Brücke zwischen den Kunden und Unix / Linux dar. Darüber hinaus kann es helfen, den größten Teil der erforderlichen Arbeit zu erledigen.

source: **For Linux or/Mac OS X Users**
de: **Für Linux- oder Mac OS X-Benutzer**

source: **Step 1**
de: **Schritt 1**

source: Go to **Applications**->\ **Utilities**, find the **Terminal**, and open it.
de: Gehen Sie zu **Anwendungen**->\ **Dienstprogramme**, suchen Sie das **Terminal** und öffnen Sie es.

source: **Step 2**
de: **Schritt 2**

source: Type in **ssh pi@ip_address** . \"pi\" is your username and \"ip_address\" is your IP address. For example:
de: Geben Sie **ssh pi @ ip_address** ein. "Pi" ist Ihr Benutzername und "ip_address" ist Ihre IP-Adresse. Z. B. :

source: **Step 3**
de: **Schritt 3**

source: Input \"yes\".
de: Geben Sie "yes" ein.

source: **Step 4**
de: **Schritt 4**

source: Input the passcode and the default password is **raspberry**.
de: Geben Sie den Password ein und das Default Passwort lautet **raspberry**.

source: **Step 5**
de: **Schritt 5**

source: We now get the Raspberry Pi connected and are ready to go to the next step.
de: Wir verbinden jetzt den Raspberry Pi und sind bereit, mit dem nächsten Schritt fortzufahren.

source: When you input the password, the characters do not display on window accordingly, which is normal. What you need is to input the correct password.
de: Wenn Sie das Kennwort eingeben, werden die Zeichen im Fenster nicht entsprechend angezeigt, was normal ist. Sie brauchen lediglich das richtige Passwort einzugeben.

source: **For Windows Users**
de: **Für Windows-Benutzer**

source: If you're a Windows user, you can use SSH with the application of some software. Here, we recommend **PuTTY**.
de: Wenn Sie ein Windows-Benutzer sind, können Sie SSH mit der Anwendung einiger Software verwenden. Hier empfehlen wir **PuTTY**.

source: Download PuTTY.
de: Laden Sie PuTTY herunter.

source: Open PuTTY and click **Session** on the left tree-alike structure. Enter the IP address of the RPi in the text box under **Host Name (or IP address)** and **22** under **Port** (by default it is 22).
de: Öffnen Sie PuTTY und klicken Sie auf **Sitzung** in der linken baumähnlichen Struktur. Geben Sie die IP-Adresse des RPi in das Textfeld unter **Hostname (oder IP-Adresse)** und **22** unter **Port** ein (Default ist 22).

source: Click **Open**. Note that when you first log in to the Raspberry Pi with the IP address, there prompts a security reminder. Just click **Yes**.
de: Klicken Sie auf **Öffnen**. Beachten Sie bitte, beim ersten Anmelden am Raspberry Pi mit der IP-Adresse eine Sicherheitserinnerung wird anzeigen. Klicken Sie einfach auf **Ja**.

source: When the PuTTY window prompts \"**login as:**\", type in \"**pi**\" (the user name of the RPi), and **password**: \"raspberry\" (the default one, if you haven't changed it).
de: Wenn das PuTTY-Fenster \"**login as:**\" auffordert, geben Sie \"**pi**\" (den Benutzernamen des RPi) und das Passwort ein: \"**Himbeere**\" (die Standardeinstellung, wenn Sie sie nicht geändert haben).

source: If inactive appears next to PuTTY, it means that the connection has been broken and needs to be reconnected.
de: Wenn neben PuTTY inaktiv angezeigt wird, bedeutet dies, dass die Verbindung unterbrochen wurde und erneut verbunden werden muss.

source: Here, we get the Raspberry Pi connected and it is time to conduct the next steps.
de: Hier wird der Raspberry Pi angeschlossen und es ist Zeit, die nächsten Schritte durchzuführen.

source: If you are not satisfied with using the command window to control the Raspberry Pi, you can also use the remote desktop function, which can help us manage the files in the Raspberry Pi easily.
de: Wenn Sie mit der Verwendung des Befehlsfensters zur Steuerung des Raspberry Pi nicht zufrieden sind, können Sie auch die Remote-Desktop-Funktion verwenden, die uns helfen kann, die Dateien im Raspberry Pi einfach zu verwalten.

source: For details on how to do this, please refer to :ref:`Remote Desktop`.
de: Einzelheiten dazu finden Sie unter :ref:`Remote Desktop`.
