Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/what_do_we_need.po
Languages: de, ja

source: What Do We Need?
de: Was brauchen wir?
ja: 何が必要なのか？

source: Required Components
de: Erforderliche Komponenten
ja: 必要な部品

source: The Raspberry Pi is a low cost, credit-card sized computer that plugs into a computer monitor or TV, and uses a standard keyboard and mouse. It is a capable little device that enables people of all ages to explore computing, and to learn how to program in languages like Scratch and Python.
de: Der Raspberry Pi ist ein kostengünstiger Computer in Kreditkartengröße, der an einen Computermonitor oder Fernseher angeschlossen wird und eine Standard Tastatur und Maus verwendet. Es ist ein leistungsfähiges kleines Gerät, das Menschen mit allen Altern ermöglicht, Rechnung zu erforschen wie man in Sprachen wie Scratch und Python programmiert.
ja: Raspberry Piは、コンピューターモニターまたはテレビに接続し、標準のキーボードとマウスを使用する、低価格のクレジットカードサイズのコンピューターである。これは、あらゆる年齢の人々がコンピューティングを探求させたり、ScratchやPythonなどの言語でプログラミングする方法を学習させたりする小さなデバイスである。

source: Our kit applies to the following versions of the product of Raspberry Pi
de: Unser Kit gilt für die folgenden Versionen des Produkts von Raspberry Pi:
ja: このキットはRaspberry Pi製品の以下のバージョンに適用される

source: **Power Adapter**
de: **Netzteil**
ja: **ACアダプター**

source: To connect to a power socket, the Raspberry Pi has a micro USB port (the same found on many mobile phones). You will need a power supply which provides at least 2.5 amps.
de: Für den Anschluss an eine Steckdose verfügt der Raspberry Pi über einen Micro-USB-Anschluss (gleich wie bei vielen Mobiltelefonen). Sie benötigen eine Stromversorgung mit mindestens 2.5 Ampere.
ja: Raspberry Piには、電源ソケットに接続する用のマイクロUSBポートがある（多くの携帯電話で見られるものと同じである）。2.5A以上の電源が必要である。

source: **Micro SD Card**
de: **Micro SD Karte**
ja: **マイクロSDカード**

source: Your Raspberry Pi needs an Micro SD card to store all its files and the Raspberry Pi OS. You will need a micro SD card with a capacity of at least 8 GB
de: Ihr Raspberry Pi benötigt eine Micro-SD-Karte, um alle Dateien und das Raspberry Pi-Betriebssystem zu speichern. Sie benötigen eine Micro-SD-Karte mit einer Kapazität von mindestens 8 GB
ja: すべてのファイルとRaspberry Pi OSオペレーティングシステムを保存するため、Raspberry PiにMicro SDカードを取り付けてください。8GB以上の容量のマイクロSDカードが必要である

source: Optional Components
de: Optionale Komponenten
ja: 選択可能な部品

source: **Screen**
de: **Bildschirm**
ja: **画面**

source: To view the desktop environment of Raspberry Pi, you need to use the screen that can be a TV screen or a computer monitor. If the screen has built-in speakers, the Pi plays sounds via them.
de: Um die Bidlshirm Umgebung von Raspberry Pi anzuzeigen, brauchen Sie einen Bildschirm, es kann ein Fernsehbildschirm oder ein Computermonitor sein. Wenn der Bildschirm hat eingebaute Lautsprecher, spielt der Pi über den Ton damit ab.
ja: Raspberry Piのデスクトップ環境を表示するには、テレビ画面またはコンピューターモニターの画面を使用する必要がある。画面にスピーカーが内蔵されている場合、Piはそれらを介して音声を再生する。

source: **Mouse & Keyboard**
de: **Maus & Tastatur**
ja: **マウスとキーボード**

source: When you use a screen , a USB keyboard and a USB mouse are also needed.
de: Wenn Sie einen Bildschirm verwenden, werden auch eine USB-Tastatur und eine USB-Maus benötigt.
ja: 画面を使用する場合は、USBキーボードとUSBマウスも必要である。

source: The Raspberry Pi has a HDMI output port that is compatible with the HDMI ports of most modern TV and computer monitors. If your screen has only DVI or VGA ports, you will need to use the appropriate conversion line.
de: Der Raspberry Pi verfügt über einen HDMI-Ausgangsanschluss, der mit HDMI-Anschlüssen von meisten modernen Fernseh- und Computermonitore kompatibel ist. Wenn Ihr Bildschirm nur über DVI- oder VGA-Anschlüsse verfügt, müssen Sie die entsprechende Konvertierungsleitung verwenden.
ja: Raspberry Piには、ほとんどの最新のテレビおよびコンピューターモニターのHDMIポートと互換性のあるHDMI出力ポートが搭載されている。画面にDVIまたはVGAポートのみがある場合、適切な変換回線を使用してください。

source: **Case**
de: **Tasche**
ja: **保護ケース**

source: You can put the Raspberry Pi in a case; by this means, you can protect your device.
de: Sie können den Raspberry Pi in eine Tasche stecken; Auf diese Weise können Sie Ihr Gerät schützen.
ja: デバイスを保護するために、Raspberry Piを保護ケースに入れることができる。

source: **Sound or Earphone**
de: **Ton oder Kopfhörer**
ja: **サウンドまたはイヤホン**

source: The Raspberry Pi is equipped with an audio port about 3.5 mm that can be used when your screen has no built-in speakers or when there is no screen operation.
de: Der Raspberry Pi ist mit einem Audioanschluss von ca. 3,5 mm ausgestattet, Sie können den verwenden, wenn Ihr Bildschirm keine eingebauten Lautsprecher hat oder wenn es keinen Bildschirmsoperation gibt.
ja: Raspberry Piには約3.5mmのオーディオポートが装備されており、画面にスピーカーが内蔵されていない場合や画面操作がない場合に使用できます。
