Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/quick_quide_on_scratch.po
Languages: de, ja

source: Quick Guide on Scratch
de: Kurzanleitung zu Scratch
ja: Scratchに関するクイックガイド

source: When programming with Scratch 3, you may need a screen for a better experience. Of course, if you don't have a screen, you can also use **VNC** to access the Raspberry Pi desktop remotely, for a detailed tutorial please refer to :ref:`VNC`.
de: Wenn Sie mit Scratch 3 programmieren, benötigen Sie möglicherweise einen Bildschirm, um eine bessere Erfahrung zu machen. Wenn Sie keinen Bildschirm haben, können Sie natürlich auch **VNC** verwenden, um aus der Ferne auf den Raspberry Pi-Desktop zuzugreifen; eine detaillierte Anleitung finden Sie unter :ref:`VNC`.
ja: Scratch 3でプログラミングする場合、より良いエクスペリエンスのために画面が必要になる場合があります。 もちろん、画面がない場合は、**VNC** を使用してRaspberryPiデスクトップにリモートでアクセスすることもできます。詳細なチュートリアルについては、:ref:`VNC` を参照してください。

source: In addition, Scratch 3 needs at least 1GB of RAM to run, and we recommend a Raspberry Pi 4 with at least 2GB RAM. While you can run Scratch 3 on a Raspberry Pi 2, 3, 3B+, or a Raspberry 4 with 1GB RAM, performance on these models is reduced, and depending on what other software you run at the same time, Scratch 3 may fail to start due to lack of memory.
de: Darüber hinaus benötigt Scratch 3 mindestens 1 GB RAM, und wir empfehlen einen Raspberry Pi 4 mit mindestens 2 GB RAM. Sie können Scratch 3 zwar auf einem Raspberry Pi 2, 3, 3B+ oder einem Raspberry 4 mit 1 GB RAM ausführen, aber die Leistung ist bei diesen Modellen reduziert und je nachdem, welche andere Software Sie gleichzeitig ausführen, kann Scratch 3 aufgrund von Speichermangel nicht starten.
ja: さらに、Scratch3を実行するには少なくとも1GBのRAMが必要です。少なくとも2GBのRAMを搭載したRaspberry Pi 4をお勧めします。 Scratch3はRaspberry Pi 2、3、3B +、または1GBRAMのRaspberry 4で実行できますが、これらのモデルのパフォーマンスは低になります。その同時に、実行する他のソフトウェアの影響を受けて、メモリ不足が起こり、Scratch3が起動しない場合があります。

source: Install Scratch 3
de: Scratch 3 installieren
ja: Scratch3をインストールする

source: When installing Raspberry Pi OS (:ref:`Installing the OS`), you have to choose the version with desktop, either with desktop only or with desktop and recommended software.
de: Bei der Installation von Raspberry Pi OS (:ref:`Installing the OS`) müssen Sie die Version mit Desktop auswählen, entweder nur mit Desktop oder mit Desktop und empfohlener Software.
ja: Raspberry Pi OSをインストールする(:ref:`Installing the OS`)ときは、デスクトップ付きのバージョンを選択する必要があります。デスクトップのみ、またはデスクトップと推奨ソフトウェア付きのも問題ありません。

source: If you install the version with the recommended software, you can see Scratch 3 in the system menu at **Programming**.
de: Wenn Sie die Version mit der empfohlenen Software installieren, können Sie Scratch 3 im Systemmenü unter **Programming** sehen.
ja: 推奨ソフトウェアを使用してバージョンをインストールすると、**Programming** のシステムメニューにScratch 3が表示されます。

source: If you installed the desktop-only version, you will need to install Scratch 3 manually, as described below.
de: Wenn Sie die reine Desktop-Version installiert haben, müssen Sie Scratch 3 manuell installieren, wie unten beschrieben.
ja: デスクトップのみのバージョンをインストールした場合は、以下に説明するように、Scratchを手動でインストールする必要があります。

source: Open up the menu, click on **Preferences** -> **Recommended Software**.
de: Öffnen Sie das Menü und klicken Sie auf **Preferences** -> **Recommended Software**.
ja: メニューを開き、**Preferences** -> **Recommended Software** をクリックします。

source: Find scratch 3 and check it, then click **Apply** and finally wait for the installation to finish.
de: Suchen Sie Scratch 3 und markieren Sie es, klicken Sie dann auf **Apply** und warten Sie schließlich, bis die Installation abgeschlossen ist.
ja: Scratch 3を見つけて確認し、**Apply** をクリックして、最後にインストールが完了するのを待ちます。

source: Once the installation is complete, you should see it on the **Programming** in the system menu.
de: Sobald die Installation abgeschlossen ist, sollten Sie sie unter **Programming** im Systemmenü finden.
ja: インストールが完了すると、システムメニューの **Programming** に表示されます。

source: About Scratch 3's Interface
de: Über die Benutzeroberfläche von Scratch 3
ja: Scratch3のインターフェースについて

source: Scratch 3 is designed to be fun, educational, and easy to learn. It has tools for creating interactive stories, games, art, simulations, and more, using block-based programming. Scratch also has its own paint editor and sound editor built-in.
de: Scratch 3 ist so konzipiert, dass es Spaß macht, lehrreich und leicht zu erlernen ist. Es verfügt über Werkzeuge zum Erstellen von interaktiven Geschichten, Spielen, Kunst, Simulationen und mehr, die auf blockbasierter Programmierung basieren. Scratch hat auch einen eigenen Mal- und Sound-Editor integriert.
ja: Scratch 3は、楽しく、教育的で、簡単に習得できるように設計されています。 ブロックベースのプログラミングを使用して、インタラクティブなストーリー、ゲーム、アート、シミュレーションなどを作成するためのツールがあります。 Scratchには、独自のペイントエディタとサウンドエディタも組み込まれています。

source: The top of scratch 3 has some basic options, the first one from left to right is the language option, you can choose different languages for programming. The second one is the **File** option, you can create new files, read local files and save current files with this option. The third is the **Edit** option, which allows you to resume some deletion operations and enable the acceleration mode (in which the sprite movement becomes particularly fast). The fourth is the **Tutorials** option, which allows you to view tutorials for some projects. The fifth is the file naming option, where you can rename the project.
de: Oben in Scratch 3 gibt es einige grundlegende Optionen, die erste von links nach rechts ist die Sprachoption, mit der Sie verschiedene Sprachen für die Programmierung auswählen können. Die zweite ist die Option **Datei**. Mit dieser Option können Sie neue Dateien erstellen, lokale Dateien lesen und aktuelle Dateien speichern. Die dritte ist die Option **Bearbeiten**, mit der Sie einige Löschvorgänge fortsetzen und den Beschleunigungsmodus aktivieren können (in dem die Sprite-Bewegung besonders schnell wird). Die vierte Option ist die Option **Tutorien**, mit der Sie sich Tutorials für einige Projekte ansehen können. Die fünfte Option ist die Option Dateinamen, mit der Sie das Projekt umbenennen können.
ja: スクラッチ3の上部にはいくつかの基本的なオプションがあり、左から右への最初のオプションは言語オプションです。プログラミング用にさまざまな言語を選択できます。 2つ目は **File** オプションです。このオプションを使用すると、新しいファイルを作成したり、ローカルファイルを読み取ったり、現在のファイルを保存したりできます。 3つ目は、**Edit** オプションです。これを使用すると、一部の削除操作を再開して、加速モード（spritesの動きが特に速くなる）を有効にできます。 4つ目は、**Tutorials** オプションです。これを使用すると、一部のプロジェクトのチュートリアルを表示できます。 5つ目は、プロジェクトの名前を変更できるファイル名付けオプションです。

source: **Code**
de: **Skripte**
ja: **コード**

source: It has three main sections: a stage area, block palette, and coding area. Programming by clicking and dragging the block on the block palette to the coding area, and finally your programming results will be displayed on the stage area.
de: Es besteht aus drei Hauptbereichen: einem Bühnenbereich, einer Blockpalette und einem Codierbereich. Programmierung durch Anklicken und Ziehen des Blocks auf der Blockpalette in den Codierbereich und schließlich werden Ihre Programmierergebnisse im Bühnenbereich angezeigt.
ja: ステージ領域、ブロックパレット、コーディング領域の3つの主要なセクションがあります。 ブロックパレットのブロックをクリックしてコーディング領域にドラッグすることによるプログラミング。最後に、プログラミング結果がステージ領域に表示されます。

source: Here is the sprites area of Scratch 3. Above the area are the basic parameters of the sprites, you can add sprites that come with Scratch 3 or upload local sprites.
de: Hier ist der Sprites-Bereich von Scratch 3. Oberhalb des Bereichs befinden sich die Grundparameter der Sprites. Sie können Sprites hinzufügen, die mit Scratch 3 geliefert werden, oder lokale Sprites hochladen.
ja: これがScratch3のsprites areaです。この領域の上にspritesの基本パラメータがあり、Scratch 3に付属のspritesを追加したり、ローカルspritesをアップロードしたりできます。

source: Here is the Scratch 3 backdrop area, mainly to add a suitable backdrop for your stage, you can add the backdrop that comes with Scratch 3 or upload a local one.
de: Hier ist der Scratch 3 Hintergrundbereich, hauptsächlich um einen passenden Hintergrund für deine Bühne hinzuzufügen. Du kannst den Hintergrund, der mit Scratch 3 geliefert wird, hinzufügen oder einen lokalen Hintergrund hochladen.
ja: これがScratch3のbackdrop areaです。主にステージに適したbackdropを追加するために、Scratch 3に付属のbackdropを追加するか、ローカルのものをアップロードできます。

source: This is a **Add Extension** button.
de: Dies ist eine Schaltfläche **Erweiterung hinzufügen**.
ja: これは **Add Extension** ボタンです。

source: In Scratch 3, we can add all kinds of useful extensions, here we take **Video Sensing** as an example and click on it.
de: In Scratch 3 können wir alle Arten von nützlichen Erweiterungen hinzufügen, hier nehmen wir **Video-Erfassung** als Beispiel und klicken es an.
ja: Scratch 3では、あらゆる種類の便利な拡張機能を追加できます。ここでは、Video Sensingを例として取り上げ、それをクリックします。

source: You will see it on the block palette and you can use the functions associated with this extension. If you have a camera connected, you will see the camera screen on the stage area.
de: Sie wird in der Blockpalette angezeigt und Sie können die mit dieser Erweiterung verbundenen Funktionen nutzen. Wenn Sie eine Kamera angeschlossen haben, sehen Sie den Kamerabildschirm im Bühnenbereich.
ja: block paletteに表示され、この拡張機能に関連付けられている機能を使用できます。 カメラを接続している場合は、stage areaにカメラ画面が表示されます。

source: **Costumes**
de: **Kostüme**
ja: **コスチューム**

source: Click on the **Costumes** option in the upper left corner to enter the costumes palette. Different costumes allow the sprites to have different static movements, and when these static movements are stitched together, they form a coherent dynamic movement.
de: Klicken Sie auf die Option **Kostüme** in der oberen linken Ecke, um die Kostümpalette zu öffnen. Verschiedene Kostüme ermöglichen den Sprites unterschiedliche statische Bewegungen, und wenn diese statischen Bewegungen zusammengefügt werden, bilden sie eine kohärente dynamische Bewegung.
ja: 左上隅の **Costumes** オプションをクリックして、costumes paletteに入ります。 costumesが異なれば、spritesの静的な動きも異なります。これらの静的な動きをつなぎ合わせると、一貫した動的な動きが形成されます。

source: **Sounds**
de: **Klänge**
ja: **音声**

source: You may need to use some music clips to make your experiments more interesting. Click on the **Sounds** option in the upper left corner and you can edit the current sound or select/upload a new one.
de: Möglicherweise müssen Sie einige Musikclips verwenden, um Ihre Experimente interessanter zu gestalten. Klicken Sie auf die Option **Sounds** in der oberen linken Ecke und Sie können den aktuellen Sound bearbeiten oder einen neuen Sound auswählen bzw. hochladen.
ja: 実験をより面白くするために、いくつかの音楽クリップを使用する必要があるかもしれません。 左上隅の **Sounds** オプションをクリックすると、現在のサウンドを編集したり、新しいサウンドを選択/アップロードしたりできます。
