Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/scratch_1.10_rotating_fan.po
Languages: de, fan

source: 1.10 Rotating fan
de: 1.10 Rotierender Lüfter
fan: 1.10 Rotating fan (回転ファン)

source: In this project, we will make a spinning star sprite and fan.
de: In diesem Projekt werden wir ein sich drehendes Stern-Sprite und einen Fächer herstellen.
fan: このプロジェクトでは、回転する星のspriteとファンを作成します。

source: Required Components
de: Erforderliche Komponenten
fan: 必要な部品

source: Build the Circuit
de: Baue die Schaltung
fan: 回路を構築する

source: Load the Code and See What Happens
de: Laden Sie den Code und sehen Sie, was passiert
fan: コードをロードして、何が起こるかを確認します

source: Load the code file (``1.10_rotating_fan.sb3``) to Scratch 3.
de: Laden Sie die Codedatei (``1.10_rotating_fan.sb3``) in Scratch 3.
fan: コードファイル(``1.10_rotating_fan.sb3``)をScratch3にロードします。

source: After clicking the green flag on the stage, click on the star sprite，then it and the motor will rotate clockwise; you can change the direction of rotation by clicking on the two **arrow** sprites. When you click on the **star** sprite again, it and the motor will stop rotating.
de: Nachdem Sie auf die grüne Flagge auf der Bühne geklickt haben, klicken Sie auf das Stern-Sprite, dann dreht sich der Motor im Uhrzeigersinn. Sie können die Drehrichtung ändern, indem Sie auf die beiden **Pfeil**-Sprites klicken. Wenn Sie erneut auf das **Stern**-Sprite klicken, hören es und der Motor auf zu drehen.
fan: ステージ上の緑色の旗をクリックした後、star spriteをクリックすると、それとモーターが時計回りに回転します。 2つの **arrow** spritesをクリックすると、回転方向を変更できます。 **star** spriteをもう一度クリックすると、star spriteとモーターの回転が停止します。

source: Tips on Sprite
de: Tipps zu Figur
fan: Spriteに関するヒント

source: Delete the default sprite, then select the **Star** sprite and the **Arrow1** sprite, and copy Arrow1 once.
de: Löschen Sie das Standard-Sprite, wählen Sie dann das **Star**-Sprite und das **Arrow1**-Sprite aus und kopieren Sie Arrow1 einmal.
fan: デフォルトのspriteを削除してから、**Star** spriteと **Arrow1** spriteを選択し、Arrow1を1回コピーします。

source: In the **Costumes** option, change the Arrow2 sprite to a different direction costume.
de: Ändern Sie in der Option **Kostüme** das Arrow2-Sprite in ein anderes Richtungskostüm.
fan: **Costumes** オプションで、Arrow2 spriteを別の方向のcostumeに変更します。

source: Adjust the size and position of the sprite appropriately.
de: Passen Sie die Größe und Position des Sprites entsprechend an.
fan: spriteのサイズと位置を適切に調整します。

source: Tips on Codes
de: Tipps zu Codes
fan: コードに関するヒント

source: **Flow Chart**
de: **Flussdiagramm**
fan: **Flow Chart** フローチャート

source: In this code, you will see 2 pink blocks, turn left and turn right, which are our custom blocks (functions).
de: In diesem Code sehen Sie 2 rosa Blöcke, biegen Sie links ab und biegen Sie rechts ab, die unsere benutzerdefinierten Blöcke (Funktionen) sind.
fan: このコードでは、カスタムブロック（関数）である2つのピンクのブロックが左に曲がって右に曲がっています。

source: **How to Make a Block?**
de: **Wie erstelle ich einen Block?**
fan: **ブロックを作る方法は？**

source: Let's learn how to make a block (function). The block (function) can be used to simplify your program, especially if you perform the same operation multiple times. Putting these operations into a newly declared block can be very convenient for you.
de: Lassen Sie uns lernen, wie man einen Block (eine Funktion) erstellt. Der Block (Funktion) kann verwendet werden, um Ihr Programm zu vereinfachen, insbesondere wenn Sie dieselbe Operation mehrmals ausführen. Das Einfügen dieser Operationen in einen neu deklarierten Block kann für Sie sehr praktisch sein.
fan: ブロック（関数）の作り方を学びましょう。 ブロック（関数）は、プログラムを単純化するために使用できます。特に同じ操作を複数回実行する場合です。 これらの操作を新しく宣言されたブロックに入れると、非常に便利です。

source: First find **My Blocks** in the block palette, then select **Make a Block**.
de: Suchen Sie zuerst **Meine Blöcke** in der Blockpalette und wählen Sie dann **Block erstellen**.
fan: 最初にblock paletteで **My Blocks** を見つけてから、**Make a Block** を選択します。

source: Enter the name of the new block.
de: Geben Sie den Namen des neuen Blocks ein.
fan: 新しいブロックの名前を入力します。

source: After writing the function of the new block in the coding area, save it and then you can find the block in the blocks palette.
de: Nachdem Sie die Funktion des neuen Blocks in den Codierbereich geschrieben haben, speichern Sie diese und Sie finden den Block dann in der Blockpalette.
fan: coding areaに新しいブロックの機能を書き込んだ後、それを保存すると、blocks paletteでブロックを見つけることができます。

source: **turn left**
de: **Biegen Sie links ab**

source: This is the code inside the turn left block to make the motor rotate counterclockwise.
de: Dies ist der Code innerhalb des Linksabbiegeblocks, um den Motor gegen den Uhrzeigersinn drehen zu lassen.
fan: これは、モーターを反時計回りに回転させるための左折ブロック内のコードです。

source: **turn right**
de: **Biegen Sie rechts ab**

source: This is the code inside the turn right block to make the motor rotate clockwise.
de: Dies ist der Code im Block rechts drehen, um den Motor im Uhrzeigersinn drehen zu lassen.
fan: これは、モーターを時計回りに回転させるための右折ブロック内のコードです。
