Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/scratch_1.7_doorbell.po
Languages: de, ja

source: 1.7 Doorbell
de: 1.7 Türklingel
ja: 1.7 Doorbell (ドアベル)

source: Today we will make a doorbell, click the button3 sprite on the stage, the buzzer will sound; click again, the buzzer will stop sounding.
de: Heute werden wir eine Türklingel bauen, klicke auf das Button3-Sprite auf der Bühne, der Summer ertönt; klicke erneut, der Summer hört auf zu ertönen.
ja: 今日はドアベルを作り、ステージ上のbutton3 spriteをクリックすると、ブザーが鳴ります。 もう一度クリックすると、ブザーが鳴り止みます。

source: Required Components
de: Erforderliche Komponenten
ja: 必要な部品

source: Build the Circuit
de: Bauen Sie den Stromkreis auf
ja: 回路を構築する

source: Load the Code and See What Happens
de: Laden Sie den Code und sehen Sie, was passiert
ja: コードをロードして、何が起こるかを確認します

source: Load the code file (``1.7_doorbell.sb3``) to Scratch 3.
de: Lade die Code-Datei (``1.7_doorbell.sb3``) in Scratch 3.
ja: コードファイル(``1.7_doorbell.sb3``)をScratch3にロードします。

source: Click on the green flag on the stage. When we click on the Button 3 sprite, it will turn blue and then the buzzer will sound; when we click again, the **Button3** sprite reverts to gray and the buzzer stops sounding.
de: Klicken Sie auf die grüne Flagge auf der Bühne. Wenn wir auf das Sprite Button 3 klicken, wird es blau und der Summer ertönt. Wenn wir erneut klicken, wird das Sprite **Button3** wieder grau und der Summer hört auf zu ertönen.
ja: ステージ上の緑色の旗をクリックします。 ボタン3のspriteをクリックすると、青色に変わり、ブザーが鳴ります。 もう一度クリックすると、**Button3** スプライトが灰色に戻り、ブザーが鳴り止みます。

source: Tips on Sprite
de: Tipps zu Figur
ja: Spriteに関するヒント

source: Delete the default sprite, then choose the **Button 3** sprite.
de: Löschen Sie das Standard-Sprite und wählen Sie dann das Sprite **Button 3**.
ja: デフォルトのspriteを削除してから、**Button 3** のspriteを選択します。

source: Then set the size to 200.
de: Dann setzen Sie die Größe auf 200.
ja: 次に、サイズを200に設定します。

source: Tips on Codes
de: Tipps zu Codes
ja: コードに関するヒント

source: This block allows you to switch the sprite's costume.
de: Mit diesem Block kannst du das Kostüm des Sprites wechseln.
ja: このブロックを使用すると、spriteのcostumeを切り替えることができます。

source: Set gpio17 to low to make the buzzer sound; set it to high and the buzzer will not sound.
de: Setzen Sie gpio17 auf niedrig, damit der Summer ertönt; stellen Sie ihn auf hoch und der Summer ertönt nicht.
ja: gpio17をlowに設定して、ブザーを鳴らします。 high 設定するとブザーが鳴りません。

source: The **status** switch is used here, and we will use a flowchart to help you understand the whole code.
de: Hier wird der Schalter **status** verwendet, und wir verwenden ein Flussdiagramm, um Ihnen das Verständnis des gesamten Codes zu erleichtern.
ja: ここでは **status** スイッチを使用します。ここでは、コード全体を理解するのに役立つflowchartを使用します。

source: When the green flag is clicked, the **status** will be set to 0 first, and wait for the sprite to be clicked at this time; if **button3** sprite is clicked, it will switch to costume as **button-b** costume (blue) and the **status** will be set to 1. When the main program receives the **status** as 1, it will let the buzzer sound at 0.1s interval. If **button3** is clicked again, it will switch to **button-a** costume (gray) and **status** will be set to 0 again.
de: Wenn das grüne Flag angeklickt wird, wird der **Status** zuerst auf 0 gesetzt und gewartet, bis das Sprite zu diesem Zeitpunkt angeklickt wird; Wenn **button3** geklickt wird, wechselt es zum Kostüm als **button-b** Kostüm (blau) und der **Status** wird auf 1 gesetzt. Wenn das Hauptprogramm den **Status* erhält * als 1 wird der Summer im 0,1s-Intervall ertönt. Wenn **button3** erneut geklickt wird, wechselt es zu **button-a** Kostüm (grau) und **status** wird wieder auf 0 gesetzt.
ja: 緑のフラグがクリックされると、**status** が最初に0に設定され、この時点でspriteがクリックされるのを待ちます。 **button3** spriteをクリックすると、**button-b** costume（青）としてcostumeに切り替わり、**status** が1に設定されます。メインプログラムが **status** を受信すると ※1として、0.1秒間隔でブザーを鳴らします。 **button3** をもう一度クリックすると、**button-a** costume（灰色）に切り替わり、**status** が再び0に設定されます。
