Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/scratch_1.3_tumbler.po
Languages: de, ja

source: 1.3 Tumbler
de: 1.3 Becher
ja: 1.3 Tumbler (タンブラー)

source: In this project, we will make a tilt switch controlled tumbler toy.
de: In diesem Projekt werden wir ein kippschaltergesteuertes Tumbler-Spielzeug bauen.
ja: このプロジェクトでは、チルトスイッチ制御のタンブラー玩具を作ります。

source: Required Components
de: Erforderliche Komponenten
ja: 必要な部品

source: Build the Circuit
de: Bauen Sie den Stromkreis auf
ja: 回路を構築する

source: Load the Code and See What Happens
de: Laden Sie den Code und sehen Sie, was passiert s
ja: コードをロードして、何が起こるかを確認します

source: Load the code file (``1.3_tumbler.sb3``) to Scratch 3.
de: Lade die Code-Datei (``1.3_tumbler.sb3``) in Scratch 3.
ja: コードファイル(``1.3_tumbler.sb3``)をScratch3にロードします。

source: When the tilt switch is placed upright, the tumbler is standing. If you tilt it, the tumbler will also fall. Place it upright again, and the tumbler will stand up again.
de: Wenn der Kippschalter senkrecht steht, bleibt der Becher stehen. Wenn Sie ihn kippen, f채llt auch der Becher um. Stellen Sie ihn wieder aufrecht, und der Becher steht wieder aufrecht.
ja: チルトスイッチを直立させると、タンブラーは立ったままになります。 傾けるとタンブラーも落ちます。 再び直立させると、タンブラーが再び立ち上がります。

source: Tips on Sprite
de: Tipps zu Figur
ja: Spriteに関するヒント

source: Select Sprite1 and click **Costumes** in the top left corner; upload **tumbler1.png** and **tumbler2.png** from the ``home/pi/davinci-kit-for-raspberry-pi/scratch/picture`` path via the **Upload Costume** button; delete the default 2 costumes, and rename the sprite to **tumbler**.
ja: Sprite1を選択し、左上隅の **Costumes** をクリックします。 **Upload Costume** ボタンを使用して、``home/pi/davinci-kit-for-raspberry-pi/scratch/picture`` パスから **tumbler1.png** と **tumbler2.png** をアップロードします。 デフォルトの2つのcostumesを削除し、 spriteの名前を **tumbler** に変更します。

source: Tips on Codes
de: Tipps zu Codes
ja: コードに関するヒント

source: When the green flag is clicked, the initial state of gpio17 is set to low.
de: Wenn die gr체ne Flagge angeklickt wird, wird der Ausgangszustand von gpio17 auf low gesetzt.
ja: 緑の旗をクリックすると、GPIO17の初期状態がlowに設定されます。

source: When pin17 is low (the tilt switch is placed upright), we switch the tumbler sprite's costume to tumbler1 (upright state).
de: Wenn Pin17 niedrig ist (der Kippschalter ist aufrecht), schalten wir das Kost체m des Tumbler-Sprites auf Tumbler1 (aufrechter Zustand).
ja: pin17が低い場合（チルトスイッチが直立している場合）、tumbler sprite’s costumeをtumbler1（直立状態）に切り替えます。

source: When pin17 is high (tilt switch is tilted), switch the tumbler sprite's costume to tumbler2 (tilt state).
de: Wenn Pin17 High ist (Kippschalter ist gekippt), schaltet das Kost체m des Tumbler-Sprites auf Tumbler2 (Kippzustand).
ja: pin17がハイ（チルトスイッチが傾いている）のとき、tumbler sprite’s costumeをtumbler2（チルト状態）に切り替えます。
