Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/scratch_1.1_wand.po
Languages: de, ja

source: 1.1 Wand
de: 1.1 Zauberstab
ja: 1.1 Wand (ワンド)

source: Today we will use LED, Raspberry Pi and Scratch to make a fun game. When we wave the magic wand, the LED will blink.
de: Heute werden wir LED, Raspberry Pi und Scratch verwenden, um ein lustiges Spiel zu machen. Wenn wir den Zauberstab schwingen, blinkt die LED.
ja: 今日は、LED、Raspberry Pi、Scratchを使って楽しいゲームを作ります。 魔法の杖を振ると、LEDが点滅します。

source: Required Components
de: Erforderliche Komponenten
ja: 必要な部品

source: Build the Circuit
de: Bauen Sie den Stromkreis auf
ja: 回路を構築する

source: Add GPIO Extension
de: GPIO-Erweiterung hinzufügen
ja: GPIO拡張機能を追加する

source: Click on the **Add Extension** button in the bottom left corner，then add the **Raspberry Pi GPIO**, an extension we use for all of our Scratch projects.
de: Klicken Sie auf die Schaltfläche **Erweiterung hinzufügen** in der unteren linken Ecke und fügen Sie dann **Raspberry Pi GPIO** hinzu, eine Erweiterung, die wir für alle unsere Scratch-Projekte verwenden.
ja: 左下隅にある **Add Extension** ボタンをクリックしてから、すべてのScratchプロジェクトに使用する拡張機能である **Raspberry Pi GPIO** を追加します。

source: Load the Code and See What Happens
de: Laden Sie den Code und sehen Sie, was passiert
ja: コードをロードして、何が起こるかを確認します

source: Load the code file from your computer(``home/pi/davinci-kit-for-raspberry-pi/scratch/code``) to Scratch 3.
de: Lade die Code-Datei von deinem Computer (``home/pi/davinci-kit-for-raspberry-pi/scratch/code``) in Scratch 3.
ja: コンピューター(``home/pi/davinci-kit-for-raspberry-pi/scratch/code``)からScratch3にコードファイルをロードします。

source: After clicking the magic wand in the stage area, you will see the LED will blink for two seconds.
de: Nachdem du den Zauberstab im Bühnenbereich angeklickt hast, blinkt die LED zwei Sekunden lang.
ja: stage areaの魔法の杖をクリックすると、LEDが2秒間点滅します。

source: Tips on Sprite
de: Tipps zu Figur
ja: Spriteに関するヒント

source: Click on the **Upload Sprite**.
de: Klicken Sie auf die Schaltfläche **Figur hochladen**.
ja: **Upload Sprite** をクリックします。

source: Upload **Wand.png** from the ``home/pi/davinci-kit-for-raspberry-pi/scratch/picture`` path to Scratch 3.
de: Lade **Wand.png** aus dem Pfad ``home/pi/davinci-kit-for-raspberry-pi/scratch/picture`` in Scratch 3 hoch.
ja: **Wand.png** を ``home/pi/davinci-kit-for-raspberry-pi/scratch/picture`` パスからScratch3にアップロードします。

source: Finally, delete the **Sprite1**.
de: Löschen Sie schließlich die **Figur1**.
ja: 最後に、**Sprite1** を削除します。

source: Tips on Codes
de: Tipps zu Codes
ja: コードに関するヒント

source: This is an event block whose trigger condition is to click on the green flag on the stage. A trigger event is required at the beginning of all codes, and you can select other trigger events in the **Events** category of the **block palette**.
de: Dies ist ein Ereignisblock, dessen Auslösebedingung das Klicken auf die grüne Flagge auf der Bühne ist. Ein Auslöseereignis ist am Anfang aller Codes erforderlich, und Sie können andere Auslöseereignisse in der Kategorie **Ereignisse** der **Blockpalette** auswählen.
ja: これは、ステージ上の緑色の旗をクリックすることをトリガー条件とするイベントブロックです。 すべてのコードの先頭にトリガーイベントが必要です。**block palette** の **Events** カテゴリで他のトリガーイベントを選択できます。

source: For example, we can now change the trigger event to a click on the sprite.
de: Zum Beispiel können wir jetzt das Auslöseereignis in einen Klick auf das Figur ändern.
ja: たとえば、トリガーイベントをspriteのクリックに変更できるようになりました。

source: This is a block with a set number of cycles. When we fill in the number 10, the events in the block will be executed 10 times.
de: Dies ist ein Block mit einer bestimmten Anzahl von Zyklen. Wenn wir die Zahl 10 eingeben, werden die Ereignisse im Block 10 Mal ausgeführt.
ja: これは、設定されたサイクル数のブロックです。 数字の10を入力すると、ブロック内のイベントが10回実行されます。

source: This block is used to pause the program for a period of time in seconds.
de: Mit diesem Satz wird das Programm für eine bestimmte Zeitspanne in Sekunden angehalten.
ja: このブロックは、プログラムを秒単位で一時停止するために使用されます。

source: Since the BCM naming method is used in Scratch, this code is setting GPIO17(BCM17) as 0V (low level). Since the cathode of LED is connected to GPIO17, thus the LED will light up. On the contrary, if you set GPIO(BCM17) as high, the LED will turn off.
de: Da in Scratch die BCM-Benennungsmethode verwendet wird, setzt dieser Code GPIO17(BCM17) auf 0V (Low Level). Da die Kathode der LED mit GPIO17 verbunden ist, wird die LED aufleuchten. Wenn Sie dagegen GPIO(BCM17) auf einen hohen Wert einstellen, wird die LED ausgeschaltet.
ja: ScratchではBCMの命名方法が使用されているため、このコードはGPIO17（BCM17）を0V（低レベル）に設定しています。 LEDのカソードがGPIO17に接続されているため、LEDが点灯します。 逆に、GPIO（BCM17）を高く設定すると、LEDが消灯します。
