Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/scratch_1.8_123_wooden_man.po
Languages: de, man

source: 1.8 123 Wooden Man
de: 1.8 123 Holzmann
man: 1.8 123 Wooden Man (123木製の男)

source: Today, we are going to play a game of 123 wooden man.
de: Heute spielen wir 123 Holzmann.
man: 今日は123人の木製の男のゲームをします。

source: Click on the green flag to start the game, hold down the right arrow key on the keyboard to make the sprite go right. If the green light is on, the sprite can move; but when the red LED is on, you have to stop the sprite from moving; otherwise the buzzer will keep ringing.
de: Klicken Sie auf die grüne Flagge, um das Spiel zu starten, halten Sie die rechte Pfeiltaste auf der Tastatur gedrückt, um das Sprite nach rechts zu bewegen. Wenn das grüne Licht leuchtet, kann sich das Sprite bewegen; aber wenn die rote LED leuchtet, müssen Sie die Bewegung des Sprites stoppen; andernfalls klingelt der Summer weiter.
man: 緑の旗をクリックしてゲームを開始し、キーボードの右矢印キーを押したままにしてspriteを右に動かします。 緑色のライトが点灯している場合、スプライトは移動できます。 ただし、赤いLEDが点灯している場合は、スプライトの移動を停止する必要があります。 そうしないと、ブザーが鳴り続けます。

source: Required Components
de: Erforderliche Komponenten
man: 必要な部品

source: Build the Circuit
de: Baue die Schaltung
man: 回路を構築する

source: Load the Code and See What Happens
de: Laden Sie den Code und sehen Sie, was passiert
man: コードをロードして、何が起こるかを確認します

source: Load the code file (``1.8_123_wooden_man.sb3``) to Scratch 3.
de: Laden Sie die Codedatei (``1.8_123_wooden_man.sb3``) in Scratch 3.
man: コードファイル(``1.8_123_wooden_man.sb3``)をScratch3にロードします。

source: When the green LED is on, you can use the right arrow key to control **Avery** to walk to the right; when the red LED is on, if you continue to let **Avery** move to the right, then an alarm will sound.
de: Wenn die grüne LED leuchtet, können Sie **Avery** mit der rechten Pfeiltaste so steuern, dass sie nach rechts geht; Wenn die rote LED leuchtet und Sie **Avery** weiter nach rechts bewegen lassen, ertönt ein Alarm.
man: 緑色のLEDが点灯している場合は、右矢印キーを使用して **Avery** を制御して右に歩くことができます。 赤いLEDが点灯しているときに、**Avery** を右に動かし続けると、アラームが鳴ります。

source: Tips on Sprite
de: Tipps zu Sprite
man: Spriteのヒント

source: Delete the default sprite, then choose the **Avery Walking** sprite.
de: Löschen Sie das Standard-Sprite und wählen Sie dann das **Avery Walking**-Sprite.
man: デフォルトのSpriteを削除してから、**Avery Walking** spriteを選択します。

source: Tips on Codes
de: Tipps zu Codes
man: コードに関するヒント

source: Initialize all pins to high.
de: Initialisieren Sie alle Pins auf High.
man: すべてのピンをHighに初期化します。

source: When the game starts, assign the status variable to 1, indicating that the Avery Walking sprite is movable, and then set gpio18 to low, which lights up the green LED for 5s.
de: Wenn das Spiel startet, weisen Sie die Statusvariable auf 1 zu, um anzuzeigen, dass das Avery Walking-Sprite beweglich ist, und setzen Sie dann gpio18 auf niedrig, wodurch die grüne LED 5 Sekunden lang aufleuchtet.
man: ゲームが開始したら、ステータス変数を1に割り当てて、Avery Walking spriteが移動可能であることを示します。次に、GPIO18を低に設定します。これにより、緑色のLEDが5秒間点灯します。

source: Set gpio18 to high, then set gpio27 to low, which means turn off the green LED and light up the yellow LED for 0.5s.
de: Setzen Sie gpio18 auf hoch und dann gpio27 auf niedrig, d.h. schalten Sie die grüne LED aus und leuchten Sie die gelbe LED für 0,5s auf.
man: GPIO18を高に設定してから、GPIO27を低に設定します。これは、緑色のLEDをオフにし、黄色のLEDを0.5秒間点灯させることを意味します。

source: Assign the status variable to 0, which means the Avery Walking sprite is not moving; then set gpio27 to low and gpio17 to high, which turns off the yellow LED and then lights up the red LED for 3s. Finally, set gpio17 to high to turn off the red LED.
de: Weisen Sie die Statusvariable auf 0 zu, was bedeutet, dass sich das Avery Walking-Sprite nicht bewegt; setze dann gpio27 auf low und gpio17 auf high, was die gelbe LED ausschaltet und dann die rote LED für 3s aufleuchtet. Setzen Sie schließlich gpio17 auf hoch, um die rote LED auszuschalten.
man: ステータス変数を0に割り当てます。これは、Avery Walking spriteが移動していないことを意味します。 次に、GPIO27をlowに設定し、GPIO17をhighに設定します。これにより、黄色のLEDがオフになり、次に赤色のLEDが3秒間点灯します。 最後に、GPIO17をhighに設定して、赤いLEDをオフにします。

source: When we press the right arrow key on the keyboard, we need to switch the **Avery Walking** sprite to the next costume so that we can see Avery walking to the right. Then we need to determine the value of the **status** variable. If it is 0, it means that the Avery Walking sprite is not moving at this moment, and the buzzer will sound to warn you that you cannot press the right arrow key again.
de: Wenn wir die rechte Pfeiltaste auf der Tastatur drücken, müssen wir das Sprite **Avery Walking** auf das nächste Kostüm umschalten, damit wir Avery nach rechts gehen sehen. Dann müssen wir den Wert der Variable **status** bestimmen. Wenn es 0 ist, bedeutet dies, dass sich das Avery Walking-Sprite in diesem Moment nicht bewegt, und der Summer ertönt, um Sie zu warnen, dass Sie die rechte Pfeiltaste nicht erneut drücken können.
man: キーボードのright arrowキーを押すと、Averyが右に歩いているのが見えるように、**Avery Walking** spriteを次のcostumeに切り替える必要があります。 次に、**status** 変数の値を決定する必要があります。 0の場合は、現時点でAvery Walking spriteが動いていないことを意味し、right arrowキーを再度押すことができないことを警告するブザーが鳴ります。
