Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/scratch_1.6_water_lamp.po
Languages: de, ja

source: 1.6 Water Lamp
ja: 1.6 Water Lamp (ウォーターランプ)

source: Today, we will use LED Bar Graph, Raspberry Pi and scratch to make a Water Lamp.
de: Heute werden wir mit LED-Balkengrafik, Raspberry Pi und Scratch eine Wasserlampe bauen.
ja: 今日は、LED棒グラフ、Raspberry Pi、scratchを使用してWater Lampを作成します。

source: The LED Bar Graph will light up in order with the direction of the arrows on the stage.
de: Die LED-Balkenanzeige leuchtet in der Reihenfolge der Pfeile auf der Bühne auf.
ja: LED棒グラフがstage上の矢印の方向に合わせて点灯します。

source: Required Components
de: Erforderliche Komponenten
ja: 必要な部品

source: Build the Circuit
de: Bauen Sie den Stromkreis auf
ja: 回路を構築する

source: Load the Code and See What Happens
de: Laden Sie den Code und sehen Sie, was passiert
ja: コードをロードして、何が起こるかを確認します

source: Load the code file (``1.6_water_lamp.sb3``) from your computer to Scratch 3.
de: Lade die Code-Datei (``1.6_water_lamp.sb3``) von deinem Computer in Scratch 3.
ja: コードファイル(``1.6_water_lamp.sb3``)をコンピューターからScratch3にロードします。

source: By clicking on **Arrow1**, the LEDs on the LED bar are lit in sequence from the left to the right (one at a time) and then off. Click **Arrow2** and the LEDs light up in the opposite order.
de: Wenn Sie auf **Pfeil1** klicken, leuchten die LEDs auf der LED-Leiste nacheinander von links nach rechts auf (eine nach der anderen) und gehen dann aus. Klicken Sie auf **Pfeil2** und die LEDs leuchten in der umgekehrten Reihenfolge auf.
ja: **Arrow1** をクリックすると、LEDバーのLEDが左から右に（一度に1つずつ）順番に点灯し、その後消灯します。 **Arrow2** をクリックすると、LEDが逆の順序で点灯します。

source: Tips on Sprites
de: Tipps zu Figur
ja: Spriteに関するヒント

source: Delete the default sprite and choose the **Arrow1** sprite.
de: Löschen Sie das Standard-Figur und wählen Sie das Figur **Pfeil1**.
ja: デフォルトのspriteを削除し、**Arrow1** spriteを選択します。

source: Here we will need 2 **Arrow1** sprites, which can be done with the duplicate button.
de: Hier benötigen wir 2 **Pfeil1**-Sprites, die mit dem Duplikat-Button erstellt werden können.
ja: ここでは、2つの **Arrow1** spriteが必要です。これは、複製ボタンを利用し完成できます。

source: Click on the **Arrow 2** sprite and change the direction of the arrow by selecting costume 2.
de: Klicken Sie auf das Sprite **Pfeil 2** und ändern Sie die Richtung des Pfeils, indem Sie Kostüm 2 wählen.
ja: **Arrow 2** のSpriteをクリックし、costume2を選択して矢印の方向を変更します。

source: Now let's make a variable.
de: Nun wollen wir eine Variable erstellen.
ja: それでは、変数を作成しましょう。

source: Name it as **num**.
de: Benennen Sie es als **num**.
ja: **num** という名前を付けます。

source: Follow the same method to create a list called **led**.
de: Gehen Sie genauso vor, um eine Liste namens **led** zu erstellen.
ja: 同じ方法に従って、**led** というリストを作成します。

source: After adding, you should see the **num** variable and the **led** list on the stage area.
de: Nach dem Hinzufügen sollten Sie die Variable **num** und die Liste **led** im Bühnenbereich sehen.
ja: 追加すると、stage areaに **num** 変数と **led** リストが表示されます。

source: Click **+** to add 10 list items and enter the pin numbers in order (17,18,27,22,23,24,25,2,3,8).
de: Klicken Sie auf **+**, um 10 Listenelemente hinzuzufügen, und geben Sie die Pin-Nummern der Reihe nach ein (17,18,27,22,23,24,25,2,3,8).
ja: **+** をクリックして10個のリスト項目を追加し、ピン番号を順番に入力します（17、18、27、22、23、24、25、2、3、8）。

source: Tips on Codes
de: Tipps zu Codes
ja: コードに関するヒント

source: This is an event block that is triggered when the current sprite is clicked.
de: Dies ist ein Ereignisblock, der ausgelöst wird, wenn das aktuelle Sprite angeklickt wird.
ja: これは、現在のspriteがクリックされたときにトリガーされるイベントブロックです。

source: The initial value of the **num** variable determines which LED is lit first.
de: Der Anfangswert der Variablen **num** bestimmt, welche LED zuerst leuchtet.
ja: **num** 変数の初期値によって、最初に点灯するLEDが決まります。

source: Set the pin corresponding to **num** in the led list to low to light the LED, and then set the pin corresponding to **num-1** to high to turn off the previous LED.
de: Setzen Sie den Pin mit der Nummer **num** in der LED-Liste auf low, um die LED zum Leuchten zu bringen, und setzen Sie dann den Pin mit der Nummer **num-1** auf high, um die vorherige LED auszuschalten.
ja: LEDリストの **num** に対応するピンをlowに設定してLEDを点灯させ、次に **num-1** に対応するピンをhighに設定して前のLEDをオフにします。
