Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/scratch_1.5_wake_up_the_owl.po
Languages: de, ja

source: 1.5 Wake up the Owl
de: 1.5 Weck die Eule auf
ja: 1.5 Wake up the Owl (フクロウを起こす)

source: Today we are going to play a game of waking up the owl.
de: Heute werden wir ein Spiel spielen, bei dem es darum geht, die Eule zu wecken.
ja: 今日はフクロウを起こすゲームをします。

source: When someone approaches the PIR sensor module, the owl will wake up from sleep.
de: Wenn sich jemand dem PIR-Sensormodul nähert, erwacht die Eule aus dem Schlaf.
ja: 誰かがPIRセンサーモジュールに近づくと、フクロウは眠りから目覚めます。

source: Required Components
de: Erforderliche Komponenten
ja: 必要な部品

source: Build the Circuit
de: Bauen Sie den Stromkreis auf
ja: 回路を構築する

source: Load the Code and See What Happens
de: Laden Sie den Code und sehen Sie, was passiert
ja: コードをロードして、何が起こるかを確認します

source: Load the code file (``1.5_wake_up_the_owl.sb3``) to Scratch 3.
de: Laden Sie die Codedatei (``1.5_wake_up_the_owl.sb3``) in Scratch 3.
ja: コードファイル(``1.5_wake_up_the_owl.sb3``) をScratch3にロードします。

source: When you approach the PIR sensor module, you will see the owl on the stage area open its wings and wake up, and when you leave, the owl will go back to sleep again.
de: Wenn Sie sich dem PIR-Sensormodul nähern, sehen Sie, wie die Eule auf dem Bühnenbereich ihre Flügel öffnet und aufwacht, und wenn Sie gehen, schläft die Eule wieder ein.
ja: PIRセンサーモジュールに近づくと、stage areaのフクロウが羽を開いて目を覚ますのがわかります。離れると、フクロウは再び眠りに戻ります。

source: Tips on Sprite
de: Tipps zu Figur
ja: Spriteに関するヒント

source: Select Sprite1 and click **Costumes** in the top left corner; upload **owl1.png** and **owl2.png** from the ``home/pi/davinci-kit-for-raspberry-pi/scratch/picture`` path via the **Upload Costume** button; delete the default 2 costumes, and rename the sprite to **owl**.
de: Wählen Sie Sprite1 und klicken Sie auf **Kostüme** in der oberen linken Ecke; laden Sie **owl1.png** und **owl2.png** aus dem Pfad ``home/pi/davinci-kit-for-raspberry-pi/scratch/picture`` über die Schaltfläche **Kostüm hochladen** hoch; löschen Sie die 2 Standardkostüme und benennen Sie das Sprite in **owl** um.
ja: Sprite1を選択し、左上隅にある **コスチューム** をクリックします。 **owl1.png** と **owl2.png** を、[コスチュームのアップロード]ボタンを介して ``home/pi/davinci-kit-for-raspberry-pi/scratch/picture`` パスからアップロードします。 デフォルトの2つのコスチュームを削除し、スプライトの名前を **owl** に変更します。

source: Tips on Codes
de: Tipps zu Codes
ja: コードに関するヒント

source: When the green flag is clicked, the initial state of gpio17 is set to low.
de: Wenn die grüne Flagge angeklickt wird, wird der Ausgangszustand von gpio17 auf low gesetzt.
ja: 緑の旗をクリックすると、GPIO17の初期状態がlowに設定されます。

source: When pin17 is low (no one is approaching), switch the costume of the owl sprite to owl1 (sleeping state).
de: Wenn Pin17 niedrig ist (es nähert sich niemand), schalte das Kostüm des Eulen-Sprites auf Eule1 (Schlafzustand).
ja: pin17が低い（誰も近づいていない）場合は、フクロウのSpriteのcostumeをowl1（sleeping状態）に切り替えます。

source: When pin17 is high (someone is approaching), we switch the costume of owl sprite to owl2 (wake up state).
de: Wenn Pin17 hoch ist (jemand nähert sich), schalten wir das Kostüm des Eulen-Sprites auf Eule2 (Wachzustand).
ja: pin17が高い（誰かが近づいている）とき、フクロウのSpriteのcostumeをowl2（wake up状態）に切り替えます。
