Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/scratch_1.9_inflating_the_balloon.po
Languages: de, ja

source: 1.9 Inflating the Balloon
de: 1.9 Aufblasen des Ballons
ja: 1.9 Inflating the Balloon (バルーンを膨らませる)

source: Here, we will play a game of ballooning.
de: Hier spielen wir eine Ballonfahrt.
ja: ここでは、バルーニングのゲームをします。

source: By toggling Slide to the left to start to inflate the balloon, at this time the balloon will get bigger and bigger. If the balloon is too large will blow up; if the balloon is too small, it will not float into the air. You need to judge when to toggle the switch to the right to stop pumping.
de: Durch Umschalten von Slide nach links, um den Ballon aufzublasen, wird der Ballon zu diesem Zeitpunkt immer größer. Wenn der Ballon zu groß ist, bläst er auf; Wenn der Ballon zu klein ist, schwebt er nicht in der Luft. Sie müssen beurteilen, wann Sie den Schalter nach rechts schieben müssen, um das Pumpen zu stoppen.
ja: スライドを左に切り替えてバルーンを膨らませ始めると、この時点でバルーンはどんどん大きくなります。 風船が大きすぎると爆発します。 気球が小さすぎると空中に浮きません。 ポンプを停止するには、スイッチを右に切り替えるタイミングを判断する必要があります。

source: Required Components
de: Erforderliche Komponenten
ja: 必要な部品

source: Build the Circuit
de: Baue die Schaltung
ja: 回路を構築する

source: Load the Code and See What Happens
de: Laden Sie den Code und sehen Sie, was passiert
ja: コードをロードして、何が起こるかを確認します

source: Load the code file (``1.9_inflating_the_balloon.sb3``) to Scratch 3.
de: Laden Sie die Codedatei (``1.9_inflating_the_balloon.sb3``) in Scratch 3.
ja: コードファイル(``1.9_inflating_the_balloon.sb3``)をScratch3にロードします。

source: By toggling Slider to the left to start to inflate the balloon, at this time the balloon will get bigger and bigger. If the balloon is too large will blow up; if the balloon is too small, it will not float into the air. You need to judge when to toggle the switch to the right to stop pumping.
de: Durch Umschalten des Schiebereglers nach links, um mit dem Aufblasen des Ballons zu beginnen, wird der Ballon zu diesem Zeitpunkt immer größer. Wenn der Ballon zu groß ist, bläst er auf; Wenn der Ballon zu klein ist, schwebt er nicht in der Luft. Sie müssen beurteilen, wann Sie den Schalter nach rechts schieben müssen, um das Pumpen zu stoppen.
ja: スライダーを左に切り替えてバルーンを膨らませ始めると、この時点でバルーンはどんどん大きくなります。 風船が大きすぎると爆発します。 気球が小さすぎると空中に浮きません。 ポンプを停止するには、スイッチを右に切り替えるタイミングを判断する必要があります。

source: Tips on Sprite
de: Tipps zu Figur
ja: Spriteに関するヒント

source: Delete the previous Sprite1 sprite, then add the **Balloon1** sprite.
de: Löschen Sie das vorherige Sprite1-Sprite und fügen Sie dann das **Balloon1**-Sprite hinzu.
ja: 前のSprite1 spriteを削除してから、**Balloon1** spriteを追加します。

source: A balloon explosion sound effect is used in this project, so let's see how it was added.
de: In diesem Projekt wird ein Ballonexplosions-Soundeffekt verwendet. Sehen wir uns also an, wie er hinzugefügt wurde.
ja: このプロジェクトでは風船爆発効果音を使用しているので、どのように追加されたか見てみましょう。

source: Click the **Sound** option at the top, then click **Upload Sound** to upload ``boom.wav`` from the ``home/pi/davinci-kit-for-raspberry-pi/scratch/sound`` path to Scratch 3.
de: Klicken Sie oben auf die Option **Sound** und dann auf **Sound hochladen**, um ``boom.wav`` von ``home/pi/davinci-kit-for-raspberry-pi/scratch/sound`` hochzuladen. Pfad zu Scratch 3.
ja: 上部の **Sound** オプションをクリックし、**Upload Sound** をクリックして、``boom.wav`` を ``home/pi/davinci-kit-for-raspberry-pi/scratch/sound`` パスからScratch3にアップロードします。

source: Tips on Codes
de: Tipps zu Codes
ja: コードに関するヒント

source: This is an event block, and the trigger condition is that gpio17 is high, that is, the switch is toggled to the left.
de: Dies ist ein Ereignisblock, und die Triggerbedingung ist, dass gpio17 hoch ist, dh der Schalter wird nach links geschaltet.
ja: これはイベントブロックであり、トリガー条件はGPIO17がハイである、つまりスイッチが左に切り替えられることです。

source: Set the size threshold of the Ballon1 sprite to 120
de: Stellen Sie die Größenschwelle des Ballon1-Sprites auf 120 . ein
ja: Ballon1 spriteのサイズしきい値を120に設定します

source: Move the coordinates of the Balloon1 sprite to (0,0), which is the center of the stage area.
de: Verschieben Sie die Koordinaten des Sprites Balloon1 auf (0,0), die Mitte des Bühnenbereichs.
ja: Balloon1 spriteの座標を、stage areaの中心である（0,0）に移動します。

source: Set the size of the Balloon1 sprite to 50 and show it in the stage area.
de: Stellen Sie die Größe des Balloon1-Sprites auf 50 ein und zeigen Sie es im Bühnenbereich an.
ja: Balloon1 spriteのサイズを50に設定し、stage areaに表示します。

source: Set up a loop to inflate the balloon, this loop stops when the slider switch is toggled to the right.
de: Richten Sie eine Schlaufe zum Aufblasen des Ballons ein. Diese Schlaufe stoppt, wenn der Schieberegler nach rechts geschoben wird.
ja: バルーンを膨らませるループを設定します。このループは、スライダースイッチを右に切り替えると停止します。

source: Within this loop, the balloon size is increased by 1 every 0.1s, and if it is larger than ``maxSize``, the balloon will burst, at which point the boom sound is made and the code is exited.
de: Innerhalb dieser Schleife wird die Ballongröße alle 0,1s um 1 erhöht, und wenn sie größer als ``maxSize`` ist, platzt die Sprechblase, woraufhin das Boom-Geräusch erzeugt und der Code verlassen wird.
ja: このループ内で、バルーンサイズは0.1秒ごとに1ずつ増加し、``maxSize`` より大きい場合はバルーンが破裂し、その時点でブーム音が鳴り、コードが終了します。

source: After the last loop exits (Slider toggles to the right), determine the position of the Balloon1 sprite based on its size. If the size of the Balloon1 sprite is greater than 90, lift off (move the coordinates to (0, 90), otherwise land (move the coordinates to (0, -149).
de: Nachdem die letzte Schleife beendet wurde (Slider schaltet nach rechts), bestimmen Sie die Position des Balloon1-Sprites basierend auf seiner Größe. Wenn die Größe des Balloon1-Sprites größer als 90 ist, heben Sie ab (bewegen Sie die Koordinaten auf (0, 90), andernfalls landen Sie (bewegen Sie die Koordinaten auf (0, -149).
ja: 最後のループが終了した後（スライダーが右に切り替わります）、サイズに基づいてBalloon1 spriteの位置を決定します。 Balloon1 spriteのサイズが90より大きい場合は、持ち上げて（座標を（0、90）に移動します）、そうでない場合は着陸します（座標を（0、-149）に移動します）。
