Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/scratch_1.4_hare.po
Languages: de, ja

source: 1.4 Hare
de: 1.4 Hase
ja: 1.4Hare (うさぎ)

source: Today, we will use Button, Raspberry Pi and Scratch to create a hare with various changes!
de: Heute werden wir Button, Raspberry Pi und Scratch verwenden, um einen Hasen mit verschiedenen Veränderungen zu erstellen!
ja: 今日は、Button、Raspberry Pi、Scratchを使用して、さまざまな変更を加えたウサギを作成します。

source: When we press the first button, the hare in the stage area will change its body color; when we press the second button, the hare will change its body size; when we press the third button, the hare will take a step forward.
de: Wenn wir den ersten Knopf drücken, ändert der Hase im Bühnenbereich seine Körperfarbe; wenn wir den zweiten Knopf drücken, ändert der Hase seine Körpergröße; wenn wir den dritten Knopf drücken, macht der Hase einen Schritt nach vorne.
ja: 最初のボタンを押すと、stage areaのうさぎの体色が変わります。 2番目のボタンを押すと、うさぎは体のサイズを変更します。 3番目のボタンを押すと、うさぎは一歩前進します。

source: Required Components
de: Erforderliche Komponenten
ja: 必要な部品

source: Build the Circuit
de: Bauen Sie den Stromkreis auf
ja: 回路を構築する

source: Load the Code and See What Happens
de: Laden Sie den Code und sehen Sie, was passiert
ja: コードをロードして、何が起こるかを確認します

source: Load the code file (``1.4_hare.sb3``) into Scratch 3.
de: Lade die Code-Datei (``1.4_hare.sb3``) in Scratch 3.
ja: コードファイル(``1.4_hare.sb3``)をScratch3にロードします。

source: Now you can try to press each of the 3 buttons to see how the Hare on the stage will change.
de: Jetzt kannst du versuchen, jeden der 3 Knöpfe zu drücken, um zu sehen, wie sich der Hase auf der Bühne verändert.
ja: これで、3つのボタンをそれぞれ押して、ステージ上のうさぎがどのように変化するかを確認できます。

source: Tips on Sprite
de: Tipps zu Figur
ja: Spriteに関するヒント

source: Click the **Choose a Sprite** button in the lower right corner of the sprite area, enter **Hare** in the search box, and then click to add it.
de: Klicken Sie auf die Schaltfläche **Figur auswählen** in der unteren rechten Ecke des Sprite-Bereichs, geben Sie **Hase** in das Suchfeld ein, und klicken Sie dann, um es hinzuzufügen.
ja: sprite areaの右下隅にある **Choose a Sprite** ボタンをクリックし、検索ボックスに **Hare** と入力して、クリックして追加します。

source: Delete Sprite1.
de: Löschen Sie Figur1.
ja: Sprite1を削除します。

source: Tips on Codes
de: Tipps zu Codes
ja: コードに関するヒント

source: This is an event block that is triggered when the level of GPIO17 is high, which means that the button is pressed at that moment.
de: Dies ist ein Ereignisblock, der ausgelöst wird, wenn der Pegel von GPIO17 hoch ist, was bedeutet, dass die Taste zu diesem Zeitpunkt gedrückt wird.
ja: これは、GPIO17のレベルが高いときにトリガーされるイベントブロックです。つまり、その瞬間にボタンが押されます。

source: This is a block to change the color of **Hare**, the range of the value is 0 ~ 199, beyond 199 will change from 0 again.
de: Dies ist ein Block, um die Farbe von **Hase** zu ändern, der Bereich des Wertes ist 0 ~ 199, über 199 wird wieder von 0 geändert.
ja: これは **Hare** の色を変更するためのブロックです。値の範囲は0〜199で、199を超えると再び0から変更されます。

source: This is a block used to change the size for sprite, the higher the value, the larger the sprite.
de: Dies ist ein Block, der verwendet wird, um die Größe für das Sprite zu ändern. Je höher der Wert, desto größer das Sprite.
ja: これは、spriteのサイズを変更するために使用されるブロックです。値が大きいほど、spriteは大きくなります。

source: The sprite is also not infinitely large, and its maximum size is related to the original image size.
de: Das Sprite ist auch nicht unendlich groß, und seine maximale Größe hängt von der Größe des Originalbildes ab.
ja: spriteも無限に大きくはなく、その最大サイズは元の画像サイズに関連しています。

source: This is a block that switches sprite costumes, and when **Hare**'s costume keeps switching, it does a series of coherent actions. For example, in this project, make **Hare** take a step forward.
de: Dies ist ein Block, der die Kostüme der Sprites wechselt. Wenn **Hase** sein Kostüm wechselt, führt er eine Reihe von kohärenten Aktionen aus. In diesem Projekt soll **Hase** zum Beispiel einen Schritt nach vorne machen.
ja: これはスプライトコスチュームを切り替えるブロックであり、**Hare** のコスチュームが切り替わり続けると、一連の一貫したアクションを実行します。 たとえば、このプロジェクトでは、**Hare** に一歩前進させます。
