Repository: sunfounder/davinci-kit-for-raspberry-pi
Catalog: docs/source/locale/*/LC_MESSAGES/scratch/scratch_1.2_colorful_balls.po
Languages: de, ja

source: 1.2 Colorful Balls
de: 1.2 Bunte Kugeln
ja: 1.2 Colorful Balls (カラフルなボール)

source: Clicking on different colored balls on the stage area will cause the RGB LED to light up in different colors.
de: Wenn du auf verschiedenfarbige Kugeln auf der Bühne klickst, leuchtet die RGB-LED in verschiedenen Farben auf.
ja: stage areaの異なる色のボールをクリックすると、RGBLEDが異なる色で点灯します。

source: Required Components
de: Erforderliche Komponenten
ja: 必要な部品

source: Build the Circuit
de: Bauen Sie den Stromkreis auf
ja: 回路を構築する

source: Load the Code and See What Happens
de: Laden Sie den Code und sehen Sie, was passiert
ja: コードをロードして、何が起こるかを確認します

source: After loading the code file (``1.2_colorful_balls.sb3``) into Scratch 3, the RGB LED will light up yellow, blue, red, green or purple respectively when you click on the corresponding ball.
de: Nachdem du die Codedatei (``1.2_colorful_balls.sb3``) in Scratch 3 geladen hast, leuchtet die RGB-LED gelb, blau, rot, grün oder lila, wenn du auf den entsprechenden Ball klickst.
ja: コードファイル(``1.2_colorful_balls.sb3``)をScratch 3にロードした後、対応するボールをクリックすると、RGB LEDがそれぞれ黄色、青、赤、緑、または紫に点灯します。

source: Tips on Sprites
de: Tipps zu Figur
ja: Spriteに関するヒント

source: Delete the default sprite, then choose the **Ball** sprite.
de: Löschen Sie das Standard-Sprite und wählen Sie dann das Sprite **Ball**.
ja: デフォルトのspriteを削除してから、**Ball** spriteを選択します。

source: And duplicate it 5 times.
de: Und duplizieren Sie es 5 Mal.
ja: そしてそれを5回複製(duplicate)します。

source: Choose different costumes for these 5 **Ball** sprites and move them to the corresponding positions.
de: Wähle verschiedene Kostüme für diese 5 **Ball**-Sprites und bewege sie an die entsprechenden Positionen.
ja: これらの5つの **Ball** spriteに異なるcostumesを選択し、対応する位置に移動します。

source: Tips on Codes
de: Tipps zu Codes
ja: コードに関するヒント

source: Before understanding the code, we need to understand the `RGB color model <https://en.wikipedia.org/wiki/RGB_color_model>`_.
de: Bevor wir den Code verstehen, müssen wir das "RGB-Farbmodell <https://en.wikipedia.org/wiki/RGB_color_model>" verstehen.
ja: コードを理解する前に、`RGB color model <https://en.wikipedia.org/wiki/RGB_color_model>`_.

source: The RGB color model is an additive color model in which red, green, and blue light are added together in various ways to reproduce a broad array of colors.
de: Das RGB-Farbmodell ist ein additives Farbmodell, bei dem rotes, grünes und blaues Licht auf verschiedene Weise addiert werden, um eine breite Palette von Farben zu reproduzieren.
ja: RGBカラーモデルは、赤、緑、青の光をさまざまな方法で足し合わせて、さまざまな色を再現する加法色モデルです。

source: Additive color mixing: adding red to green yields yellow; adding green to blue yields cyan; adding blue to red yields magenta; adding all three primary colors together yields white.
de: Additive Farbmischung: Wenn man Rot zu Grün addiert, erhält man Gelb; wenn man Grün zu Blau addiert, erhält man Cyan; wenn man Blau zu Rot addiert, erhält man Magenta; wenn man alle drei Grundfarben addiert, erhält man Weiß.
ja: 加法混色：緑に赤を加えると黄色になります。 青に緑を加えるとシアンになります。 赤に青を加えるとマゼンタになります。 3つの原色すべてを足し合わせると白になります。

source: An RGB LED is a combination of 3 LEDs(red LED, green LED, blue LED ) in just one package, you can produce almost any color by combining those three colors. It has 4 pins, one of which is GND, and the other 3 pins control 3 LEDs respectively.
de: Eine RGB-LED ist eine Kombination von 3 LEDs (rote LED, grüne LED, blaue LED) in nur einem Gehäuse, Sie können fast jede Farbe durch die Kombination dieser drei Farben erzeugen. Sie hat 4 Pins, von denen einer GND ist, und die anderen 3 Pins steuern jeweils 3 LEDs.
ja: RGB LEDは、3つのLED（赤色LED、緑色LED、青色LED）を1つのパッケージに組み合わせたもので、これら3つの色を組み合わせることでほぼすべての色を生成できます。 4つのピンがあり、そのうちの1つはGNDで、他の3つのピンはそれぞれ3つのLEDを制御します。

source: So the code to make the RGB LED light yellow is as follows.
de: Der Code, um die RGB-LED gelb leuchten zu lassen, lautet also wie folgt.
ja: したがって、RGBLEDを明るい黄色にするコードは次のとおりです。

source: When the Ball sprite (yellow ball) is clicked, we set gpio17 high (red LED on), gpio18 high (green LED on) and gpio27 low (blue LED off) so that the RGB LED will light yellow.
de: Wenn das Ball-Sprite (gelber Ball) angeklickt wird, setzen wir gpio17 hoch (rote LED an), gpio18 hoch (grüne LED an) und gpio27 niedrig (blaue LED aus), so dass die RGB-LED gelb leuchtet.
ja: Ball sprite（黄色のボール）をクリックすると、GPIO17が高（赤のLEDがオン）、GPIO18が高（緑のLEDがオン）、GPIO27が低（青のLEDがオフ）に設定され、RGBLEDが黄色に点灯するように設定します。

source: You can Write codes to other sprites in the same way to make the RGB LEDs light up in the corresponding colors.
de: Du kannst auf die gleiche Weise Codes in andere Sprites schreiben, um die RGB-LEDs in den entsprechenden Farben aufleuchten zu lassen.
ja: 同じ方法で他のspriteにコードを書き込んで、RGB LEDを対応する色で点灯させることができます。
